pub mod bindings {
/* automatically generated by rust-bindgen */

extern crate libc;

pub const __llvm__ : libc :: c_uint = 1 ; pub const __clang__ : libc :: c_uint = 1 ; pub const __clang_major__ : libc :: c_uint = 7 ; pub const __clang_minor__ : libc :: c_uint = 0 ; pub const __clang_patchlevel__ : libc :: c_uint = 1 ; pub const __clang_version__ : & 'static [ u8 ; 31usize ] = b"7.0.1 (tags/RELEASE_701/final)\0" ; pub const __GNUC_MINOR__ : libc :: c_uint = 2 ; pub const __GNUC_PATCHLEVEL__ : libc :: c_uint = 1 ; pub const __GNUC__ : libc :: c_uint = 4 ; pub const __GXX_ABI_VERSION : libc :: c_uint = 1002 ; pub const __ATOMIC_RELAXED : libc :: c_uint = 0 ; pub const __ATOMIC_CONSUME : libc :: c_uint = 1 ; pub const __ATOMIC_ACQUIRE : libc :: c_uint = 2 ; pub const __ATOMIC_RELEASE : libc :: c_uint = 3 ; pub const __ATOMIC_ACQ_REL : libc :: c_uint = 4 ; pub const __ATOMIC_SEQ_CST : libc :: c_uint = 5 ; pub const __OPENCL_MEMORY_SCOPE_WORK_ITEM : libc :: c_uint = 0 ; pub const __OPENCL_MEMORY_SCOPE_WORK_GROUP : libc :: c_uint = 1 ; pub const __OPENCL_MEMORY_SCOPE_DEVICE : libc :: c_uint = 2 ; pub const __OPENCL_MEMORY_SCOPE_ALL_SVM_DEVICES : libc :: c_uint = 3 ; pub const __OPENCL_MEMORY_SCOPE_SUB_GROUP : libc :: c_uint = 4 ; pub const __PRAGMA_REDEFINE_EXTNAME : libc :: c_uint = 1 ; pub const __VERSION__ : & 'static [ u8 ; 54usize ] = b"4.2.1 Compatible Clang 7.0.1 (tags/RELEASE_701/final)\0" ; pub const __OBJC_BOOL_IS_BOOL : libc :: c_uint = 0 ; pub const __CONSTANT_CFSTRINGS__ : libc :: c_uint = 1 ; pub const __ORDER_LITTLE_ENDIAN__ : libc :: c_uint = 1234 ; pub const __ORDER_BIG_ENDIAN__ : libc :: c_uint = 4321 ; pub const __ORDER_PDP_ENDIAN__ : libc :: c_uint = 3412 ; pub const __BYTE_ORDER__ : libc :: c_uint = 1234 ; pub const __LITTLE_ENDIAN__ : libc :: c_uint = 1 ; pub const _LP64 : libc :: c_uint = 1 ; pub const __LP64__ : libc :: c_uint = 1 ; pub const __CHAR_BIT__ : libc :: c_uint = 8 ; pub const __SCHAR_MAX__ : libc :: c_uint = 127 ; pub const __SHRT_MAX__ : libc :: c_uint = 32767 ; pub const __INT_MAX__ : libc :: c_uint = 2147483647 ; pub const __LONG_MAX__ : libc :: c_ulonglong = 9223372036854775807 ; pub const __LONG_LONG_MAX__ : libc :: c_ulonglong = 9223372036854775807 ; pub const __WCHAR_MAX__ : libc :: c_uint = 2147483647 ; pub const __WINT_MAX__ : libc :: c_uint = 4294967295 ; pub const __INTMAX_MAX__ : libc :: c_ulonglong = 9223372036854775807 ; pub const __SIZE_MAX__ : libc :: c_int = -1 ; pub const __UINTMAX_MAX__ : libc :: c_int = -1 ; pub const __PTRDIFF_MAX__ : libc :: c_ulonglong = 9223372036854775807 ; pub const __INTPTR_MAX__ : libc :: c_ulonglong = 9223372036854775807 ; pub const __UINTPTR_MAX__ : libc :: c_int = -1 ; pub const __SIZEOF_DOUBLE__ : libc :: c_uint = 8 ; pub const __SIZEOF_FLOAT__ : libc :: c_uint = 4 ; pub const __SIZEOF_INT__ : libc :: c_uint = 4 ; pub const __SIZEOF_LONG__ : libc :: c_uint = 8 ; pub const __SIZEOF_LONG_DOUBLE__ : libc :: c_uint = 16 ; pub const __SIZEOF_LONG_LONG__ : libc :: c_uint = 8 ; pub const __SIZEOF_POINTER__ : libc :: c_uint = 8 ; pub const __SIZEOF_SHORT__ : libc :: c_uint = 2 ; pub const __SIZEOF_PTRDIFF_T__ : libc :: c_uint = 8 ; pub const __SIZEOF_SIZE_T__ : libc :: c_uint = 8 ; pub const __SIZEOF_WCHAR_T__ : libc :: c_uint = 4 ; pub const __SIZEOF_WINT_T__ : libc :: c_uint = 4 ; pub const __SIZEOF_INT128__ : libc :: c_uint = 16 ; pub const __INTMAX_FMTd__ : & 'static [ u8 ; 3usize ] = b"ld\0" ; pub const __INTMAX_FMTi__ : & 'static [ u8 ; 3usize ] = b"li\0" ; pub const __UINTMAX_FMTo__ : & 'static [ u8 ; 3usize ] = b"lo\0" ; pub const __UINTMAX_FMTu__ : & 'static [ u8 ; 3usize ] = b"lu\0" ; pub const __UINTMAX_FMTx__ : & 'static [ u8 ; 3usize ] = b"lx\0" ; pub const __UINTMAX_FMTX__ : & 'static [ u8 ; 3usize ] = b"lX\0" ; pub const __INTMAX_WIDTH__ : libc :: c_uint = 64 ; pub const __PTRDIFF_FMTd__ : & 'static [ u8 ; 3usize ] = b"ld\0" ; pub const __PTRDIFF_FMTi__ : & 'static [ u8 ; 3usize ] = b"li\0" ; pub const __PTRDIFF_WIDTH__ : libc :: c_uint = 64 ; pub const __INTPTR_FMTd__ : & 'static [ u8 ; 3usize ] = b"ld\0" ; pub const __INTPTR_FMTi__ : & 'static [ u8 ; 3usize ] = b"li\0" ; pub const __INTPTR_WIDTH__ : libc :: c_uint = 64 ; pub const __SIZE_FMTo__ : & 'static [ u8 ; 3usize ] = b"lo\0" ; pub const __SIZE_FMTu__ : & 'static [ u8 ; 3usize ] = b"lu\0" ; pub const __SIZE_FMTx__ : & 'static [ u8 ; 3usize ] = b"lx\0" ; pub const __SIZE_FMTX__ : & 'static [ u8 ; 3usize ] = b"lX\0" ; pub const __SIZE_WIDTH__ : libc :: c_uint = 64 ; pub const __WCHAR_WIDTH__ : libc :: c_uint = 32 ; pub const __WINT_WIDTH__ : libc :: c_uint = 32 ; pub const __SIG_ATOMIC_WIDTH__ : libc :: c_uint = 32 ; pub const __SIG_ATOMIC_MAX__ : libc :: c_uint = 2147483647 ; pub const __UINTMAX_WIDTH__ : libc :: c_uint = 64 ; pub const __UINTPTR_FMTo__ : & 'static [ u8 ; 3usize ] = b"lo\0" ; pub const __UINTPTR_FMTu__ : & 'static [ u8 ; 3usize ] = b"lu\0" ; pub const __UINTPTR_FMTx__ : & 'static [ u8 ; 3usize ] = b"lx\0" ; pub const __UINTPTR_FMTX__ : & 'static [ u8 ; 3usize ] = b"lX\0" ; pub const __UINTPTR_WIDTH__ : libc :: c_uint = 64 ; pub const __FLT16_HAS_DENORM__ : libc :: c_uint = 1 ; pub const __FLT16_DIG__ : libc :: c_uint = 3 ; pub const __FLT16_DECIMAL_DIG__ : libc :: c_uint = 5 ; pub const __FLT16_HAS_INFINITY__ : libc :: c_uint = 1 ; pub const __FLT16_HAS_QUIET_NAN__ : libc :: c_uint = 1 ; pub const __FLT16_MANT_DIG__ : libc :: c_uint = 11 ; pub const __FLT16_MAX_10_EXP__ : libc :: c_uint = 4 ; pub const __FLT16_MAX_EXP__ : libc :: c_uint = 15 ; pub const __FLT16_MIN_10_EXP__ : libc :: c_int = -13 ; pub const __FLT16_MIN_EXP__ : libc :: c_int = -14 ; pub const __FLT_HAS_DENORM__ : libc :: c_uint = 1 ; pub const __FLT_DIG__ : libc :: c_uint = 6 ; pub const __FLT_DECIMAL_DIG__ : libc :: c_uint = 9 ; pub const __FLT_HAS_INFINITY__ : libc :: c_uint = 1 ; pub const __FLT_HAS_QUIET_NAN__ : libc :: c_uint = 1 ; pub const __FLT_MANT_DIG__ : libc :: c_uint = 24 ; pub const __FLT_MAX_10_EXP__ : libc :: c_uint = 38 ; pub const __FLT_MAX_EXP__ : libc :: c_uint = 128 ; pub const __FLT_MIN_10_EXP__ : libc :: c_int = -37 ; pub const __FLT_MIN_EXP__ : libc :: c_int = -125 ; pub const __DBL_HAS_DENORM__ : libc :: c_uint = 1 ; pub const __DBL_DIG__ : libc :: c_uint = 15 ; pub const __DBL_DECIMAL_DIG__ : libc :: c_uint = 17 ; pub const __DBL_HAS_INFINITY__ : libc :: c_uint = 1 ; pub const __DBL_HAS_QUIET_NAN__ : libc :: c_uint = 1 ; pub const __DBL_MANT_DIG__ : libc :: c_uint = 53 ; pub const __DBL_MAX_10_EXP__ : libc :: c_uint = 308 ; pub const __DBL_MAX_EXP__ : libc :: c_uint = 1024 ; pub const __DBL_MIN_10_EXP__ : libc :: c_int = -307 ; pub const __DBL_MIN_EXP__ : libc :: c_int = -1021 ; pub const __LDBL_HAS_DENORM__ : libc :: c_uint = 1 ; pub const __LDBL_DIG__ : libc :: c_uint = 18 ; pub const __LDBL_DECIMAL_DIG__ : libc :: c_uint = 21 ; pub const __LDBL_HAS_INFINITY__ : libc :: c_uint = 1 ; pub const __LDBL_HAS_QUIET_NAN__ : libc :: c_uint = 1 ; pub const __LDBL_MANT_DIG__ : libc :: c_uint = 64 ; pub const __LDBL_MAX_10_EXP__ : libc :: c_uint = 4932 ; pub const __LDBL_MAX_EXP__ : libc :: c_uint = 16384 ; pub const __LDBL_MIN_10_EXP__ : libc :: c_int = -4931 ; pub const __LDBL_MIN_EXP__ : libc :: c_int = -16381 ; pub const __POINTER_WIDTH__ : libc :: c_uint = 64 ; pub const __BIGGEST_ALIGNMENT__ : libc :: c_uint = 16 ; pub const __WINT_UNSIGNED__ : libc :: c_uint = 1 ; pub const __INT8_FMTd__ : & 'static [ u8 ; 4usize ] = b"hhd\0" ; pub const __INT8_FMTi__ : & 'static [ u8 ; 4usize ] = b"hhi\0" ; pub const __INT16_FMTd__ : & 'static [ u8 ; 3usize ] = b"hd\0" ; pub const __INT16_FMTi__ : & 'static [ u8 ; 3usize ] = b"hi\0" ; pub const __INT32_FMTd__ : & 'static [ u8 ; 2usize ] = b"d\0" ; pub const __INT32_FMTi__ : & 'static [ u8 ; 2usize ] = b"i\0" ; pub const __INT64_FMTd__ : & 'static [ u8 ; 3usize ] = b"ld\0" ; pub const __INT64_FMTi__ : & 'static [ u8 ; 3usize ] = b"li\0" ; pub const __UINT8_FMTo__ : & 'static [ u8 ; 4usize ] = b"hho\0" ; pub const __UINT8_FMTu__ : & 'static [ u8 ; 4usize ] = b"hhu\0" ; pub const __UINT8_FMTx__ : & 'static [ u8 ; 4usize ] = b"hhx\0" ; pub const __UINT8_FMTX__ : & 'static [ u8 ; 4usize ] = b"hhX\0" ; pub const __UINT8_MAX__ : libc :: c_uint = 255 ; pub const __INT8_MAX__ : libc :: c_uint = 127 ; pub const __UINT16_FMTo__ : & 'static [ u8 ; 3usize ] = b"ho\0" ; pub const __UINT16_FMTu__ : & 'static [ u8 ; 3usize ] = b"hu\0" ; pub const __UINT16_FMTx__ : & 'static [ u8 ; 3usize ] = b"hx\0" ; pub const __UINT16_FMTX__ : & 'static [ u8 ; 3usize ] = b"hX\0" ; pub const __UINT16_MAX__ : libc :: c_uint = 65535 ; pub const __INT16_MAX__ : libc :: c_uint = 32767 ; pub const __UINT32_FMTo__ : & 'static [ u8 ; 2usize ] = b"o\0" ; pub const __UINT32_FMTu__ : & 'static [ u8 ; 2usize ] = b"u\0" ; pub const __UINT32_FMTx__ : & 'static [ u8 ; 2usize ] = b"x\0" ; pub const __UINT32_FMTX__ : & 'static [ u8 ; 2usize ] = b"X\0" ; pub const __UINT32_MAX__ : libc :: c_uint = 4294967295 ; pub const __INT32_MAX__ : libc :: c_uint = 2147483647 ; pub const __UINT64_FMTo__ : & 'static [ u8 ; 3usize ] = b"lo\0" ; pub const __UINT64_FMTu__ : & 'static [ u8 ; 3usize ] = b"lu\0" ; pub const __UINT64_FMTx__ : & 'static [ u8 ; 3usize ] = b"lx\0" ; pub const __UINT64_FMTX__ : & 'static [ u8 ; 3usize ] = b"lX\0" ; pub const __UINT64_MAX__ : libc :: c_int = -1 ; pub const __INT64_MAX__ : libc :: c_ulonglong = 9223372036854775807 ; pub const __INT_LEAST8_MAX__ : libc :: c_uint = 127 ; pub const __INT_LEAST8_FMTd__ : & 'static [ u8 ; 4usize ] = b"hhd\0" ; pub const __INT_LEAST8_FMTi__ : & 'static [ u8 ; 4usize ] = b"hhi\0" ; pub const __UINT_LEAST8_MAX__ : libc :: c_uint = 255 ; pub const __UINT_LEAST8_FMTo__ : & 'static [ u8 ; 4usize ] = b"hho\0" ; pub const __UINT_LEAST8_FMTu__ : & 'static [ u8 ; 4usize ] = b"hhu\0" ; pub const __UINT_LEAST8_FMTx__ : & 'static [ u8 ; 4usize ] = b"hhx\0" ; pub const __UINT_LEAST8_FMTX__ : & 'static [ u8 ; 4usize ] = b"hhX\0" ; pub const __INT_LEAST16_MAX__ : libc :: c_uint = 32767 ; pub const __INT_LEAST16_FMTd__ : & 'static [ u8 ; 3usize ] = b"hd\0" ; pub const __INT_LEAST16_FMTi__ : & 'static [ u8 ; 3usize ] = b"hi\0" ; pub const __UINT_LEAST16_MAX__ : libc :: c_uint = 65535 ; pub const __UINT_LEAST16_FMTo__ : & 'static [ u8 ; 3usize ] = b"ho\0" ; pub const __UINT_LEAST16_FMTu__ : & 'static [ u8 ; 3usize ] = b"hu\0" ; pub const __UINT_LEAST16_FMTx__ : & 'static [ u8 ; 3usize ] = b"hx\0" ; pub const __UINT_LEAST16_FMTX__ : & 'static [ u8 ; 3usize ] = b"hX\0" ; pub const __INT_LEAST32_MAX__ : libc :: c_uint = 2147483647 ; pub const __INT_LEAST32_FMTd__ : & 'static [ u8 ; 2usize ] = b"d\0" ; pub const __INT_LEAST32_FMTi__ : & 'static [ u8 ; 2usize ] = b"i\0" ; pub const __UINT_LEAST32_MAX__ : libc :: c_uint = 4294967295 ; pub const __UINT_LEAST32_FMTo__ : & 'static [ u8 ; 2usize ] = b"o\0" ; pub const __UINT_LEAST32_FMTu__ : & 'static [ u8 ; 2usize ] = b"u\0" ; pub const __UINT_LEAST32_FMTx__ : & 'static [ u8 ; 2usize ] = b"x\0" ; pub const __UINT_LEAST32_FMTX__ : & 'static [ u8 ; 2usize ] = b"X\0" ; pub const __INT_LEAST64_MAX__ : libc :: c_ulonglong = 9223372036854775807 ; pub const __INT_LEAST64_FMTd__ : & 'static [ u8 ; 3usize ] = b"ld\0" ; pub const __INT_LEAST64_FMTi__ : & 'static [ u8 ; 3usize ] = b"li\0" ; pub const __UINT_LEAST64_MAX__ : libc :: c_int = -1 ; pub const __UINT_LEAST64_FMTo__ : & 'static [ u8 ; 3usize ] = b"lo\0" ; pub const __UINT_LEAST64_FMTu__ : & 'static [ u8 ; 3usize ] = b"lu\0" ; pub const __UINT_LEAST64_FMTx__ : & 'static [ u8 ; 3usize ] = b"lx\0" ; pub const __UINT_LEAST64_FMTX__ : & 'static [ u8 ; 3usize ] = b"lX\0" ; pub const __INT_FAST8_MAX__ : libc :: c_uint = 127 ; pub const __INT_FAST8_FMTd__ : & 'static [ u8 ; 4usize ] = b"hhd\0" ; pub const __INT_FAST8_FMTi__ : & 'static [ u8 ; 4usize ] = b"hhi\0" ; pub const __UINT_FAST8_MAX__ : libc :: c_uint = 255 ; pub const __UINT_FAST8_FMTo__ : & 'static [ u8 ; 4usize ] = b"hho\0" ; pub const __UINT_FAST8_FMTu__ : & 'static [ u8 ; 4usize ] = b"hhu\0" ; pub const __UINT_FAST8_FMTx__ : & 'static [ u8 ; 4usize ] = b"hhx\0" ; pub const __UINT_FAST8_FMTX__ : & 'static [ u8 ; 4usize ] = b"hhX\0" ; pub const __INT_FAST16_MAX__ : libc :: c_uint = 32767 ; pub const __INT_FAST16_FMTd__ : & 'static [ u8 ; 3usize ] = b"hd\0" ; pub const __INT_FAST16_FMTi__ : & 'static [ u8 ; 3usize ] = b"hi\0" ; pub const __UINT_FAST16_MAX__ : libc :: c_uint = 65535 ; pub const __UINT_FAST16_FMTo__ : & 'static [ u8 ; 3usize ] = b"ho\0" ; pub const __UINT_FAST16_FMTu__ : & 'static [ u8 ; 3usize ] = b"hu\0" ; pub const __UINT_FAST16_FMTx__ : & 'static [ u8 ; 3usize ] = b"hx\0" ; pub const __UINT_FAST16_FMTX__ : & 'static [ u8 ; 3usize ] = b"hX\0" ; pub const __INT_FAST32_MAX__ : libc :: c_uint = 2147483647 ; pub const __INT_FAST32_FMTd__ : & 'static [ u8 ; 2usize ] = b"d\0" ; pub const __INT_FAST32_FMTi__ : & 'static [ u8 ; 2usize ] = b"i\0" ; pub const __UINT_FAST32_MAX__ : libc :: c_uint = 4294967295 ; pub const __UINT_FAST32_FMTo__ : & 'static [ u8 ; 2usize ] = b"o\0" ; pub const __UINT_FAST32_FMTu__ : & 'static [ u8 ; 2usize ] = b"u\0" ; pub const __UINT_FAST32_FMTx__ : & 'static [ u8 ; 2usize ] = b"x\0" ; pub const __UINT_FAST32_FMTX__ : & 'static [ u8 ; 2usize ] = b"X\0" ; pub const __INT_FAST64_MAX__ : libc :: c_ulonglong = 9223372036854775807 ; pub const __INT_FAST64_FMTd__ : & 'static [ u8 ; 3usize ] = b"ld\0" ; pub const __INT_FAST64_FMTi__ : & 'static [ u8 ; 3usize ] = b"li\0" ; pub const __UINT_FAST64_MAX__ : libc :: c_int = -1 ; pub const __UINT_FAST64_FMTo__ : & 'static [ u8 ; 3usize ] = b"lo\0" ; pub const __UINT_FAST64_FMTu__ : & 'static [ u8 ; 3usize ] = b"lu\0" ; pub const __UINT_FAST64_FMTx__ : & 'static [ u8 ; 3usize ] = b"lx\0" ; pub const __UINT_FAST64_FMTX__ : & 'static [ u8 ; 3usize ] = b"lX\0" ; pub const __FINITE_MATH_ONLY__ : libc :: c_uint = 0 ; pub const __GNUC_STDC_INLINE__ : libc :: c_uint = 1 ; pub const __GCC_ATOMIC_TEST_AND_SET_TRUEVAL : libc :: c_uint = 1 ; pub const __CLANG_ATOMIC_BOOL_LOCK_FREE : libc :: c_uint = 2 ; pub const __CLANG_ATOMIC_CHAR_LOCK_FREE : libc :: c_uint = 2 ; pub const __CLANG_ATOMIC_CHAR16_T_LOCK_FREE : libc :: c_uint = 2 ; pub const __CLANG_ATOMIC_CHAR32_T_LOCK_FREE : libc :: c_uint = 2 ; pub const __CLANG_ATOMIC_WCHAR_T_LOCK_FREE : libc :: c_uint = 2 ; pub const __CLANG_ATOMIC_SHORT_LOCK_FREE : libc :: c_uint = 2 ; pub const __CLANG_ATOMIC_INT_LOCK_FREE : libc :: c_uint = 2 ; pub const __CLANG_ATOMIC_LONG_LOCK_FREE : libc :: c_uint = 2 ; pub const __CLANG_ATOMIC_LLONG_LOCK_FREE : libc :: c_uint = 2 ; pub const __CLANG_ATOMIC_POINTER_LOCK_FREE : libc :: c_uint = 2 ; pub const __GCC_ATOMIC_BOOL_LOCK_FREE : libc :: c_uint = 2 ; pub const __GCC_ATOMIC_CHAR_LOCK_FREE : libc :: c_uint = 2 ; pub const __GCC_ATOMIC_CHAR16_T_LOCK_FREE : libc :: c_uint = 2 ; pub const __GCC_ATOMIC_CHAR32_T_LOCK_FREE : libc :: c_uint = 2 ; pub const __GCC_ATOMIC_WCHAR_T_LOCK_FREE : libc :: c_uint = 2 ; pub const __GCC_ATOMIC_SHORT_LOCK_FREE : libc :: c_uint = 2 ; pub const __GCC_ATOMIC_INT_LOCK_FREE : libc :: c_uint = 2 ; pub const __GCC_ATOMIC_LONG_LOCK_FREE : libc :: c_uint = 2 ; pub const __GCC_ATOMIC_LLONG_LOCK_FREE : libc :: c_uint = 2 ; pub const __GCC_ATOMIC_POINTER_LOCK_FREE : libc :: c_uint = 2 ; pub const __NO_INLINE__ : libc :: c_uint = 1 ; pub const __FLT_EVAL_METHOD__ : libc :: c_uint = 0 ; pub const __FLT_RADIX__ : libc :: c_uint = 2 ; pub const __DECIMAL_DIG__ : libc :: c_uint = 21 ; pub const __amd64__ : libc :: c_uint = 1 ; pub const __amd64 : libc :: c_uint = 1 ; pub const __x86_64 : libc :: c_uint = 1 ; pub const __x86_64__ : libc :: c_uint = 1 ; pub const __k8 : libc :: c_uint = 1 ; pub const __k8__ : libc :: c_uint = 1 ; pub const __tune_k8__ : libc :: c_uint = 1 ; pub const __NO_MATH_INLINES : libc :: c_uint = 1 ; pub const __FXSR__ : libc :: c_uint = 1 ; pub const __SSE2__ : libc :: c_uint = 1 ; pub const __SSE2_MATH__ : libc :: c_uint = 1 ; pub const __SSE__ : libc :: c_uint = 1 ; pub const __SSE_MATH__ : libc :: c_uint = 1 ; pub const __MMX__ : libc :: c_uint = 1 ; pub const __GCC_HAVE_SYNC_COMPARE_AND_SWAP_1 : libc :: c_uint = 1 ; pub const __GCC_HAVE_SYNC_COMPARE_AND_SWAP_2 : libc :: c_uint = 1 ; pub const __GCC_HAVE_SYNC_COMPARE_AND_SWAP_4 : libc :: c_uint = 1 ; pub const __GCC_HAVE_SYNC_COMPARE_AND_SWAP_8 : libc :: c_uint = 1 ; pub const __SIZEOF_FLOAT128__ : libc :: c_uint = 16 ; pub const unix : libc :: c_uint = 1 ; pub const __unix : libc :: c_uint = 1 ; pub const __unix__ : libc :: c_uint = 1 ; pub const linux : libc :: c_uint = 1 ; pub const __linux : libc :: c_uint = 1 ; pub const __linux__ : libc :: c_uint = 1 ; pub const __gnu_linux__ : libc :: c_uint = 1 ; pub const __ELF__ : libc :: c_uint = 1 ; pub const __FLOAT128__ : libc :: c_uint = 1 ; pub const __STDC__ : libc :: c_uint = 1 ; pub const __STDC_HOSTED__ : libc :: c_uint = 1 ; pub const __STDC_VERSION__ : libc :: c_uint = 201112 ; pub const __STDC_UTF_16__ : libc :: c_uint = 1 ; pub const __STDC_UTF_32__ : libc :: c_uint = 1 ; pub const _MAGICKCORE_MAGICK_BASECONFIG_H : libc :: c_uint = 1 ; pub const MAGICKCORE_BZLIB_DELEGATE : libc :: c_uint = 1 ; pub const MAGICKCORE_CIPHER_SUPPORT : libc :: c_uint = 1 ; pub const MAGICKCORE_CODER_DIRNAME : & 'static [ u8 ; 7usize ] = b"coders\0" ; pub const MAGICKCORE_CONFIGURE_PATH : & 'static [ u8 ; 30usize ] = b"/usr/local/etc/ImageMagick-7/\0" ; pub const MAGICKCORE_CONFIGURE_RELATIVE_PATH : & 'static [ u8 ; 14usize ] = b"ImageMagick-7\0" ; pub const MAGICKCORE_DJVU_DELEGATE : libc :: c_uint = 1 ; pub const MAGICKCORE_DOCUMENTATION_PATH : & 'static [ u8 ; 36usize ] = b"/usr/local/share/doc/ImageMagick-7/\0" ; pub const MAGICKCORE_EXECUTABLE_PATH : & 'static [ u8 ; 16usize ] = b"/usr/local/bin/\0" ; pub const MAGICKCORE_FILTER_DIRNAME : & 'static [ u8 ; 8usize ] = b"filters\0" ; pub const MAGICKCORE_FONTCONFIG_DELEGATE : libc :: c_uint = 1 ; pub const MAGICKCORE_FREETYPE_DELEGATE : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_ACOSH : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_ARPA_INET_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_ASINH : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_ATANH : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_ATEXIT : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_ATOLL : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_CABS : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_CARG : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_CIMAG : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_CLOCK : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_CLOCK_GETRES : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_CLOCK_GETTIME : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_CLOCK_REALTIME : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_COMPLEX_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_CREAL : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_CTIME_R : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_DECL_PREAD : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_DECL_PWRITE : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_DECL_STRERROR_R : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_DECL_STRLCPY : libc :: c_uint = 0 ; pub const MAGICKCORE_HAVE_DECL_VSNPRINTF : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_DIRENT_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_DLFCN_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_ERF : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_ERRNO_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_EXECVP : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_FCHMOD : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_FCNTL_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_FLOOR : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_FORK : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_FSEEKO : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_FTIME : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_FTRUNCATE : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_GETCWD : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_GETC_UNLOCKED : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_GETDTABLESIZE : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_GETPAGESIZE : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_GETPID : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_GETPWNAM_R : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_GETRLIMIT : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_GETRUSAGE : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_GETTIMEOFDAY : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_GMTIME_R : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_INTMAX_T : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_INTPTR_T : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_INTTYPES_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_ISNAN : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_J0 : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_J1 : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_LCMS2_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_LIMITS_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_LINUX_UNISTD_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_LOCALE_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_LOCALTIME_R : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_LONG_LONG_INT : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_LSTAT : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_MBSTATE_T : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_MEMMOVE : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_MEMORY_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_MEMSET : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_MKSTEMP : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_MMAP : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_MUNMAP : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_NANOSLEEP : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_NETINET_IN_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_NEWLOCALE : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_PCLOSE : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_POLL : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_POPEN : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_POSIX_FADVISE : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_POSIX_FALLOCATE : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_POSIX_MADVISE : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_POSIX_MEMALIGN : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_POSIX_SPAWNP : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_POW : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_PREAD : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_PTHREAD : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_PTHREAD_PRIO_INHERIT : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_PWRITE : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_QSORT_R : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_RAISE : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_RAND_R : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_READLINK : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_REALPATH : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SEEKDIR : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SELECT : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SENDFILE : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SETLOCALE : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SETVBUF : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SHAPE : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SHARED_MEMORY : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SIGACTION : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SIGEMPTYSET : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SOCKET : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SQRT : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STAT : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STDARG_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STDBOOL_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STDINT_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STDLIB_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STRCASECMP : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STRCASESTR : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STRCHR : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STRCSPN : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STRDUP : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STRERROR : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STRERROR_R : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STRINGIZE : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STRINGS_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STRING_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STRNCASECMP : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STRPBRK : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STRRCHR : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STRSPN : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STRSTR : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STRTOD : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STRTOD_L : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STRTOL : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STRTOUL : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_STRUCT_TM_TM_ZONE : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SYMLINK : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SYSCONF : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SYS_IPC_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SYS_MMAN_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SYS_PARAM_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SYS_RESOURCE_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SYS_SELECT_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SYS_SENDFILE_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SYS_SOCKET_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SYS_STAT_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SYS_TIMEB_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SYS_TIMES_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SYS_TIME_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SYS_TYPES_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_SYS_WAIT_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_TELLDIR : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_TEMPNAM : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_TIFFCONF_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_TIFFISBIGENDIAN : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_TIFFISCODECCONFIGURED : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_TIFFMERGEFIELDINFO : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_TIFFREADEXIFDIRECTORY : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_TIFFSETERRORHANDLEREXT : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_TIFFSETTAGEXTENDER : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_TIFFSETWARNINGHANDLEREXT : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_TIFFSWABARRAYOFTRIPLES : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_TIMES : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_TM_ZONE : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_UINTMAX_T : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_UINTPTR_T : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_UNISTD_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_UNSIGNED_LONG_LONG_INT : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_USELOCALE : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_USLEEP : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_UTIME : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_UTIME_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_VFORK : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_VFPRINTF : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_VPRINTF : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_VSNPRINTF : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_VSPRINTF : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_WAITPID : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_WCHAR_H : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_WORKING_FORK : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE_WORKING_VFORK : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE__BOOL : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE__EXIT : libc :: c_uint = 1 ; pub const MAGICKCORE_HAVE___ATTRIBUTE__ : libc :: c_uint = 1 ; pub const MAGICKCORE_HDRI_ENABLE_OBSOLETE_IN_H : libc :: c_uint = 1 ; pub const MAGICKCORE_INCLUDEARCH_PATH : & 'static [ u8 ; 34usize ] = b"/usr/local/include/ImageMagick-7/\0" ; pub const MAGICKCORE_INCLUDE_PATH : & 'static [ u8 ; 34usize ] = b"/usr/local/include/ImageMagick-7/\0" ; pub const MAGICKCORE_INSTALLED_SUPPORT : libc :: c_uint = 1 ; pub const MAGICKCORE_JBIG_DELEGATE : libc :: c_uint = 1 ; pub const MAGICKCORE_JPEG_DELEGATE : libc :: c_uint = 1 ; pub const MAGICKCORE_LCMS_DELEGATE : libc :: c_uint = 1 ; pub const MAGICKCORE_LIBOPENJP2_DELEGATE : libc :: c_uint = 1 ; pub const MAGICKCORE_LIBRARY_PATH : & 'static [ u8 ; 34usize ] = b"/usr/local/lib/ImageMagick-7.0.9/\0" ; pub const MAGICKCORE_LIBRARY_RELATIVE_PATH : & 'static [ u8 ; 18usize ] = b"ImageMagick-7.0.9\0" ; pub const MAGICKCORE_LIB_BIN_BASEDIRNAME : & 'static [ u8 ; 4usize ] = b"bin\0" ; pub const MAGICKCORE_LQR_DELEGATE : libc :: c_uint = 1 ; pub const MAGICKCORE_LT_OBJDIR : & 'static [ u8 ; 7usize ] = b".libs/\0" ; pub const MAGICKCORE_LZMA_DELEGATE : libc :: c_uint = 1 ; pub const MAGICKCORE_MODULES_BASEDIRNAME : & 'static [ u8 ; 8usize ] = b"modules\0" ; pub const MAGICKCORE_OPENEXR_DELEGATE : libc :: c_uint = 1 ; pub const MAGICKCORE_PACKAGE : & 'static [ u8 ; 12usize ] = b"ImageMagick\0" ; pub const MAGICKCORE_PACKAGE_BUGREPORT : & 'static [ u8 ; 50usize ] = b"https://github.com/ImageMagick/ImageMagick/issues\0" ; pub const MAGICKCORE_PACKAGE_NAME : & 'static [ u8 ; 12usize ] = b"ImageMagick\0" ; pub const MAGICKCORE_PACKAGE_STRING : & 'static [ u8 ; 21usize ] = b"ImageMagick 7.0.9-25\0" ; pub const MAGICKCORE_PACKAGE_TARNAME : & 'static [ u8 ; 12usize ] = b"ImageMagick\0" ; pub const MAGICKCORE_PACKAGE_URL : & 'static [ u8 ; 24usize ] = b"https://imagemagick.org\0" ; pub const MAGICKCORE_PACKAGE_VERSION : & 'static [ u8 ; 9usize ] = b"7.0.9-25\0" ; pub const MAGICKCORE_PNG_DELEGATE : libc :: c_uint = 1 ; pub const MAGICKCORE_QUANTUM_DEPTH_OBSOLETE_IN_H : libc :: c_uint = 16 ; pub const MAGICKCORE_SHAREARCH_BASEDIRNAME : & 'static [ u8 ; 7usize ] = b"config\0" ; pub const MAGICKCORE_SHARE_PATH : & 'static [ u8 ; 32usize ] = b"/usr/local/share/ImageMagick-7/\0" ; pub const MAGICKCORE_SHARE_RELATIVE_PATH : & 'static [ u8 ; 14usize ] = b"ImageMagick-7\0" ; pub const MAGICKCORE_SIZEOF_DOUBLE : libc :: c_uint = 8 ; pub const MAGICKCORE_SIZEOF_DOUBLE_T : libc :: c_uint = 8 ; pub const MAGICKCORE_SIZEOF_FLOAT : libc :: c_uint = 4 ; pub const MAGICKCORE_SIZEOF_FLOAT_T : libc :: c_uint = 4 ; pub const MAGICKCORE_SIZEOF_LONG_DOUBLE : libc :: c_uint = 16 ; pub const MAGICKCORE_SIZEOF_UNSIGNED_LONG_LONG : libc :: c_uint = 8 ; pub const MAGICKCORE_SIZEOF_VOID_P : libc :: c_uint = 8 ; pub const MAGICKCORE_STDC_HEADERS : libc :: c_uint = 1 ; pub const MAGICKCORE_STRERROR_R_CHAR_P : libc :: c_uint = 1 ; pub const MAGICKCORE_THREAD_SUPPORT : libc :: c_uint = 1 ; pub const MAGICKCORE_TIFF_DELEGATE : libc :: c_uint = 1 ; pub const MAGICKCORE_TIME_WITH_SYS_TIME : libc :: c_uint = 1 ; pub const _ALL_SOURCE : libc :: c_uint = 1 ; pub const _GNU_SOURCE : libc :: c_uint = 1 ; pub const _POSIX_PTHREAD_SEMANTICS : libc :: c_uint = 1 ; pub const _TANDEM_SOURCE : libc :: c_uint = 1 ; pub const __EXTENSIONS__ : libc :: c_uint = 1 ; pub const MAGICKCORE_VERSION : & 'static [ u8 ; 9usize ] = b"7.0.9-25\0" ; pub const MAGICKCORE_WEBPMUX_DELEGATE : libc :: c_uint = 1 ; pub const MAGICKCORE_WEBP_DELEGATE : libc :: c_uint = 1 ; pub const MAGICKCORE_WMF_DELEGATE : libc :: c_uint = 1 ; pub const MAGICKCORE_X11_CONFIGURE_PATH : & 'static [ u8 ; 1usize ] = b"\0" ; pub const MAGICKCORE_X11_DELEGATE : libc :: c_uint = 1 ; pub const MAGICKCORE_XML_DELEGATE : libc :: c_uint = 1 ; pub const MAGICKCORE_ZLIB_DELEGATE : libc :: c_uint = 1 ; pub const _DARWIN_USE_64_BIT_INODE : libc :: c_uint = 1 ; pub const MAGICKCORE_QUANTUM_DEPTH : libc :: c_uint = 16 ; pub const MAGICKCORE_HDRI_ENABLE : libc :: c_uint = 1 ; pub const MAGICKCORE_HDRI_SUPPORT : libc :: c_uint = 1 ; pub const MAGICKCORE_DIR_SEPARATOR_CHAR : u8 = 47u8 ; pub const MAGICKCORE_DIR_SEPARATOR : & 'static [ u8 ; 2usize ] = b"/\0" ; pub const MAGICKCORE_PATH_SEPARATOR_CHAR : u8 = 58u8 ; pub const MAGICKCORE_PATH_SEPARATOR : & 'static [ u8 ; 2usize ] = b":\0" ; pub const _STDIO_H : libc :: c_uint = 1 ; pub const _FEATURES_H : libc :: c_uint = 1 ; pub const _ISOC95_SOURCE : libc :: c_uint = 1 ; pub const _ISOC99_SOURCE : libc :: c_uint = 1 ; pub const _ISOC11_SOURCE : libc :: c_uint = 1 ; pub const _POSIX_SOURCE : libc :: c_uint = 1 ; pub const _POSIX_C_SOURCE : libc :: c_uint = 200809 ; pub const _XOPEN_SOURCE : libc :: c_uint = 700 ; pub const _XOPEN_SOURCE_EXTENDED : libc :: c_uint = 1 ; pub const _LARGEFILE64_SOURCE : libc :: c_uint = 1 ; pub const _DEFAULT_SOURCE : libc :: c_uint = 1 ; pub const _ATFILE_SOURCE : libc :: c_uint = 1 ; pub const __USE_ISOC11 : libc :: c_uint = 1 ; pub const __USE_ISOC99 : libc :: c_uint = 1 ; pub const __USE_ISOC95 : libc :: c_uint = 1 ; pub const __USE_POSIX : libc :: c_uint = 1 ; pub const __USE_POSIX2 : libc :: c_uint = 1 ; pub const __USE_POSIX199309 : libc :: c_uint = 1 ; pub const __USE_POSIX199506 : libc :: c_uint = 1 ; pub const __USE_XOPEN2K : libc :: c_uint = 1 ; pub const __USE_XOPEN2K8 : libc :: c_uint = 1 ; pub const __USE_XOPEN : libc :: c_uint = 1 ; pub const __USE_XOPEN_EXTENDED : libc :: c_uint = 1 ; pub const __USE_UNIX98 : libc :: c_uint = 1 ; pub const _LARGEFILE_SOURCE : libc :: c_uint = 1 ; pub const __USE_XOPEN2K8XSI : libc :: c_uint = 1 ; pub const __USE_XOPEN2KXSI : libc :: c_uint = 1 ; pub const __USE_LARGEFILE : libc :: c_uint = 1 ; pub const __USE_LARGEFILE64 : libc :: c_uint = 1 ; pub const __USE_MISC : libc :: c_uint = 1 ; pub const __USE_ATFILE : libc :: c_uint = 1 ; pub const __USE_GNU : libc :: c_uint = 1 ; pub const __USE_FORTIFY_LEVEL : libc :: c_uint = 0 ; pub const __GLIBC_USE_DEPRECATED_GETS : libc :: c_uint = 0 ; pub const _STDC_PREDEF_H : libc :: c_uint = 1 ; pub const __STDC_IEC_559__ : libc :: c_uint = 1 ; pub const __STDC_IEC_559_COMPLEX__ : libc :: c_uint = 1 ; pub const __STDC_ISO_10646__ : libc :: c_uint = 201706 ; pub const __GNU_LIBRARY__ : libc :: c_uint = 6 ; pub const __GLIBC__ : libc :: c_uint = 2 ; pub const __GLIBC_MINOR__ : libc :: c_uint = 28 ; pub const _SYS_CDEFS_H : libc :: c_uint = 1 ; pub const __glibc_c99_flexarr_available : libc :: c_uint = 1 ; pub const __WORDSIZE : libc :: c_uint = 64 ; pub const __WORDSIZE_TIME64_COMPAT32 : libc :: c_uint = 1 ; pub const __SYSCALL_WORDSIZE : libc :: c_uint = 64 ; pub const __HAVE_GENERIC_SELECTION : libc :: c_uint = 1 ; pub const __GLIBC_USE_LIB_EXT2 : libc :: c_uint = 1 ; pub const __GLIBC_USE_IEC_60559_BFP_EXT : libc :: c_uint = 1 ; pub const __GLIBC_USE_IEC_60559_FUNCS_EXT : libc :: c_uint = 1 ; pub const __GLIBC_USE_IEC_60559_TYPES_EXT : libc :: c_uint = 1 ; pub const __GNUC_VA_LIST : libc :: c_uint = 1 ; pub const _BITS_TYPES_H : libc :: c_uint = 1 ; pub const _BITS_TYPESIZES_H : libc :: c_uint = 1 ; pub const __OFF_T_MATCHES_OFF64_T : libc :: c_uint = 1 ; pub const __INO_T_MATCHES_INO64_T : libc :: c_uint = 1 ; pub const __RLIM_T_MATCHES_RLIM64_T : libc :: c_uint = 1 ; pub const __FD_SETSIZE : libc :: c_uint = 1024 ; pub const _____fpos_t_defined : libc :: c_uint = 1 ; pub const ____mbstate_t_defined : libc :: c_uint = 1 ; pub const _____fpos64_t_defined : libc :: c_uint = 1 ; pub const ____FILE_defined : libc :: c_uint = 1 ; pub const __FILE_defined : libc :: c_uint = 1 ; pub const __struct_FILE_defined : libc :: c_uint = 1 ; pub const _IO_EOF_SEEN : libc :: c_uint = 16 ; pub const _IO_ERR_SEEN : libc :: c_uint = 32 ; pub const _IO_USER_LOCK : libc :: c_uint = 32768 ; pub const __cookie_io_functions_t_defined : libc :: c_uint = 1 ; pub const _IOFBF : libc :: c_uint = 0 ; pub const _IOLBF : libc :: c_uint = 1 ; pub const _IONBF : libc :: c_uint = 2 ; pub const BUFSIZ : libc :: c_uint = 8192 ; pub const EOF : libc :: c_int = -1 ; pub const SEEK_SET : libc :: c_uint = 0 ; pub const SEEK_CUR : libc :: c_uint = 1 ; pub const SEEK_END : libc :: c_uint = 2 ; pub const SEEK_DATA : libc :: c_uint = 3 ; pub const SEEK_HOLE : libc :: c_uint = 4 ; pub const P_tmpdir : & 'static [ u8 ; 5usize ] = b"/tmp\0" ; pub const _BITS_STDIO_LIM_H : libc :: c_uint = 1 ; pub const L_tmpnam : libc :: c_uint = 20 ; pub const TMP_MAX : libc :: c_uint = 238328 ; pub const FILENAME_MAX : libc :: c_uint = 4096 ; pub const L_ctermid : libc :: c_uint = 9 ; pub const L_cuserid : libc :: c_uint = 9 ; pub const FOPEN_MAX : libc :: c_uint = 16 ; pub const RENAME_NOREPLACE : libc :: c_uint = 1 ; pub const RENAME_EXCHANGE : libc :: c_uint = 2 ; pub const RENAME_WHITEOUT : libc :: c_uint = 4 ; pub const _STDLIB_H : libc :: c_uint = 1 ; pub const WNOHANG : libc :: c_uint = 1 ; pub const WUNTRACED : libc :: c_uint = 2 ; pub const WSTOPPED : libc :: c_uint = 2 ; pub const WEXITED : libc :: c_uint = 4 ; pub const WCONTINUED : libc :: c_uint = 8 ; pub const WNOWAIT : libc :: c_uint = 16777216 ; pub const __WNOTHREAD : libc :: c_uint = 536870912 ; pub const __WALL : libc :: c_uint = 1073741824 ; pub const __WCLONE : libc :: c_uint = 2147483648 ; pub const __ENUM_IDTYPE_T : libc :: c_uint = 1 ; pub const __W_CONTINUED : libc :: c_uint = 65535 ; pub const __WCOREFLAG : libc :: c_uint = 128 ; pub const __HAVE_FLOAT128 : libc :: c_uint = 0 ; pub const __HAVE_DISTINCT_FLOAT128 : libc :: c_uint = 0 ; pub const __HAVE_FLOAT64X : libc :: c_uint = 1 ; pub const __HAVE_FLOAT64X_LONG_DOUBLE : libc :: c_uint = 1 ; pub const __HAVE_FLOAT16 : libc :: c_uint = 0 ; pub const __HAVE_FLOAT32 : libc :: c_uint = 1 ; pub const __HAVE_FLOAT64 : libc :: c_uint = 1 ; pub const __HAVE_FLOAT32X : libc :: c_uint = 1 ; pub const __HAVE_FLOAT128X : libc :: c_uint = 0 ; pub const __HAVE_DISTINCT_FLOAT16 : libc :: c_uint = 0 ; pub const __HAVE_DISTINCT_FLOAT32 : libc :: c_uint = 0 ; pub const __HAVE_DISTINCT_FLOAT64 : libc :: c_uint = 0 ; pub const __HAVE_DISTINCT_FLOAT32X : libc :: c_uint = 0 ; pub const __HAVE_DISTINCT_FLOAT64X : libc :: c_uint = 0 ; pub const __HAVE_DISTINCT_FLOAT128X : libc :: c_uint = 0 ; pub const __HAVE_FLOATN_NOT_TYPEDEF : libc :: c_uint = 0 ; pub const __ldiv_t_defined : libc :: c_uint = 1 ; pub const __lldiv_t_defined : libc :: c_uint = 1 ; pub const RAND_MAX : libc :: c_uint = 2147483647 ; pub const EXIT_FAILURE : libc :: c_uint = 1 ; pub const EXIT_SUCCESS : libc :: c_uint = 0 ; pub const _BITS_TYPES_LOCALE_T_H : libc :: c_uint = 1 ; pub const _BITS_TYPES___LOCALE_T_H : libc :: c_uint = 1 ; pub const _SYS_TYPES_H : libc :: c_uint = 1 ; pub const __clock_t_defined : libc :: c_uint = 1 ; pub const __clockid_t_defined : libc :: c_uint = 1 ; pub const __time_t_defined : libc :: c_uint = 1 ; pub const __timer_t_defined : libc :: c_uint = 1 ; pub const _BITS_STDINT_INTN_H : libc :: c_uint = 1 ; pub const __BIT_TYPES_DEFINED__ : libc :: c_uint = 1 ; pub const _ENDIAN_H : libc :: c_uint = 1 ; pub const __LITTLE_ENDIAN : libc :: c_uint = 1234 ; pub const __BIG_ENDIAN : libc :: c_uint = 4321 ; pub const __PDP_ENDIAN : libc :: c_uint = 3412 ; pub const __BYTE_ORDER : libc :: c_uint = 1234 ; pub const __FLOAT_WORD_ORDER : libc :: c_uint = 1234 ; pub const LITTLE_ENDIAN : libc :: c_uint = 1234 ; pub const BIG_ENDIAN : libc :: c_uint = 4321 ; pub const PDP_ENDIAN : libc :: c_uint = 3412 ; pub const BYTE_ORDER : libc :: c_uint = 1234 ; pub const _BITS_BYTESWAP_H : libc :: c_uint = 1 ; pub const _BITS_UINTN_IDENTITY_H : libc :: c_uint = 1 ; pub const _SYS_SELECT_H : libc :: c_uint = 1 ; pub const __FD_ZERO_STOS : & 'static [ u8 ; 6usize ] = b"stosq\0" ; pub const __sigset_t_defined : libc :: c_uint = 1 ; pub const __timeval_defined : libc :: c_uint = 1 ; pub const _STRUCT_TIMESPEC : libc :: c_uint = 1 ; pub const FD_SETSIZE : libc :: c_uint = 1024 ; pub const _BITS_PTHREADTYPES_COMMON_H : libc :: c_uint = 1 ; pub const _THREAD_SHARED_TYPES_H : libc :: c_uint = 1 ; pub const _BITS_PTHREADTYPES_ARCH_H : libc :: c_uint = 1 ; pub const __SIZEOF_PTHREAD_MUTEX_T : libc :: c_uint = 40 ; pub const __SIZEOF_PTHREAD_ATTR_T : libc :: c_uint = 56 ; pub const __SIZEOF_PTHREAD_RWLOCK_T : libc :: c_uint = 56 ; pub const __SIZEOF_PTHREAD_BARRIER_T : libc :: c_uint = 32 ; pub const __SIZEOF_PTHREAD_MUTEXATTR_T : libc :: c_uint = 4 ; pub const __SIZEOF_PTHREAD_COND_T : libc :: c_uint = 48 ; pub const __SIZEOF_PTHREAD_CONDATTR_T : libc :: c_uint = 4 ; pub const __SIZEOF_PTHREAD_RWLOCKATTR_T : libc :: c_uint = 8 ; pub const __SIZEOF_PTHREAD_BARRIERATTR_T : libc :: c_uint = 4 ; pub const __PTHREAD_MUTEX_LOCK_ELISION : libc :: c_uint = 1 ; pub const __PTHREAD_MUTEX_NUSERS_AFTER_KIND : libc :: c_uint = 0 ; pub const __PTHREAD_MUTEX_USE_UNION : libc :: c_uint = 0 ; pub const __PTHREAD_RWLOCK_INT_FLAGS_SHARED : libc :: c_uint = 1 ; pub const __PTHREAD_MUTEX_HAVE_PREV : libc :: c_uint = 1 ; pub const __have_pthread_attr_t : libc :: c_uint = 1 ; pub const _ALLOCA_H : libc :: c_uint = 1 ; pub const _STDINT_H : libc :: c_uint = 1 ; pub const _BITS_WCHAR_H : libc :: c_uint = 1 ; pub const __WCHAR_MAX : libc :: c_uint = 2147483647 ; pub const __WCHAR_MIN : libc :: c_int = -2147483648 ; pub const _BITS_STDINT_UINTN_H : libc :: c_uint = 1 ; pub const INT8_MIN : libc :: c_int = -128 ; pub const INT16_MIN : libc :: c_int = -32768 ; pub const INT32_MIN : libc :: c_int = -2147483648 ; pub const INT8_MAX : libc :: c_uint = 127 ; pub const INT16_MAX : libc :: c_uint = 32767 ; pub const INT32_MAX : libc :: c_uint = 2147483647 ; pub const UINT8_MAX : libc :: c_uint = 255 ; pub const UINT16_MAX : libc :: c_uint = 65535 ; pub const UINT32_MAX : libc :: c_uint = 4294967295 ; pub const INT_LEAST8_MIN : libc :: c_int = -128 ; pub const INT_LEAST16_MIN : libc :: c_int = -32768 ; pub const INT_LEAST32_MIN : libc :: c_int = -2147483648 ; pub const INT_LEAST8_MAX : libc :: c_uint = 127 ; pub const INT_LEAST16_MAX : libc :: c_uint = 32767 ; pub const INT_LEAST32_MAX : libc :: c_uint = 2147483647 ; pub const UINT_LEAST8_MAX : libc :: c_uint = 255 ; pub const UINT_LEAST16_MAX : libc :: c_uint = 65535 ; pub const UINT_LEAST32_MAX : libc :: c_uint = 4294967295 ; pub const INT_FAST8_MIN : libc :: c_int = -128 ; pub const INT_FAST16_MIN : libc :: c_longlong = -9223372036854775808 ; pub const INT_FAST32_MIN : libc :: c_longlong = -9223372036854775808 ; pub const INT_FAST8_MAX : libc :: c_uint = 127 ; pub const INT_FAST16_MAX : libc :: c_ulonglong = 9223372036854775807 ; pub const INT_FAST32_MAX : libc :: c_ulonglong = 9223372036854775807 ; pub const UINT_FAST8_MAX : libc :: c_uint = 255 ; pub const UINT_FAST16_MAX : libc :: c_int = -1 ; pub const UINT_FAST32_MAX : libc :: c_int = -1 ; pub const INTPTR_MIN : libc :: c_longlong = -9223372036854775808 ; pub const INTPTR_MAX : libc :: c_ulonglong = 9223372036854775807 ; pub const UINTPTR_MAX : libc :: c_int = -1 ; pub const PTRDIFF_MIN : libc :: c_longlong = -9223372036854775808 ; pub const PTRDIFF_MAX : libc :: c_ulonglong = 9223372036854775807 ; pub const SIG_ATOMIC_MIN : libc :: c_int = -2147483648 ; pub const SIG_ATOMIC_MAX : libc :: c_uint = 2147483647 ; pub const SIZE_MAX : libc :: c_int = -1 ; pub const WCHAR_MIN : libc :: c_int = -2147483648 ; pub const WCHAR_MAX : libc :: c_uint = 2147483647 ; pub const WINT_MIN : libc :: c_uint = 0 ; pub const WINT_MAX : libc :: c_uint = 4294967295 ; pub const INT8_WIDTH : libc :: c_uint = 8 ; pub const UINT8_WIDTH : libc :: c_uint = 8 ; pub const INT16_WIDTH : libc :: c_uint = 16 ; pub const UINT16_WIDTH : libc :: c_uint = 16 ; pub const INT32_WIDTH : libc :: c_uint = 32 ; pub const UINT32_WIDTH : libc :: c_uint = 32 ; pub const INT64_WIDTH : libc :: c_uint = 64 ; pub const UINT64_WIDTH : libc :: c_uint = 64 ; pub const INT_LEAST8_WIDTH : libc :: c_uint = 8 ; pub const UINT_LEAST8_WIDTH : libc :: c_uint = 8 ; pub const INT_LEAST16_WIDTH : libc :: c_uint = 16 ; pub const UINT_LEAST16_WIDTH : libc :: c_uint = 16 ; pub const INT_LEAST32_WIDTH : libc :: c_uint = 32 ; pub const UINT_LEAST32_WIDTH : libc :: c_uint = 32 ; pub const INT_LEAST64_WIDTH : libc :: c_uint = 64 ; pub const UINT_LEAST64_WIDTH : libc :: c_uint = 64 ; pub const INT_FAST8_WIDTH : libc :: c_uint = 8 ; pub const UINT_FAST8_WIDTH : libc :: c_uint = 8 ; pub const INT_FAST16_WIDTH : libc :: c_uint = 64 ; pub const UINT_FAST16_WIDTH : libc :: c_uint = 64 ; pub const INT_FAST32_WIDTH : libc :: c_uint = 64 ; pub const UINT_FAST32_WIDTH : libc :: c_uint = 64 ; pub const INT_FAST64_WIDTH : libc :: c_uint = 64 ; pub const UINT_FAST64_WIDTH : libc :: c_uint = 64 ; pub const INTPTR_WIDTH : libc :: c_uint = 64 ; pub const UINTPTR_WIDTH : libc :: c_uint = 64 ; pub const INTMAX_WIDTH : libc :: c_uint = 64 ; pub const UINTMAX_WIDTH : libc :: c_uint = 64 ; pub const PTRDIFF_WIDTH : libc :: c_uint = 64 ; pub const SIG_ATOMIC_WIDTH : libc :: c_uint = 32 ; pub const SIZE_WIDTH : libc :: c_uint = 64 ; pub const WCHAR_WIDTH : libc :: c_uint = 32 ; pub const WINT_WIDTH : libc :: c_uint = 32 ; pub const _MATH_H : libc :: c_uint = 1 ; pub const _BITS_LIBM_SIMD_DECL_STUBS_H : libc :: c_uint = 1 ; pub const __GLIBC_FLT_EVAL_METHOD : libc :: c_uint = 0 ; pub const __FP_LOGB0_IS_MIN : libc :: c_uint = 1 ; pub const __FP_LOGBNAN_IS_MIN : libc :: c_uint = 1 ; pub const FP_ILOGB0 : libc :: c_int = -2147483648 ; pub const FP_ILOGBNAN : libc :: c_int = -2147483648 ; pub const __FP_LONG_MAX : libc :: c_ulonglong = 9223372036854775807 ; pub const FP_LLOGB0 : libc :: c_longlong = -9223372036854775808 ; pub const FP_LLOGBNAN : libc :: c_longlong = -9223372036854775808 ; pub const __MATH_DECLARING_DOUBLE : libc :: c_uint = 1 ; pub const __MATH_DECLARING_FLOATN : libc :: c_uint = 0 ; pub const __MATH_DECLARE_LDOUBLE : libc :: c_uint = 1 ; pub const MATH_ERRNO : libc :: c_uint = 1 ; pub const MATH_ERREXCEPT : libc :: c_uint = 2 ; pub const math_errhandling : libc :: c_uint = 3 ; pub const M_E : f64 = 2.718281828459045 ; pub const M_LOG2E : f64 = 1.4426950408889634 ; pub const M_LOG10E : f64 = 0.4342944819032518 ; pub const M_LN2 : f64 = 0.6931471805599453 ; pub const M_LN10 : f64 = 2.302585092994046 ; pub const M_PI : f64 = 3.141592653589793 ; pub const M_PI_2 : f64 = 1.5707963267948966 ; pub const M_PI_4 : f64 = 0.7853981633974483 ; pub const M_1_PI : f64 = 0.3183098861837907 ; pub const M_2_PI : f64 = 0.6366197723675814 ; pub const M_2_SQRTPI : f64 = 1.1283791670955126 ; pub const M_SQRT2 : f64 = 1.4142135623730951 ; pub const M_SQRT1_2 : f64 = 0.7071067811865476 ; pub const M_El : f64 = 2.718281828459045 ; pub const M_LOG2El : f64 = 1.4426950408889634 ; pub const M_LOG10El : f64 = 0.4342944819032518 ; pub const M_LN2l : f64 = 0.6931471805599453 ; pub const M_LN10l : f64 = 2.302585092994046 ; pub const M_PIl : f64 = 3.141592653589793 ; pub const M_PI_2l : f64 = 1.5707963267948966 ; pub const M_PI_4l : f64 = 0.7853981633974483 ; pub const M_1_PIl : f64 = 0.3183098861837907 ; pub const M_2_PIl : f64 = 0.6366197723675814 ; pub const M_2_SQRTPIl : f64 = 1.1283791670955126 ; pub const M_SQRT2l : f64 = 1.4142135623730951 ; pub const M_SQRT1_2l : f64 = 0.7071067811865476 ; pub const _TIME_H : libc :: c_uint = 1 ; pub const _BITS_TIME_H : libc :: c_uint = 1 ; pub const CLOCK_REALTIME : libc :: c_uint = 0 ; pub const CLOCK_MONOTONIC : libc :: c_uint = 1 ; pub const CLOCK_PROCESS_CPUTIME_ID : libc :: c_uint = 2 ; pub const CLOCK_THREAD_CPUTIME_ID : libc :: c_uint = 3 ; pub const CLOCK_MONOTONIC_RAW : libc :: c_uint = 4 ; pub const CLOCK_REALTIME_COARSE : libc :: c_uint = 5 ; pub const CLOCK_MONOTONIC_COARSE : libc :: c_uint = 6 ; pub const CLOCK_BOOTTIME : libc :: c_uint = 7 ; pub const CLOCK_REALTIME_ALARM : libc :: c_uint = 8 ; pub const CLOCK_BOOTTIME_ALARM : libc :: c_uint = 9 ; pub const CLOCK_TAI : libc :: c_uint = 11 ; pub const TIMER_ABSTIME : libc :: c_uint = 1 ; pub const _BITS_TIMEX_H : libc :: c_uint = 1 ; pub const ADJ_OFFSET : libc :: c_uint = 1 ; pub const ADJ_FREQUENCY : libc :: c_uint = 2 ; pub const ADJ_MAXERROR : libc :: c_uint = 4 ; pub const ADJ_ESTERROR : libc :: c_uint = 8 ; pub const ADJ_STATUS : libc :: c_uint = 16 ; pub const ADJ_TIMECONST : libc :: c_uint = 32 ; pub const ADJ_TAI : libc :: c_uint = 128 ; pub const ADJ_SETOFFSET : libc :: c_uint = 256 ; pub const ADJ_MICRO : libc :: c_uint = 4096 ; pub const ADJ_NANO : libc :: c_uint = 8192 ; pub const ADJ_TICK : libc :: c_uint = 16384 ; pub const ADJ_OFFSET_SINGLESHOT : libc :: c_uint = 32769 ; pub const ADJ_OFFSET_SS_READ : libc :: c_uint = 40961 ; pub const MOD_OFFSET : libc :: c_uint = 1 ; pub const MOD_FREQUENCY : libc :: c_uint = 2 ; pub const MOD_MAXERROR : libc :: c_uint = 4 ; pub const MOD_ESTERROR : libc :: c_uint = 8 ; pub const MOD_STATUS : libc :: c_uint = 16 ; pub const MOD_TIMECONST : libc :: c_uint = 32 ; pub const MOD_CLKB : libc :: c_uint = 16384 ; pub const MOD_CLKA : libc :: c_uint = 32769 ; pub const MOD_TAI : libc :: c_uint = 128 ; pub const MOD_MICRO : libc :: c_uint = 4096 ; pub const MOD_NANO : libc :: c_uint = 8192 ; pub const STA_PLL : libc :: c_uint = 1 ; pub const STA_PPSFREQ : libc :: c_uint = 2 ; pub const STA_PPSTIME : libc :: c_uint = 4 ; pub const STA_FLL : libc :: c_uint = 8 ; pub const STA_INS : libc :: c_uint = 16 ; pub const STA_DEL : libc :: c_uint = 32 ; pub const STA_UNSYNC : libc :: c_uint = 64 ; pub const STA_FREQHOLD : libc :: c_uint = 128 ; pub const STA_PPSSIGNAL : libc :: c_uint = 256 ; pub const STA_PPSJITTER : libc :: c_uint = 512 ; pub const STA_PPSWANDER : libc :: c_uint = 1024 ; pub const STA_PPSERROR : libc :: c_uint = 2048 ; pub const STA_CLOCKERR : libc :: c_uint = 4096 ; pub const STA_NANO : libc :: c_uint = 8192 ; pub const STA_MODE : libc :: c_uint = 16384 ; pub const STA_CLK : libc :: c_uint = 32768 ; pub const STA_RONLY : libc :: c_uint = 65280 ; pub const __struct_tm_defined : libc :: c_uint = 1 ; pub const __itimerspec_defined : libc :: c_uint = 1 ; pub const TIME_UTC : libc :: c_uint = 1 ; pub const MagickWandSignature : libc :: c_uint = 2880220587 ; pub const MagickPathExtent : libc :: c_uint = 4096 ; pub const MagickCoreSignature : libc :: c_uint = 2880220587 ; pub const MaxTextExtent : libc :: c_uint = 4096 ; pub const MaxColormapSize : libc :: c_uint = 65536 ; pub const MaxMap : libc :: c_uint = 65535 ; pub const QuantumRange : f64 = 65535. ; pub const QuantumFormat : & 'static [ u8 ; 3usize ] = b"%g\0" ; pub const MagickOffsetFormat : & 'static [ u8 ; 4usize ] = b"lld\0" ; pub const MagickSizeFormat : & 'static [ u8 ; 4usize ] = b"llu\0" ; pub const MagickMaxBufferExtent : libc :: c_uint = 81920 ; pub const MagickMinBufferExtent : libc :: c_uint = 16384 ; pub const MaxPixelChannels : libc :: c_uint = 32 ; pub const FLT_EVAL_METHOD : libc :: c_uint = 0 ; pub const FLT_RADIX : libc :: c_uint = 2 ; pub const FLT_MANT_DIG : libc :: c_uint = 24 ; pub const DBL_MANT_DIG : libc :: c_uint = 53 ; pub const LDBL_MANT_DIG : libc :: c_uint = 64 ; pub const DECIMAL_DIG : libc :: c_uint = 21 ; pub const FLT_DIG : libc :: c_uint = 6 ; pub const DBL_DIG : libc :: c_uint = 15 ; pub const LDBL_DIG : libc :: c_uint = 18 ; pub const FLT_MIN_EXP : libc :: c_int = -125 ; pub const DBL_MIN_EXP : libc :: c_int = -1021 ; pub const LDBL_MIN_EXP : libc :: c_int = -16381 ; pub const FLT_MIN_10_EXP : libc :: c_int = -37 ; pub const DBL_MIN_10_EXP : libc :: c_int = -307 ; pub const LDBL_MIN_10_EXP : libc :: c_int = -4931 ; pub const FLT_MAX_EXP : libc :: c_uint = 128 ; pub const DBL_MAX_EXP : libc :: c_uint = 1024 ; pub const LDBL_MAX_EXP : libc :: c_uint = 16384 ; pub const FLT_MAX_10_EXP : libc :: c_uint = 38 ; pub const DBL_MAX_10_EXP : libc :: c_uint = 308 ; pub const LDBL_MAX_10_EXP : libc :: c_uint = 4932 ; pub const FLT_DECIMAL_DIG : libc :: c_uint = 9 ; pub const DBL_DECIMAL_DIG : libc :: c_uint = 17 ; pub const LDBL_DECIMAL_DIG : libc :: c_uint = 21 ; pub const MagickLogFilename : & 'static [ u8 ; 8usize ] = b"log.xml\0" ; pub const _ERRNO_H : libc :: c_uint = 1 ; pub const _BITS_ERRNO_H : libc :: c_uint = 1 ; pub const EPERM : libc :: c_uint = 1 ; pub const ENOENT : libc :: c_uint = 2 ; pub const ESRCH : libc :: c_uint = 3 ; pub const EINTR : libc :: c_uint = 4 ; pub const EIO : libc :: c_uint = 5 ; pub const ENXIO : libc :: c_uint = 6 ; pub const E2BIG : libc :: c_uint = 7 ; pub const ENOEXEC : libc :: c_uint = 8 ; pub const EBADF : libc :: c_uint = 9 ; pub const ECHILD : libc :: c_uint = 10 ; pub const EAGAIN : libc :: c_uint = 11 ; pub const ENOMEM : libc :: c_uint = 12 ; pub const EACCES : libc :: c_uint = 13 ; pub const EFAULT : libc :: c_uint = 14 ; pub const ENOTBLK : libc :: c_uint = 15 ; pub const EBUSY : libc :: c_uint = 16 ; pub const EEXIST : libc :: c_uint = 17 ; pub const EXDEV : libc :: c_uint = 18 ; pub const ENODEV : libc :: c_uint = 19 ; pub const ENOTDIR : libc :: c_uint = 20 ; pub const EISDIR : libc :: c_uint = 21 ; pub const EINVAL : libc :: c_uint = 22 ; pub const ENFILE : libc :: c_uint = 23 ; pub const EMFILE : libc :: c_uint = 24 ; pub const ENOTTY : libc :: c_uint = 25 ; pub const ETXTBSY : libc :: c_uint = 26 ; pub const EFBIG : libc :: c_uint = 27 ; pub const ENOSPC : libc :: c_uint = 28 ; pub const ESPIPE : libc :: c_uint = 29 ; pub const EROFS : libc :: c_uint = 30 ; pub const EMLINK : libc :: c_uint = 31 ; pub const EPIPE : libc :: c_uint = 32 ; pub const EDOM : libc :: c_uint = 33 ; pub const ERANGE : libc :: c_uint = 34 ; pub const EDEADLK : libc :: c_uint = 35 ; pub const ENAMETOOLONG : libc :: c_uint = 36 ; pub const ENOLCK : libc :: c_uint = 37 ; pub const ENOSYS : libc :: c_uint = 38 ; pub const ENOTEMPTY : libc :: c_uint = 39 ; pub const ELOOP : libc :: c_uint = 40 ; pub const EWOULDBLOCK : libc :: c_uint = 11 ; pub const ENOMSG : libc :: c_uint = 42 ; pub const EIDRM : libc :: c_uint = 43 ; pub const ECHRNG : libc :: c_uint = 44 ; pub const EL2NSYNC : libc :: c_uint = 45 ; pub const EL3HLT : libc :: c_uint = 46 ; pub const EL3RST : libc :: c_uint = 47 ; pub const ELNRNG : libc :: c_uint = 48 ; pub const EUNATCH : libc :: c_uint = 49 ; pub const ENOCSI : libc :: c_uint = 50 ; pub const EL2HLT : libc :: c_uint = 51 ; pub const EBADE : libc :: c_uint = 52 ; pub const EBADR : libc :: c_uint = 53 ; pub const EXFULL : libc :: c_uint = 54 ; pub const ENOANO : libc :: c_uint = 55 ; pub const EBADRQC : libc :: c_uint = 56 ; pub const EBADSLT : libc :: c_uint = 57 ; pub const EDEADLOCK : libc :: c_uint = 35 ; pub const EBFONT : libc :: c_uint = 59 ; pub const ENOSTR : libc :: c_uint = 60 ; pub const ENODATA : libc :: c_uint = 61 ; pub const ETIME : libc :: c_uint = 62 ; pub const ENOSR : libc :: c_uint = 63 ; pub const ENONET : libc :: c_uint = 64 ; pub const ENOPKG : libc :: c_uint = 65 ; pub const EREMOTE : libc :: c_uint = 66 ; pub const ENOLINK : libc :: c_uint = 67 ; pub const EADV : libc :: c_uint = 68 ; pub const ESRMNT : libc :: c_uint = 69 ; pub const ECOMM : libc :: c_uint = 70 ; pub const EPROTO : libc :: c_uint = 71 ; pub const EMULTIHOP : libc :: c_uint = 72 ; pub const EDOTDOT : libc :: c_uint = 73 ; pub const EBADMSG : libc :: c_uint = 74 ; pub const EOVERFLOW : libc :: c_uint = 75 ; pub const ENOTUNIQ : libc :: c_uint = 76 ; pub const EBADFD : libc :: c_uint = 77 ; pub const EREMCHG : libc :: c_uint = 78 ; pub const ELIBACC : libc :: c_uint = 79 ; pub const ELIBBAD : libc :: c_uint = 80 ; pub const ELIBSCN : libc :: c_uint = 81 ; pub const ELIBMAX : libc :: c_uint = 82 ; pub const ELIBEXEC : libc :: c_uint = 83 ; pub const EILSEQ : libc :: c_uint = 84 ; pub const ERESTART : libc :: c_uint = 85 ; pub const ESTRPIPE : libc :: c_uint = 86 ; pub const EUSERS : libc :: c_uint = 87 ; pub const ENOTSOCK : libc :: c_uint = 88 ; pub const EDESTADDRREQ : libc :: c_uint = 89 ; pub const EMSGSIZE : libc :: c_uint = 90 ; pub const EPROTOTYPE : libc :: c_uint = 91 ; pub const ENOPROTOOPT : libc :: c_uint = 92 ; pub const EPROTONOSUPPORT : libc :: c_uint = 93 ; pub const ESOCKTNOSUPPORT : libc :: c_uint = 94 ; pub const EOPNOTSUPP : libc :: c_uint = 95 ; pub const EPFNOSUPPORT : libc :: c_uint = 96 ; pub const EAFNOSUPPORT : libc :: c_uint = 97 ; pub const EADDRINUSE : libc :: c_uint = 98 ; pub const EADDRNOTAVAIL : libc :: c_uint = 99 ; pub const ENETDOWN : libc :: c_uint = 100 ; pub const ENETUNREACH : libc :: c_uint = 101 ; pub const ENETRESET : libc :: c_uint = 102 ; pub const ECONNABORTED : libc :: c_uint = 103 ; pub const ECONNRESET : libc :: c_uint = 104 ; pub const ENOBUFS : libc :: c_uint = 105 ; pub const EISCONN : libc :: c_uint = 106 ; pub const ENOTCONN : libc :: c_uint = 107 ; pub const ESHUTDOWN : libc :: c_uint = 108 ; pub const ETOOMANYREFS : libc :: c_uint = 109 ; pub const ETIMEDOUT : libc :: c_uint = 110 ; pub const ECONNREFUSED : libc :: c_uint = 111 ; pub const EHOSTDOWN : libc :: c_uint = 112 ; pub const EHOSTUNREACH : libc :: c_uint = 113 ; pub const EALREADY : libc :: c_uint = 114 ; pub const EINPROGRESS : libc :: c_uint = 115 ; pub const ESTALE : libc :: c_uint = 116 ; pub const EUCLEAN : libc :: c_uint = 117 ; pub const ENOTNAM : libc :: c_uint = 118 ; pub const ENAVAIL : libc :: c_uint = 119 ; pub const EISNAM : libc :: c_uint = 120 ; pub const EREMOTEIO : libc :: c_uint = 121 ; pub const EDQUOT : libc :: c_uint = 122 ; pub const ENOMEDIUM : libc :: c_uint = 123 ; pub const EMEDIUMTYPE : libc :: c_uint = 124 ; pub const ECANCELED : libc :: c_uint = 125 ; pub const ENOKEY : libc :: c_uint = 126 ; pub const EKEYEXPIRED : libc :: c_uint = 127 ; pub const EKEYREVOKED : libc :: c_uint = 128 ; pub const EKEYREJECTED : libc :: c_uint = 129 ; pub const EOWNERDEAD : libc :: c_uint = 130 ; pub const ENOTRECOVERABLE : libc :: c_uint = 131 ; pub const ERFKILL : libc :: c_uint = 132 ; pub const EHWPOISON : libc :: c_uint = 133 ; pub const ENOTSUP : libc :: c_uint = 95 ; pub const __error_t_defined : libc :: c_uint = 1 ; pub const _ASSERT_H : libc :: c_uint = 1 ; pub const MagickPackageName : & 'static [ u8 ; 12usize ] = b"ImageMagick\0" ; pub const MagickCopyright : & 'static [ u8 ; 36usize ] = b"\xC2\xA9 1999-2020 ImageMagick Studio LLC\0" ; pub const MagickLibVersion : libc :: c_uint = 1801 ; pub const MagickLibVersionText : & 'static [ u8 ; 6usize ] = b"7.0.9\0" ; pub const MagickLibAddendum : & 'static [ u8 ; 4usize ] = b"-25\0" ; pub const MagickLibInterface : libc :: c_uint = 7 ; pub const MagickLibMinInterface : libc :: c_uint = 7 ; pub const MagickPlatform : & 'static [ u8 ; 7usize ] = b"x86_64\0" ; pub const MagickppLibVersionText : & 'static [ u8 ; 6usize ] = b"7.0.9\0" ; pub const MagickppLibAddendum : & 'static [ u8 ; 4usize ] = b"-25\0" ; pub const MagickppLibInterface : libc :: c_uint = 4 ; pub const MagickppLibMinInterface : libc :: c_uint = 4 ; pub const MagickReleaseDate : & 'static [ u8 ; 11usize ] = b"2020-02-23\0" ; pub const MagickAuthoritativeLicense : & 'static [ u8 ; 43usize ] = b"https://imagemagick.org/script/license.php\0" ; pub const MagickAuthoritativeURL : & 'static [ u8 ; 24usize ] = b"https://imagemagick.org\0" ; pub const MagickHomeURL : & 'static [ u8 ; 53usize ] = b"file:///usr/local/share/doc/ImageMagick-7/index.html\0" ; pub const MagickQuantumDepth : & 'static [ u8 ; 4usize ] = b"Q16\0" ; pub const MagickQuantumRange : & 'static [ u8 ; 6usize ] = b"65535\0" ; pub const MagickVersion : & 'static [ u8 ; 67usize ] = b"ImageMagick 7.0.9-25 Q16 x86_64 2020-02-23 https://imagemagick.org\0" ; pub const MaximumNumberOfImageMoments : libc :: c_uint = 8 ; pub const MaximumNumberOfPerceptualColorspaces : libc :: c_uint = 6 ; pub const MaximumNumberOfPerceptualHashes : libc :: c_uint = 7 ; pub const CCMaxMetrics : libc :: c_uint = 16 ; pub type va_list = __builtin_va_list ; pub type __gnuc_va_list = __builtin_va_list ; pub type __u_char = libc :: c_uchar ; pub type __u_short = libc :: c_ushort ; pub type __u_int = libc :: c_uint ; pub type __u_long = libc :: c_ulong ; pub type __int8_t = libc :: c_schar ; pub type __uint8_t = libc :: c_uchar ; pub type __int16_t = libc :: c_short ; pub type __uint16_t = libc :: c_ushort ; pub type __int32_t = libc :: c_int ; pub type __uint32_t = libc :: c_uint ; pub type __int64_t = libc :: c_long ; pub type __uint64_t = libc :: c_ulong ; pub type __int_least8_t = __int8_t ; pub type __uint_least8_t = __uint8_t ; pub type __int_least16_t = __int16_t ; pub type __uint_least16_t = __uint16_t ; pub type __int_least32_t = __int32_t ; pub type __uint_least32_t = __uint32_t ; pub type __int_least64_t = __int64_t ; pub type __uint_least64_t = __uint64_t ; pub type __quad_t = libc :: c_long ; pub type __u_quad_t = libc :: c_ulong ; pub type __intmax_t = libc :: c_long ; pub type __uintmax_t = libc :: c_ulong ; pub type __dev_t = libc :: c_ulong ; pub type __uid_t = libc :: c_uint ; pub type __gid_t = libc :: c_uint ; pub type __ino_t = libc :: c_ulong ; pub type __ino64_t = libc :: c_ulong ; pub type __mode_t = libc :: c_uint ; pub type __nlink_t = libc :: c_ulong ; pub type __off_t = libc :: c_long ; pub type __off64_t = libc :: c_long ; pub type __pid_t = libc :: c_int ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct __fsid_t { pub __val : [ libc :: c_int ; 2usize ] , } # [ test ] fn bindgen_test_layout___fsid_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __fsid_t > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( __fsid_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __fsid_t > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( __fsid_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __fsid_t ) ) . __val as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( __fsid_t ) , "::" , stringify ! ( __val ) ) ) ; } pub type __clock_t = libc :: c_long ; pub type __rlim_t = libc :: c_ulong ; pub type __rlim64_t = libc :: c_ulong ; pub type __id_t = libc :: c_uint ; pub type __time_t = libc :: c_long ; pub type __useconds_t = libc :: c_uint ; pub type __suseconds_t = libc :: c_long ; pub type __daddr_t = libc :: c_int ; pub type __key_t = libc :: c_int ; pub type __clockid_t = libc :: c_int ; pub type __timer_t = * mut libc :: c_void ; pub type __blksize_t = libc :: c_long ; pub type __blkcnt_t = libc :: c_long ; pub type __blkcnt64_t = libc :: c_long ; pub type __fsblkcnt_t = libc :: c_ulong ; pub type __fsblkcnt64_t = libc :: c_ulong ; pub type __fsfilcnt_t = libc :: c_ulong ; pub type __fsfilcnt64_t = libc :: c_ulong ; pub type __fsword_t = libc :: c_long ; pub type __ssize_t = libc :: c_long ; pub type __syscall_slong_t = libc :: c_long ; pub type __syscall_ulong_t = libc :: c_ulong ; pub type __loff_t = __off64_t ; pub type __caddr_t = * mut libc :: c_char ; pub type __intptr_t = libc :: c_long ; pub type __socklen_t = libc :: c_uint ; pub type __sig_atomic_t = libc :: c_int ; # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct __mbstate_t { pub __count : libc :: c_int , pub __value : __mbstate_t__bindgen_ty_1 , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union __mbstate_t__bindgen_ty_1 { pub __wch : libc :: c_uint , pub __wchb : [ libc :: c_char ; 4usize ] , _bindgen_union_align : u32 , } # [ test ] fn bindgen_test_layout___mbstate_t__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __mbstate_t__bindgen_ty_1 > ( ) , 4usize , concat ! ( "Size of: " , stringify ! ( __mbstate_t__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __mbstate_t__bindgen_ty_1 > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( __mbstate_t__bindgen_ty_1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __mbstate_t__bindgen_ty_1 ) ) . __wch as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( __mbstate_t__bindgen_ty_1 ) , "::" , stringify ! ( __wch ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __mbstate_t__bindgen_ty_1 ) ) . __wchb as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( __mbstate_t__bindgen_ty_1 ) , "::" , stringify ! ( __wchb ) ) ) ; } # [ test ] fn bindgen_test_layout___mbstate_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __mbstate_t > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( __mbstate_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __mbstate_t > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( __mbstate_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __mbstate_t ) ) . __count as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( __mbstate_t ) , "::" , stringify ! ( __count ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __mbstate_t ) ) . __value as * const _ as usize } , 4usize , concat ! ( "Alignment of field: " , stringify ! ( __mbstate_t ) , "::" , stringify ! ( __value ) ) ) ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct _G_fpos_t { pub __pos : __off_t , pub __state : __mbstate_t , } # [ test ] fn bindgen_test_layout__G_fpos_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _G_fpos_t > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( _G_fpos_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _G_fpos_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _G_fpos_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _G_fpos_t ) ) . __pos as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( _G_fpos_t ) , "::" , stringify ! ( __pos ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _G_fpos_t ) ) . __state as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( _G_fpos_t ) , "::" , stringify ! ( __state ) ) ) ; } pub type __fpos_t = _G_fpos_t ; # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct _G_fpos64_t { pub __pos : __off64_t , pub __state : __mbstate_t , } # [ test ] fn bindgen_test_layout__G_fpos64_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _G_fpos64_t > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( _G_fpos64_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _G_fpos64_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _G_fpos64_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _G_fpos64_t ) ) . __pos as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( _G_fpos64_t ) , "::" , stringify ! ( __pos ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _G_fpos64_t ) ) . __state as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( _G_fpos64_t ) , "::" , stringify ! ( __state ) ) ) ; } pub type __fpos64_t = _G_fpos64_t ; pub type __FILE = _IO_FILE ; pub type FILE = _IO_FILE ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _IO_marker { _unused : [ u8 ; 0 ] } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _IO_codecvt { _unused : [ u8 ; 0 ] } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _IO_wide_data { _unused : [ u8 ; 0 ] } pub type _IO_lock_t = libc :: c_void ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _IO_FILE { pub _flags : libc :: c_int , pub _IO_read_ptr : * mut libc :: c_char , pub _IO_read_end : * mut libc :: c_char , pub _IO_read_base : * mut libc :: c_char , pub _IO_write_base : * mut libc :: c_char , pub _IO_write_ptr : * mut libc :: c_char , pub _IO_write_end : * mut libc :: c_char , pub _IO_buf_base : * mut libc :: c_char , pub _IO_buf_end : * mut libc :: c_char , pub _IO_save_base : * mut libc :: c_char , pub _IO_backup_base : * mut libc :: c_char , pub _IO_save_end : * mut libc :: c_char , pub _markers : * mut _IO_marker , pub _chain : * mut _IO_FILE , pub _fileno : libc :: c_int , pub _flags2 : libc :: c_int , pub _old_offset : __off_t , pub _cur_column : libc :: c_ushort , pub _vtable_offset : libc :: c_schar , pub _shortbuf : [ libc :: c_char ; 1usize ] , pub _lock : * mut _IO_lock_t , pub _offset : __off64_t , pub _codecvt : * mut _IO_codecvt , pub _wide_data : * mut _IO_wide_data , pub _freeres_list : * mut _IO_FILE , pub _freeres_buf : * mut libc :: c_void , pub __pad5 : usize , pub _mode : libc :: c_int , pub _unused2 : [ libc :: c_char ; 20usize ] , } # [ test ] fn bindgen_test_layout__IO_FILE ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _IO_FILE > ( ) , 216usize , concat ! ( "Size of: " , stringify ! ( _IO_FILE ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _IO_FILE > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _IO_FILE ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _flags as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _flags ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _IO_read_ptr as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _IO_read_ptr ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _IO_read_end as * const _ as usize } , 16usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _IO_read_end ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _IO_read_base as * const _ as usize } , 24usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _IO_read_base ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _IO_write_base as * const _ as usize } , 32usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _IO_write_base ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _IO_write_ptr as * const _ as usize } , 40usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _IO_write_ptr ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _IO_write_end as * const _ as usize } , 48usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _IO_write_end ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _IO_buf_base as * const _ as usize } , 56usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _IO_buf_base ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _IO_buf_end as * const _ as usize } , 64usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _IO_buf_end ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _IO_save_base as * const _ as usize } , 72usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _IO_save_base ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _IO_backup_base as * const _ as usize } , 80usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _IO_backup_base ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _IO_save_end as * const _ as usize } , 88usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _IO_save_end ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _markers as * const _ as usize } , 96usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _markers ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _chain as * const _ as usize } , 104usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _chain ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _fileno as * const _ as usize } , 112usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _fileno ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _flags2 as * const _ as usize } , 116usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _flags2 ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _old_offset as * const _ as usize } , 120usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _old_offset ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _cur_column as * const _ as usize } , 128usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _cur_column ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _vtable_offset as * const _ as usize } , 130usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _vtable_offset ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _shortbuf as * const _ as usize } , 131usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _shortbuf ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _lock as * const _ as usize } , 136usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _lock ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _offset as * const _ as usize } , 144usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _offset ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _codecvt as * const _ as usize } , 152usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _codecvt ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _wide_data as * const _ as usize } , 160usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _wide_data ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _freeres_list as * const _ as usize } , 168usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _freeres_list ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _freeres_buf as * const _ as usize } , 176usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _freeres_buf ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . __pad5 as * const _ as usize } , 184usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( __pad5 ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _mode as * const _ as usize } , 192usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _mode ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_FILE ) ) . _unused2 as * const _ as usize } , 196usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_FILE ) , "::" , stringify ! ( _unused2 ) ) ) ; } pub type cookie_read_function_t = :: std :: option :: Option < unsafe extern "C" fn ( __cookie : * mut libc :: c_void , __buf : * mut libc :: c_char , __nbytes : usize ) -> __ssize_t > ; pub type cookie_write_function_t = :: std :: option :: Option < unsafe extern "C" fn ( __cookie : * mut libc :: c_void , __buf : * const libc :: c_char , __nbytes : usize ) -> __ssize_t > ; pub type cookie_seek_function_t = :: std :: option :: Option < unsafe extern "C" fn ( __cookie : * mut libc :: c_void , __pos : * mut __off64_t , __w : libc :: c_int ) -> libc :: c_int > ; pub type cookie_close_function_t = :: std :: option :: Option < unsafe extern "C" fn ( __cookie : * mut libc :: c_void ) -> libc :: c_int > ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _IO_cookie_io_functions_t { pub read : cookie_read_function_t , pub write : cookie_write_function_t , pub seek : cookie_seek_function_t , pub close : cookie_close_function_t , } # [ test ] fn bindgen_test_layout__IO_cookie_io_functions_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _IO_cookie_io_functions_t > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( _IO_cookie_io_functions_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _IO_cookie_io_functions_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _IO_cookie_io_functions_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_cookie_io_functions_t ) ) . read as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_cookie_io_functions_t ) , "::" , stringify ! ( read ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_cookie_io_functions_t ) ) . write as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_cookie_io_functions_t ) , "::" , stringify ! ( write ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_cookie_io_functions_t ) ) . seek as * const _ as usize } , 16usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_cookie_io_functions_t ) , "::" , stringify ! ( seek ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _IO_cookie_io_functions_t ) ) . close as * const _ as usize } , 24usize , concat ! ( "Alignment of field: " , stringify ! ( _IO_cookie_io_functions_t ) , "::" , stringify ! ( close ) ) ) ; } pub type cookie_io_functions_t = _IO_cookie_io_functions_t ; pub type off_t = __off_t ; pub type off64_t = __off64_t ; pub type fpos_t = __fpos_t ; pub type fpos64_t = __fpos64_t ; extern "C" {
 # [ link_name = "\u{1}stdin" ] 
 pub static mut  stdin  :  * mut FILE ;
} extern "C" {
 # [ link_name = "\u{1}stdout" ] 
 pub static mut  stdout  :  * mut FILE ;
} extern "C" {
 # [ link_name = "\u{1}stderr" ] 
 pub static mut  stderr  :  * mut FILE ;
} extern "C" {
 pub fn remove ( __filename : * const libc :: c_char , ) -> libc :: c_int ; 
} extern "C" {
 pub fn rename ( __old : * const libc :: c_char , __new : * const libc :: c_char , ) -> libc :: c_int ; 
} extern "C" {
 pub fn renameat ( __oldfd : libc :: c_int , __old : * const libc :: c_char , __newfd : libc :: c_int , __new : * const libc :: c_char , ) -> libc :: c_int ; 
} extern "C" {
 pub fn renameat2 ( __oldfd : libc :: c_int , __old : * const libc :: c_char , __newfd : libc :: c_int , __new : * const libc :: c_char , __flags : libc :: c_uint , ) -> libc :: c_int ; 
} extern "C" {
 pub fn tmpfile ( ) -> * mut FILE ; 
} extern "C" {
 pub fn tmpfile64 ( ) -> * mut FILE ; 
} extern "C" {
 pub fn tmpnam ( __s : * mut libc :: c_char , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn tmpnam_r ( __s : * mut libc :: c_char , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn tempnam ( __dir : * const libc :: c_char , __pfx : * const libc :: c_char , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn fclose ( __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn fflush ( __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn fflush_unlocked ( __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn fcloseall ( ) -> libc :: c_int ; 
} extern "C" {
 pub fn fopen ( __filename : * const libc :: c_char , __modes : * const libc :: c_char , ) -> * mut FILE ; 
} extern "C" {
 pub fn freopen ( __filename : * const libc :: c_char , __modes : * const libc :: c_char , __stream : * mut FILE , ) -> * mut FILE ; 
} extern "C" {
 pub fn fopen64 ( __filename : * const libc :: c_char , __modes : * const libc :: c_char , ) -> * mut FILE ; 
} extern "C" {
 pub fn freopen64 ( __filename : * const libc :: c_char , __modes : * const libc :: c_char , __stream : * mut FILE , ) -> * mut FILE ; 
} extern "C" {
 pub fn fdopen ( __fd : libc :: c_int , __modes : * const libc :: c_char , ) -> * mut FILE ; 
} extern "C" {
 pub fn fopencookie ( __magic_cookie : * mut libc :: c_void , __modes : * const libc :: c_char , __io_funcs : cookie_io_functions_t , ) -> * mut FILE ; 
} extern "C" {
 pub fn fmemopen ( __s : * mut libc :: c_void , __len : usize , __modes : * const libc :: c_char , ) -> * mut FILE ; 
} extern "C" {
 pub fn open_memstream ( __bufloc : * mut * mut libc :: c_char , __sizeloc : * mut usize , ) -> * mut FILE ; 
} extern "C" {
 pub fn setbuf ( __stream : * mut FILE , __buf : * mut libc :: c_char , ) ; 
} extern "C" {
 pub fn setvbuf ( __stream : * mut FILE , __buf : * mut libc :: c_char , __modes : libc :: c_int , __n : usize , ) -> libc :: c_int ; 
} extern "C" {
 pub fn setbuffer ( __stream : * mut FILE , __buf : * mut libc :: c_char , __size : usize , ) ; 
} extern "C" {
 pub fn setlinebuf ( __stream : * mut FILE , ) ; 
} extern "C" {
 pub fn fprintf ( __stream : * mut FILE , __format : * const libc :: c_char , ... ) -> libc :: c_int ; 
} extern "C" {
 pub fn printf ( __format : * const libc :: c_char , ... ) -> libc :: c_int ; 
} extern "C" {
 pub fn sprintf ( __s : * mut libc :: c_char , __format : * const libc :: c_char , ... ) -> libc :: c_int ; 
} extern "C" {
 pub fn vfprintf ( __s : * mut FILE , __format : * const libc :: c_char , __arg : * mut __va_list_tag , ) -> libc :: c_int ; 
} extern "C" {
 pub fn vprintf ( __format : * const libc :: c_char , __arg : * mut __va_list_tag , ) -> libc :: c_int ; 
} extern "C" {
 pub fn vsprintf ( __s : * mut libc :: c_char , __format : * const libc :: c_char , __arg : * mut __va_list_tag , ) -> libc :: c_int ; 
} extern "C" {
 pub fn snprintf ( __s : * mut libc :: c_char , __maxlen : usize , __format : * const libc :: c_char , ... ) -> libc :: c_int ; 
} extern "C" {
 pub fn vsnprintf ( __s : * mut libc :: c_char , __maxlen : usize , __format : * const libc :: c_char , __arg : * mut __va_list_tag , ) -> libc :: c_int ; 
} extern "C" {
 pub fn vasprintf ( __ptr : * mut * mut libc :: c_char , __f : * const libc :: c_char , __arg : * mut __va_list_tag , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __asprintf ( __ptr : * mut * mut libc :: c_char , __fmt : * const libc :: c_char , ... ) -> libc :: c_int ; 
} extern "C" {
 pub fn asprintf ( __ptr : * mut * mut libc :: c_char , __fmt : * const libc :: c_char , ... ) -> libc :: c_int ; 
} extern "C" {
 pub fn vdprintf ( __fd : libc :: c_int , __fmt : * const libc :: c_char , __arg : * mut __va_list_tag , ) -> libc :: c_int ; 
} extern "C" {
 pub fn dprintf ( __fd : libc :: c_int , __fmt : * const libc :: c_char , ... ) -> libc :: c_int ; 
} extern "C" {
 pub fn fscanf ( __stream : * mut FILE , __format : * const libc :: c_char , ... ) -> libc :: c_int ; 
} extern "C" {
 pub fn scanf ( __format : * const libc :: c_char , ... ) -> libc :: c_int ; 
} extern "C" {
 pub fn sscanf ( __s : * const libc :: c_char , __format : * const libc :: c_char , ... ) -> libc :: c_int ; 
} extern "C" {
 pub fn vfscanf ( __s : * mut FILE , __format : * const libc :: c_char , __arg : * mut __va_list_tag , ) -> libc :: c_int ; 
} extern "C" {
 pub fn vscanf ( __format : * const libc :: c_char , __arg : * mut __va_list_tag , ) -> libc :: c_int ; 
} extern "C" {
 pub fn vsscanf ( __s : * const libc :: c_char , __format : * const libc :: c_char , __arg : * mut __va_list_tag , ) -> libc :: c_int ; 
} extern "C" {
 pub fn fgetc ( __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn getc ( __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn getchar ( ) -> libc :: c_int ; 
} extern "C" {
 pub fn getc_unlocked ( __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn getchar_unlocked ( ) -> libc :: c_int ; 
} extern "C" {
 pub fn fgetc_unlocked ( __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn fputc ( __c : libc :: c_int , __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn putc ( __c : libc :: c_int , __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn putchar ( __c : libc :: c_int , ) -> libc :: c_int ; 
} extern "C" {
 pub fn fputc_unlocked ( __c : libc :: c_int , __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn putc_unlocked ( __c : libc :: c_int , __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn putchar_unlocked ( __c : libc :: c_int , ) -> libc :: c_int ; 
} extern "C" {
 pub fn getw ( __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn putw ( __w : libc :: c_int , __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn fgets ( __s : * mut libc :: c_char , __n : libc :: c_int , __stream : * mut FILE , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn fgets_unlocked ( __s : * mut libc :: c_char , __n : libc :: c_int , __stream : * mut FILE , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn __getdelim ( __lineptr : * mut * mut libc :: c_char , __n : * mut usize , __delimiter : libc :: c_int , __stream : * mut FILE , ) -> __ssize_t ; 
} extern "C" {
 pub fn getdelim ( __lineptr : * mut * mut libc :: c_char , __n : * mut usize , __delimiter : libc :: c_int , __stream : * mut FILE , ) -> __ssize_t ; 
} extern "C" {
 pub fn getline ( __lineptr : * mut * mut libc :: c_char , __n : * mut usize , __stream : * mut FILE , ) -> __ssize_t ; 
} extern "C" {
 pub fn fputs ( __s : * const libc :: c_char , __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn puts ( __s : * const libc :: c_char , ) -> libc :: c_int ; 
} extern "C" {
 pub fn ungetc ( __c : libc :: c_int , __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn fread ( __ptr : * mut libc :: c_void , __size : usize , __n : usize , __stream : * mut FILE , ) -> libc :: c_ulong ; 
} extern "C" {
 pub fn fwrite ( __ptr : * const libc :: c_void , __size : usize , __n : usize , __s : * mut FILE , ) -> libc :: c_ulong ; 
} extern "C" {
 pub fn fputs_unlocked ( __s : * const libc :: c_char , __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn fread_unlocked ( __ptr : * mut libc :: c_void , __size : usize , __n : usize , __stream : * mut FILE , ) -> usize ; 
} extern "C" {
 pub fn fwrite_unlocked ( __ptr : * const libc :: c_void , __size : usize , __n : usize , __stream : * mut FILE , ) -> usize ; 
} extern "C" {
 pub fn fseek ( __stream : * mut FILE , __off : libc :: c_long , __whence : libc :: c_int , ) -> libc :: c_int ; 
} extern "C" {
 pub fn ftell ( __stream : * mut FILE , ) -> libc :: c_long ; 
} extern "C" {
 pub fn rewind ( __stream : * mut FILE , ) ; 
} extern "C" {
 pub fn fseeko ( __stream : * mut FILE , __off : __off_t , __whence : libc :: c_int , ) -> libc :: c_int ; 
} extern "C" {
 pub fn ftello ( __stream : * mut FILE , ) -> __off_t ; 
} extern "C" {
 pub fn fgetpos ( __stream : * mut FILE , __pos : * mut fpos_t , ) -> libc :: c_int ; 
} extern "C" {
 pub fn fsetpos ( __stream : * mut FILE , __pos : * const fpos_t , ) -> libc :: c_int ; 
} extern "C" {
 pub fn fseeko64 ( __stream : * mut FILE , __off : __off64_t , __whence : libc :: c_int , ) -> libc :: c_int ; 
} extern "C" {
 pub fn ftello64 ( __stream : * mut FILE , ) -> __off64_t ; 
} extern "C" {
 pub fn fgetpos64 ( __stream : * mut FILE , __pos : * mut fpos64_t , ) -> libc :: c_int ; 
} extern "C" {
 pub fn fsetpos64 ( __stream : * mut FILE , __pos : * const fpos64_t , ) -> libc :: c_int ; 
} extern "C" {
 pub fn clearerr ( __stream : * mut FILE , ) ; 
} extern "C" {
 pub fn feof ( __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn ferror ( __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn clearerr_unlocked ( __stream : * mut FILE , ) ; 
} extern "C" {
 pub fn feof_unlocked ( __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn ferror_unlocked ( __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn perror ( __s : * const libc :: c_char , ) ; 
} extern "C" {
 # [ link_name = "\u{1}sys_nerr" ] 
 pub static mut  sys_nerr  :  libc :: c_int ;
} extern "C" {
 # [ link_name = "\u{1}sys_errlist" ] 
 pub static mut  sys_errlist  :  [ * const libc :: c_char ; 0usize ] ;
} extern "C" {
 # [ link_name = "\u{1}_sys_nerr" ] 
 pub static mut  _sys_nerr  :  libc :: c_int ;
} extern "C" {
 # [ link_name = "\u{1}_sys_errlist" ] 
 pub static mut  _sys_errlist  :  [ * const libc :: c_char ; 0usize ] ;
} extern "C" {
 pub fn fileno ( __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn fileno_unlocked ( __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn popen ( __command : * const libc :: c_char , __modes : * const libc :: c_char , ) -> * mut FILE ; 
} extern "C" {
 pub fn pclose ( __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn ctermid ( __s : * mut libc :: c_char , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn cuserid ( __s : * mut libc :: c_char , ) -> * mut libc :: c_char ; 
} # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct obstack { _unused : [ u8 ; 0 ] } extern "C" {
 pub fn obstack_printf ( __obstack : * mut obstack , __format : * const libc :: c_char , ... ) -> libc :: c_int ; 
} extern "C" {
 pub fn obstack_vprintf ( __obstack : * mut obstack , __format : * const libc :: c_char , __args : * mut __va_list_tag , ) -> libc :: c_int ; 
} extern "C" {
 pub fn flockfile ( __stream : * mut FILE , ) ; 
} extern "C" {
 pub fn ftrylockfile ( __stream : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn funlockfile ( __stream : * mut FILE , ) ; 
} extern "C" {
 pub fn __uflow ( arg1 : * mut FILE , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __overflow ( arg1 : * mut FILE , arg2 : libc :: c_int , ) -> libc :: c_int ; 
} pub type wchar_t = libc :: c_int ; pub const idtype_t_P_ALL : idtype_t = 0 ; pub const idtype_t_P_PID : idtype_t = 1 ; pub const idtype_t_P_PGID : idtype_t = 2 ; pub type idtype_t = libc :: c_uint ; pub type _Float32 = f32 ; pub type _Float64 = f64 ; pub type _Float32x = f64 ; pub type _Float64x = f64 ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct div_t { pub quot : libc :: c_int , pub rem : libc :: c_int , } # [ test ] fn bindgen_test_layout_div_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < div_t > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( div_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < div_t > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( div_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const div_t ) ) . quot as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( div_t ) , "::" , stringify ! ( quot ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const div_t ) ) . rem as * const _ as usize } , 4usize , concat ! ( "Alignment of field: " , stringify ! ( div_t ) , "::" , stringify ! ( rem ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct ldiv_t { pub quot : libc :: c_long , pub rem : libc :: c_long , } # [ test ] fn bindgen_test_layout_ldiv_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < ldiv_t > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( ldiv_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < ldiv_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( ldiv_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const ldiv_t ) ) . quot as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( ldiv_t ) , "::" , stringify ! ( quot ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const ldiv_t ) ) . rem as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( ldiv_t ) , "::" , stringify ! ( rem ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct lldiv_t { pub quot : libc :: c_longlong , pub rem : libc :: c_longlong , } # [ test ] fn bindgen_test_layout_lldiv_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < lldiv_t > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( lldiv_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < lldiv_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( lldiv_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const lldiv_t ) ) . quot as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( lldiv_t ) , "::" , stringify ! ( quot ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const lldiv_t ) ) . rem as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( lldiv_t ) , "::" , stringify ! ( rem ) ) ) ; } extern "C" {
 pub fn __ctype_get_mb_cur_max ( ) -> usize ; 
} extern "C" {
 pub fn atof ( __nptr : * const libc :: c_char , ) -> f64 ; 
} extern "C" {
 pub fn atoi ( __nptr : * const libc :: c_char , ) -> libc :: c_int ; 
} extern "C" {
 pub fn atol ( __nptr : * const libc :: c_char , ) -> libc :: c_long ; 
} extern "C" {
 pub fn atoll ( __nptr : * const libc :: c_char , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn strtod ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , ) -> f64 ; 
} extern "C" {
 pub fn strtof ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , ) -> f32 ; 
} extern "C" {
 pub fn strtold ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , ) -> f64 ; 
} extern "C" {
 pub fn strtof32 ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , ) -> _Float32 ; 
} extern "C" {
 pub fn strtof64 ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , ) -> _Float64 ; 
} extern "C" {
 pub fn strtof32x ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , ) -> _Float32x ; 
} extern "C" {
 pub fn strtof64x ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , ) -> _Float64x ; 
} extern "C" {
 pub fn strtol ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , __base : libc :: c_int , ) -> libc :: c_long ; 
} extern "C" {
 pub fn strtoul ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , __base : libc :: c_int , ) -> libc :: c_ulong ; 
} extern "C" {
 pub fn strtoq ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , __base : libc :: c_int , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn strtouq ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , __base : libc :: c_int , ) -> libc :: c_ulonglong ; 
} extern "C" {
 pub fn strtoll ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , __base : libc :: c_int , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn strtoull ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , __base : libc :: c_int , ) -> libc :: c_ulonglong ; 
} extern "C" {
 pub fn strfromd ( __dest : * mut libc :: c_char , __size : usize , __format : * const libc :: c_char , __f : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn strfromf ( __dest : * mut libc :: c_char , __size : usize , __format : * const libc :: c_char , __f : f32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn strfroml ( __dest : * mut libc :: c_char , __size : usize , __format : * const libc :: c_char , __f : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn strfromf32 ( __dest : * mut libc :: c_char , __size : usize , __format : * const libc :: c_char , __f : _Float32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn strfromf64 ( __dest : * mut libc :: c_char , __size : usize , __format : * const libc :: c_char , __f : _Float64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn strfromf32x ( __dest : * mut libc :: c_char , __size : usize , __format : * const libc :: c_char , __f : _Float32x , ) -> libc :: c_int ; 
} extern "C" {
 pub fn strfromf64x ( __dest : * mut libc :: c_char , __size : usize , __format : * const libc :: c_char , __f : _Float64x , ) -> libc :: c_int ; 
} # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct __locale_struct { pub __locales : [ * mut __locale_data ; 13usize ] , pub __ctype_b : * const libc :: c_ushort , pub __ctype_tolower : * const libc :: c_int , pub __ctype_toupper : * const libc :: c_int , pub __names : [ * const libc :: c_char ; 13usize ] , } # [ test ] fn bindgen_test_layout___locale_struct ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __locale_struct > ( ) , 232usize , concat ! ( "Size of: " , stringify ! ( __locale_struct ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __locale_struct > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( __locale_struct ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __locale_struct ) ) . __locales as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( __locale_struct ) , "::" , stringify ! ( __locales ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __locale_struct ) ) . __ctype_b as * const _ as usize } , 104usize , concat ! ( "Alignment of field: " , stringify ! ( __locale_struct ) , "::" , stringify ! ( __ctype_b ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __locale_struct ) ) . __ctype_tolower as * const _ as usize } , 112usize , concat ! ( "Alignment of field: " , stringify ! ( __locale_struct ) , "::" , stringify ! ( __ctype_tolower ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __locale_struct ) ) . __ctype_toupper as * const _ as usize } , 120usize , concat ! ( "Alignment of field: " , stringify ! ( __locale_struct ) , "::" , stringify ! ( __ctype_toupper ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __locale_struct ) ) . __names as * const _ as usize } , 128usize , concat ! ( "Alignment of field: " , stringify ! ( __locale_struct ) , "::" , stringify ! ( __names ) ) ) ; } pub type __locale_t = * mut __locale_struct ; pub type locale_t = __locale_t ; extern "C" {
 pub fn strtol_l ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , __base : libc :: c_int , __loc : locale_t , ) -> libc :: c_long ; 
} extern "C" {
 pub fn strtoul_l ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , __base : libc :: c_int , __loc : locale_t , ) -> libc :: c_ulong ; 
} extern "C" {
 pub fn strtoll_l ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , __base : libc :: c_int , __loc : locale_t , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn strtoull_l ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , __base : libc :: c_int , __loc : locale_t , ) -> libc :: c_ulonglong ; 
} extern "C" {
 pub fn strtod_l ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , __loc : locale_t , ) -> f64 ; 
} extern "C" {
 pub fn strtof_l ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , __loc : locale_t , ) -> f32 ; 
} extern "C" {
 pub fn strtold_l ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , __loc : locale_t , ) -> f64 ; 
} extern "C" {
 pub fn strtof32_l ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , __loc : locale_t , ) -> _Float32 ; 
} extern "C" {
 pub fn strtof64_l ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , __loc : locale_t , ) -> _Float64 ; 
} extern "C" {
 pub fn strtof32x_l ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , __loc : locale_t , ) -> _Float32x ; 
} extern "C" {
 pub fn strtof64x_l ( __nptr : * const libc :: c_char , __endptr : * mut * mut libc :: c_char , __loc : locale_t , ) -> _Float64x ; 
} extern "C" {
 pub fn l64a ( __n : libc :: c_long , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn a64l ( __s : * const libc :: c_char , ) -> libc :: c_long ; 
} pub type u_char = __u_char ; pub type u_short = __u_short ; pub type u_int = __u_int ; pub type u_long = __u_long ; pub type quad_t = __quad_t ; pub type u_quad_t = __u_quad_t ; pub type fsid_t = __fsid_t ; pub type loff_t = __loff_t ; pub type ino_t = __ino_t ; pub type ino64_t = __ino64_t ; pub type dev_t = __dev_t ; pub type gid_t = __gid_t ; pub type mode_t = __mode_t ; pub type nlink_t = __nlink_t ; pub type uid_t = __uid_t ; pub type pid_t = __pid_t ; pub type id_t = __id_t ; pub type daddr_t = __daddr_t ; pub type caddr_t = __caddr_t ; pub type key_t = __key_t ; pub type clock_t = __clock_t ; pub type clockid_t = __clockid_t ; pub type time_t = __time_t ; pub type timer_t = __timer_t ; pub type useconds_t = __useconds_t ; pub type suseconds_t = __suseconds_t ; pub type ulong = libc :: c_ulong ; pub type ushort = libc :: c_ushort ; pub type uint = libc :: c_uint ; pub type u_int8_t = libc :: c_uchar ; pub type u_int16_t = libc :: c_ushort ; pub type u_int32_t = libc :: c_uint ; pub type u_int64_t = libc :: c_ulong ; pub type register_t = libc :: c_long ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct __sigset_t { pub __val : [ libc :: c_ulong ; 16usize ] , } # [ test ] fn bindgen_test_layout___sigset_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __sigset_t > ( ) , 128usize , concat ! ( "Size of: " , stringify ! ( __sigset_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __sigset_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( __sigset_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __sigset_t ) ) . __val as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( __sigset_t ) , "::" , stringify ! ( __val ) ) ) ; } pub type sigset_t = __sigset_t ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct timeval { pub tv_sec : __time_t , pub tv_usec : __suseconds_t , } # [ test ] fn bindgen_test_layout_timeval ( ) { assert_eq ! ( :: std :: mem :: size_of :: < timeval > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( timeval ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < timeval > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( timeval ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timeval ) ) . tv_sec as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( timeval ) , "::" , stringify ! ( tv_sec ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timeval ) ) . tv_usec as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( timeval ) , "::" , stringify ! ( tv_usec ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct timespec { pub tv_sec : __time_t , pub tv_nsec : __syscall_slong_t , } # [ test ] fn bindgen_test_layout_timespec ( ) { assert_eq ! ( :: std :: mem :: size_of :: < timespec > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( timespec ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < timespec > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( timespec ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timespec ) ) . tv_sec as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( timespec ) , "::" , stringify ! ( tv_sec ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timespec ) ) . tv_nsec as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( timespec ) , "::" , stringify ! ( tv_nsec ) ) ) ; } pub type __fd_mask = libc :: c_long ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct fd_set { pub fds_bits : [ __fd_mask ; 16usize ] , } # [ test ] fn bindgen_test_layout_fd_set ( ) { assert_eq ! ( :: std :: mem :: size_of :: < fd_set > ( ) , 128usize , concat ! ( "Size of: " , stringify ! ( fd_set ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < fd_set > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( fd_set ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const fd_set ) ) . fds_bits as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( fd_set ) , "::" , stringify ! ( fds_bits ) ) ) ; } pub type fd_mask = __fd_mask ; extern "C" {
 pub fn select ( __nfds : libc :: c_int , __readfds : * mut fd_set , __writefds : * mut fd_set , __exceptfds : * mut fd_set , __timeout : * mut timeval , ) -> libc :: c_int ; 
} extern "C" {
 pub fn pselect ( __nfds : libc :: c_int , __readfds : * mut fd_set , __writefds : * mut fd_set , __exceptfds : * mut fd_set , __timeout : * const timespec , __sigmask : * const __sigset_t , ) -> libc :: c_int ; 
} pub type blksize_t = __blksize_t ; pub type blkcnt_t = __blkcnt_t ; pub type fsblkcnt_t = __fsblkcnt_t ; pub type fsfilcnt_t = __fsfilcnt_t ; pub type blkcnt64_t = __blkcnt64_t ; pub type fsblkcnt64_t = __fsblkcnt64_t ; pub type fsfilcnt64_t = __fsfilcnt64_t ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct __pthread_rwlock_arch_t { pub __readers : libc :: c_uint , pub __writers : libc :: c_uint , pub __wrphase_futex : libc :: c_uint , pub __writers_futex : libc :: c_uint , pub __pad3 : libc :: c_uint , pub __pad4 : libc :: c_uint , pub __cur_writer : libc :: c_int , pub __shared : libc :: c_int , pub __rwelision : libc :: c_schar , pub __pad1 : [ libc :: c_uchar ; 7usize ] , pub __pad2 : libc :: c_ulong , pub __flags : libc :: c_uint , } # [ test ] fn bindgen_test_layout___pthread_rwlock_arch_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __pthread_rwlock_arch_t > ( ) , 56usize , concat ! ( "Size of: " , stringify ! ( __pthread_rwlock_arch_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __pthread_rwlock_arch_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( __pthread_rwlock_arch_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) . __readers as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t ) , "::" , stringify ! ( __readers ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) . __writers as * const _ as usize } , 4usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t ) , "::" , stringify ! ( __writers ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) . __wrphase_futex as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t ) , "::" , stringify ! ( __wrphase_futex ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) . __writers_futex as * const _ as usize } , 12usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t ) , "::" , stringify ! ( __writers_futex ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) . __pad3 as * const _ as usize } , 16usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t ) , "::" , stringify ! ( __pad3 ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) . __pad4 as * const _ as usize } , 20usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t ) , "::" , stringify ! ( __pad4 ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) . __cur_writer as * const _ as usize } , 24usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t ) , "::" , stringify ! ( __cur_writer ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) . __shared as * const _ as usize } , 28usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t ) , "::" , stringify ! ( __shared ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) . __rwelision as * const _ as usize } , 32usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t ) , "::" , stringify ! ( __rwelision ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) . __pad1 as * const _ as usize } , 33usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t ) , "::" , stringify ! ( __pad1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) . __pad2 as * const _ as usize } , 40usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t ) , "::" , stringify ! ( __pad2 ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_rwlock_arch_t ) ) . __flags as * const _ as usize } , 48usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_rwlock_arch_t ) , "::" , stringify ! ( __flags ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct __pthread_internal_list { pub __prev : * mut __pthread_internal_list , pub __next : * mut __pthread_internal_list , } # [ test ] fn bindgen_test_layout___pthread_internal_list ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __pthread_internal_list > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( __pthread_internal_list ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __pthread_internal_list > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( __pthread_internal_list ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_internal_list ) ) . __prev as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_internal_list ) , "::" , stringify ! ( __prev ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_internal_list ) ) . __next as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_internal_list ) , "::" , stringify ! ( __next ) ) ) ; } pub type __pthread_list_t = __pthread_internal_list ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct __pthread_mutex_s { pub __lock : libc :: c_int , pub __count : libc :: c_uint , pub __owner : libc :: c_int , pub __nusers : libc :: c_uint , pub __kind : libc :: c_int , pub __spins : libc :: c_short , pub __elision : libc :: c_short , pub __list : __pthread_list_t , } # [ test ] fn bindgen_test_layout___pthread_mutex_s ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __pthread_mutex_s > ( ) , 40usize , concat ! ( "Size of: " , stringify ! ( __pthread_mutex_s ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __pthread_mutex_s > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( __pthread_mutex_s ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_mutex_s ) ) . __lock as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_mutex_s ) , "::" , stringify ! ( __lock ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_mutex_s ) ) . __count as * const _ as usize } , 4usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_mutex_s ) , "::" , stringify ! ( __count ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_mutex_s ) ) . __owner as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_mutex_s ) , "::" , stringify ! ( __owner ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_mutex_s ) ) . __nusers as * const _ as usize } , 12usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_mutex_s ) , "::" , stringify ! ( __nusers ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_mutex_s ) ) . __kind as * const _ as usize } , 16usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_mutex_s ) , "::" , stringify ! ( __kind ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_mutex_s ) ) . __spins as * const _ as usize } , 20usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_mutex_s ) , "::" , stringify ! ( __spins ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_mutex_s ) ) . __elision as * const _ as usize } , 22usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_mutex_s ) , "::" , stringify ! ( __elision ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_mutex_s ) ) . __list as * const _ as usize } , 24usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_mutex_s ) , "::" , stringify ! ( __list ) ) ) ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub struct __pthread_cond_s { pub __bindgen_anon_1 : __pthread_cond_s__bindgen_ty_1 , pub __bindgen_anon_2 : __pthread_cond_s__bindgen_ty_2 , pub __g_refs : [ libc :: c_uint ; 2usize ] , pub __g_size : [ libc :: c_uint ; 2usize ] , pub __g1_orig_size : libc :: c_uint , pub __wrefs : libc :: c_uint , pub __g_signals : [ libc :: c_uint ; 2usize ] , } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union __pthread_cond_s__bindgen_ty_1 { pub __wseq : libc :: c_ulonglong , pub __wseq32 : __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 , _bindgen_union_align : u64 , } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 { pub __low : libc :: c_uint , pub __high : libc :: c_uint , } # [ test ] fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 ) ) . __low as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( __low ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 ) ) . __high as * const _ as usize } , 4usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_cond_s__bindgen_ty_1__bindgen_ty_1 ) , "::" , stringify ! ( __high ) ) ) ; } # [ test ] fn bindgen_test_layout___pthread_cond_s__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __pthread_cond_s__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( __pthread_cond_s__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __pthread_cond_s__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( __pthread_cond_s__bindgen_ty_1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_cond_s__bindgen_ty_1 ) ) . __wseq as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_cond_s__bindgen_ty_1 ) , "::" , stringify ! ( __wseq ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_cond_s__bindgen_ty_1 ) ) . __wseq32 as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_cond_s__bindgen_ty_1 ) , "::" , stringify ! ( __wseq32 ) ) ) ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union __pthread_cond_s__bindgen_ty_2 { pub __g1_start : libc :: c_ulonglong , pub __g1_start32 : __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 , _bindgen_union_align : u64 , } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 { pub __low : libc :: c_uint , pub __high : libc :: c_uint , } # [ test ] fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2__bindgen_ty_1 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 ) ) . __low as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 ) , "::" , stringify ! ( __low ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 ) ) . __high as * const _ as usize } , 4usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_cond_s__bindgen_ty_2__bindgen_ty_1 ) , "::" , stringify ! ( __high ) ) ) ; } # [ test ] fn bindgen_test_layout___pthread_cond_s__bindgen_ty_2 ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __pthread_cond_s__bindgen_ty_2 > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( __pthread_cond_s__bindgen_ty_2 ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __pthread_cond_s__bindgen_ty_2 > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( __pthread_cond_s__bindgen_ty_2 ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_cond_s__bindgen_ty_2 ) ) . __g1_start as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_cond_s__bindgen_ty_2 ) , "::" , stringify ! ( __g1_start ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_cond_s__bindgen_ty_2 ) ) . __g1_start32 as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_cond_s__bindgen_ty_2 ) , "::" , stringify ! ( __g1_start32 ) ) ) ; } # [ test ] fn bindgen_test_layout___pthread_cond_s ( ) { assert_eq ! ( :: std :: mem :: size_of :: < __pthread_cond_s > ( ) , 48usize , concat ! ( "Size of: " , stringify ! ( __pthread_cond_s ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < __pthread_cond_s > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( __pthread_cond_s ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_cond_s ) ) . __g_refs as * const _ as usize } , 16usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_cond_s ) , "::" , stringify ! ( __g_refs ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_cond_s ) ) . __g_size as * const _ as usize } , 24usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_cond_s ) , "::" , stringify ! ( __g_size ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_cond_s ) ) . __g1_orig_size as * const _ as usize } , 32usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_cond_s ) , "::" , stringify ! ( __g1_orig_size ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_cond_s ) ) . __wrefs as * const _ as usize } , 36usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_cond_s ) , "::" , stringify ! ( __wrefs ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const __pthread_cond_s ) ) . __g_signals as * const _ as usize } , 40usize , concat ! ( "Alignment of field: " , stringify ! ( __pthread_cond_s ) , "::" , stringify ! ( __g_signals ) ) ) ; } pub type pthread_t = libc :: c_ulong ; # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union pthread_mutexattr_t { pub __size : [ libc :: c_char ; 4usize ] , pub __align : libc :: c_int , _bindgen_union_align : u32 , } # [ test ] fn bindgen_test_layout_pthread_mutexattr_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < pthread_mutexattr_t > ( ) , 4usize , concat ! ( "Size of: " , stringify ! ( pthread_mutexattr_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < pthread_mutexattr_t > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( pthread_mutexattr_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const pthread_mutexattr_t ) ) . __size as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( pthread_mutexattr_t ) , "::" , stringify ! ( __size ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const pthread_mutexattr_t ) ) . __align as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( pthread_mutexattr_t ) , "::" , stringify ! ( __align ) ) ) ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union pthread_condattr_t { pub __size : [ libc :: c_char ; 4usize ] , pub __align : libc :: c_int , _bindgen_union_align : u32 , } # [ test ] fn bindgen_test_layout_pthread_condattr_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < pthread_condattr_t > ( ) , 4usize , concat ! ( "Size of: " , stringify ! ( pthread_condattr_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < pthread_condattr_t > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( pthread_condattr_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const pthread_condattr_t ) ) . __size as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( pthread_condattr_t ) , "::" , stringify ! ( __size ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const pthread_condattr_t ) ) . __align as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( pthread_condattr_t ) , "::" , stringify ! ( __align ) ) ) ; } pub type pthread_key_t = libc :: c_uint ; pub type pthread_once_t = libc :: c_int ; # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union pthread_attr_t { pub __size : [ libc :: c_char ; 56usize ] , pub __align : libc :: c_long , _bindgen_union_align : [ u64 ; 7usize ] , } # [ test ] fn bindgen_test_layout_pthread_attr_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < pthread_attr_t > ( ) , 56usize , concat ! ( "Size of: " , stringify ! ( pthread_attr_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < pthread_attr_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( pthread_attr_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const pthread_attr_t ) ) . __size as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( pthread_attr_t ) , "::" , stringify ! ( __size ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const pthread_attr_t ) ) . __align as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( pthread_attr_t ) , "::" , stringify ! ( __align ) ) ) ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union pthread_mutex_t { pub __data : __pthread_mutex_s , pub __size : [ libc :: c_char ; 40usize ] , pub __align : libc :: c_long , _bindgen_union_align : [ u64 ; 5usize ] , } # [ test ] fn bindgen_test_layout_pthread_mutex_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < pthread_mutex_t > ( ) , 40usize , concat ! ( "Size of: " , stringify ! ( pthread_mutex_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < pthread_mutex_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( pthread_mutex_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const pthread_mutex_t ) ) . __data as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( pthread_mutex_t ) , "::" , stringify ! ( __data ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const pthread_mutex_t ) ) . __size as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( pthread_mutex_t ) , "::" , stringify ! ( __size ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const pthread_mutex_t ) ) . __align as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( pthread_mutex_t ) , "::" , stringify ! ( __align ) ) ) ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union pthread_cond_t { pub __data : __pthread_cond_s , pub __size : [ libc :: c_char ; 48usize ] , pub __align : libc :: c_longlong , _bindgen_union_align : [ u64 ; 6usize ] , } # [ test ] fn bindgen_test_layout_pthread_cond_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < pthread_cond_t > ( ) , 48usize , concat ! ( "Size of: " , stringify ! ( pthread_cond_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < pthread_cond_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( pthread_cond_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const pthread_cond_t ) ) . __data as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( pthread_cond_t ) , "::" , stringify ! ( __data ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const pthread_cond_t ) ) . __size as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( pthread_cond_t ) , "::" , stringify ! ( __size ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const pthread_cond_t ) ) . __align as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( pthread_cond_t ) , "::" , stringify ! ( __align ) ) ) ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union pthread_rwlock_t { pub __data : __pthread_rwlock_arch_t , pub __size : [ libc :: c_char ; 56usize ] , pub __align : libc :: c_long , _bindgen_union_align : [ u64 ; 7usize ] , } # [ test ] fn bindgen_test_layout_pthread_rwlock_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < pthread_rwlock_t > ( ) , 56usize , concat ! ( "Size of: " , stringify ! ( pthread_rwlock_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < pthread_rwlock_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( pthread_rwlock_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const pthread_rwlock_t ) ) . __data as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( pthread_rwlock_t ) , "::" , stringify ! ( __data ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const pthread_rwlock_t ) ) . __size as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( pthread_rwlock_t ) , "::" , stringify ! ( __size ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const pthread_rwlock_t ) ) . __align as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( pthread_rwlock_t ) , "::" , stringify ! ( __align ) ) ) ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union pthread_rwlockattr_t { pub __size : [ libc :: c_char ; 8usize ] , pub __align : libc :: c_long , _bindgen_union_align : u64 , } # [ test ] fn bindgen_test_layout_pthread_rwlockattr_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < pthread_rwlockattr_t > ( ) , 8usize , concat ! ( "Size of: " , stringify ! ( pthread_rwlockattr_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < pthread_rwlockattr_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( pthread_rwlockattr_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const pthread_rwlockattr_t ) ) . __size as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( pthread_rwlockattr_t ) , "::" , stringify ! ( __size ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const pthread_rwlockattr_t ) ) . __align as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( pthread_rwlockattr_t ) , "::" , stringify ! ( __align ) ) ) ; } pub type pthread_spinlock_t = libc :: c_int ; # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union pthread_barrier_t { pub __size : [ libc :: c_char ; 32usize ] , pub __align : libc :: c_long , _bindgen_union_align : [ u64 ; 4usize ] , } # [ test ] fn bindgen_test_layout_pthread_barrier_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < pthread_barrier_t > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( pthread_barrier_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < pthread_barrier_t > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( pthread_barrier_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const pthread_barrier_t ) ) . __size as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( pthread_barrier_t ) , "::" , stringify ! ( __size ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const pthread_barrier_t ) ) . __align as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( pthread_barrier_t ) , "::" , stringify ! ( __align ) ) ) ; } # [ repr ( C ) ] # [ derive ( Copy , Clone ) ] pub union pthread_barrierattr_t { pub __size : [ libc :: c_char ; 4usize ] , pub __align : libc :: c_int , _bindgen_union_align : u32 , } # [ test ] fn bindgen_test_layout_pthread_barrierattr_t ( ) { assert_eq ! ( :: std :: mem :: size_of :: < pthread_barrierattr_t > ( ) , 4usize , concat ! ( "Size of: " , stringify ! ( pthread_barrierattr_t ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < pthread_barrierattr_t > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( pthread_barrierattr_t ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const pthread_barrierattr_t ) ) . __size as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( pthread_barrierattr_t ) , "::" , stringify ! ( __size ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const pthread_barrierattr_t ) ) . __align as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( pthread_barrierattr_t ) , "::" , stringify ! ( __align ) ) ) ; } extern "C" {
 pub fn random ( ) -> libc :: c_long ; 
} extern "C" {
 pub fn srandom ( __seed : libc :: c_uint , ) ; 
} extern "C" {
 pub fn initstate ( __seed : libc :: c_uint , __statebuf : * mut libc :: c_char , __statelen : usize , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn setstate ( __statebuf : * mut libc :: c_char , ) -> * mut libc :: c_char ; 
} # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct random_data { pub fptr : * mut i32 , pub rptr : * mut i32 , pub state : * mut i32 , pub rand_type : libc :: c_int , pub rand_deg : libc :: c_int , pub rand_sep : libc :: c_int , pub end_ptr : * mut i32 , } # [ test ] fn bindgen_test_layout_random_data ( ) { assert_eq ! ( :: std :: mem :: size_of :: < random_data > ( ) , 48usize , concat ! ( "Size of: " , stringify ! ( random_data ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < random_data > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( random_data ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const random_data ) ) . fptr as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( random_data ) , "::" , stringify ! ( fptr ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const random_data ) ) . rptr as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( random_data ) , "::" , stringify ! ( rptr ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const random_data ) ) . state as * const _ as usize } , 16usize , concat ! ( "Alignment of field: " , stringify ! ( random_data ) , "::" , stringify ! ( state ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const random_data ) ) . rand_type as * const _ as usize } , 24usize , concat ! ( "Alignment of field: " , stringify ! ( random_data ) , "::" , stringify ! ( rand_type ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const random_data ) ) . rand_deg as * const _ as usize } , 28usize , concat ! ( "Alignment of field: " , stringify ! ( random_data ) , "::" , stringify ! ( rand_deg ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const random_data ) ) . rand_sep as * const _ as usize } , 32usize , concat ! ( "Alignment of field: " , stringify ! ( random_data ) , "::" , stringify ! ( rand_sep ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const random_data ) ) . end_ptr as * const _ as usize } , 40usize , concat ! ( "Alignment of field: " , stringify ! ( random_data ) , "::" , stringify ! ( end_ptr ) ) ) ; } extern "C" {
 pub fn random_r ( __buf : * mut random_data , __result : * mut i32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn srandom_r ( __seed : libc :: c_uint , __buf : * mut random_data , ) -> libc :: c_int ; 
} extern "C" {
 pub fn initstate_r ( __seed : libc :: c_uint , __statebuf : * mut libc :: c_char , __statelen : usize , __buf : * mut random_data , ) -> libc :: c_int ; 
} extern "C" {
 pub fn setstate_r ( __statebuf : * mut libc :: c_char , __buf : * mut random_data , ) -> libc :: c_int ; 
} extern "C" {
 pub fn rand ( ) -> libc :: c_int ; 
} extern "C" {
 pub fn srand ( __seed : libc :: c_uint , ) ; 
} extern "C" {
 pub fn rand_r ( __seed : * mut libc :: c_uint , ) -> libc :: c_int ; 
} extern "C" {
 pub fn drand48 ( ) -> f64 ; 
} extern "C" {
 pub fn erand48 ( __xsubi : * mut libc :: c_ushort , ) -> f64 ; 
} extern "C" {
 pub fn lrand48 ( ) -> libc :: c_long ; 
} extern "C" {
 pub fn nrand48 ( __xsubi : * mut libc :: c_ushort , ) -> libc :: c_long ; 
} extern "C" {
 pub fn mrand48 ( ) -> libc :: c_long ; 
} extern "C" {
 pub fn jrand48 ( __xsubi : * mut libc :: c_ushort , ) -> libc :: c_long ; 
} extern "C" {
 pub fn srand48 ( __seedval : libc :: c_long , ) ; 
} extern "C" {
 pub fn seed48 ( __seed16v : * mut libc :: c_ushort , ) -> * mut libc :: c_ushort ; 
} extern "C" {
 pub fn lcong48 ( __param : * mut libc :: c_ushort , ) ; 
} # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct drand48_data { pub __x : [ libc :: c_ushort ; 3usize ] , pub __old_x : [ libc :: c_ushort ; 3usize ] , pub __c : libc :: c_ushort , pub __init : libc :: c_ushort , pub __a : libc :: c_ulonglong , } # [ test ] fn bindgen_test_layout_drand48_data ( ) { assert_eq ! ( :: std :: mem :: size_of :: < drand48_data > ( ) , 24usize , concat ! ( "Size of: " , stringify ! ( drand48_data ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < drand48_data > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( drand48_data ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const drand48_data ) ) . __x as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( drand48_data ) , "::" , stringify ! ( __x ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const drand48_data ) ) . __old_x as * const _ as usize } , 6usize , concat ! ( "Alignment of field: " , stringify ! ( drand48_data ) , "::" , stringify ! ( __old_x ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const drand48_data ) ) . __c as * const _ as usize } , 12usize , concat ! ( "Alignment of field: " , stringify ! ( drand48_data ) , "::" , stringify ! ( __c ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const drand48_data ) ) . __init as * const _ as usize } , 14usize , concat ! ( "Alignment of field: " , stringify ! ( drand48_data ) , "::" , stringify ! ( __init ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const drand48_data ) ) . __a as * const _ as usize } , 16usize , concat ! ( "Alignment of field: " , stringify ! ( drand48_data ) , "::" , stringify ! ( __a ) ) ) ; } extern "C" {
 pub fn drand48_r ( __buffer : * mut drand48_data , __result : * mut f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn erand48_r ( __xsubi : * mut libc :: c_ushort , __buffer : * mut drand48_data , __result : * mut f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn lrand48_r ( __buffer : * mut drand48_data , __result : * mut libc :: c_long , ) -> libc :: c_int ; 
} extern "C" {
 pub fn nrand48_r ( __xsubi : * mut libc :: c_ushort , __buffer : * mut drand48_data , __result : * mut libc :: c_long , ) -> libc :: c_int ; 
} extern "C" {
 pub fn mrand48_r ( __buffer : * mut drand48_data , __result : * mut libc :: c_long , ) -> libc :: c_int ; 
} extern "C" {
 pub fn jrand48_r ( __xsubi : * mut libc :: c_ushort , __buffer : * mut drand48_data , __result : * mut libc :: c_long , ) -> libc :: c_int ; 
} extern "C" {
 pub fn srand48_r ( __seedval : libc :: c_long , __buffer : * mut drand48_data , ) -> libc :: c_int ; 
} extern "C" {
 pub fn seed48_r ( __seed16v : * mut libc :: c_ushort , __buffer : * mut drand48_data , ) -> libc :: c_int ; 
} extern "C" {
 pub fn lcong48_r ( __param : * mut libc :: c_ushort , __buffer : * mut drand48_data , ) -> libc :: c_int ; 
} extern "C" {
 pub fn malloc ( __size : usize , ) -> * mut libc :: c_void ; 
} extern "C" {
 pub fn calloc ( __nmemb : usize , __size : usize , ) -> * mut libc :: c_void ; 
} extern "C" {
 pub fn realloc ( __ptr : * mut libc :: c_void , __size : usize , ) -> * mut libc :: c_void ; 
} extern "C" {
 pub fn reallocarray ( __ptr : * mut libc :: c_void , __nmemb : usize , __size : usize , ) -> * mut libc :: c_void ; 
} extern "C" {
 pub fn free ( __ptr : * mut libc :: c_void , ) ; 
} extern "C" {
 pub fn alloca ( __size : usize , ) -> * mut libc :: c_void ; 
} extern "C" {
 pub fn valloc ( __size : usize , ) -> * mut libc :: c_void ; 
} extern "C" {
 pub fn posix_memalign ( __memptr : * mut * mut libc :: c_void , __alignment : usize , __size : usize , ) -> libc :: c_int ; 
} extern "C" {
 pub fn aligned_alloc ( __alignment : usize , __size : usize , ) -> * mut libc :: c_void ; 
} extern "C" {
 pub fn abort ( ) ; 
} extern "C" {
 pub fn atexit ( __func : :: std :: option :: Option < unsafe extern "C" fn ( ) > , ) -> libc :: c_int ; 
} extern "C" {
 pub fn at_quick_exit ( __func : :: std :: option :: Option < unsafe extern "C" fn ( ) > , ) -> libc :: c_int ; 
} extern "C" {
 pub fn on_exit ( __func : :: std :: option :: Option < unsafe extern "C" fn ( __status : libc :: c_int , __arg : * mut libc :: c_void ) > , __arg : * mut libc :: c_void , ) -> libc :: c_int ; 
} extern "C" {
 pub fn exit ( __status : libc :: c_int , ) ; 
} extern "C" {
 pub fn quick_exit ( __status : libc :: c_int , ) ; 
} extern "C" {
 pub fn _Exit ( __status : libc :: c_int , ) ; 
} extern "C" {
 pub fn getenv ( __name : * const libc :: c_char , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn secure_getenv ( __name : * const libc :: c_char , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn putenv ( __string : * mut libc :: c_char , ) -> libc :: c_int ; 
} extern "C" {
 pub fn setenv ( __name : * const libc :: c_char , __value : * const libc :: c_char , __replace : libc :: c_int , ) -> libc :: c_int ; 
} extern "C" {
 pub fn unsetenv ( __name : * const libc :: c_char , ) -> libc :: c_int ; 
} extern "C" {
 pub fn clearenv ( ) -> libc :: c_int ; 
} extern "C" {
 pub fn mktemp ( __template : * mut libc :: c_char , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn mkstemp ( __template : * mut libc :: c_char , ) -> libc :: c_int ; 
} extern "C" {
 pub fn mkstemp64 ( __template : * mut libc :: c_char , ) -> libc :: c_int ; 
} extern "C" {
 pub fn mkstemps ( __template : * mut libc :: c_char , __suffixlen : libc :: c_int , ) -> libc :: c_int ; 
} extern "C" {
 pub fn mkstemps64 ( __template : * mut libc :: c_char , __suffixlen : libc :: c_int , ) -> libc :: c_int ; 
} extern "C" {
 pub fn mkdtemp ( __template : * mut libc :: c_char , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn mkostemp ( __template : * mut libc :: c_char , __flags : libc :: c_int , ) -> libc :: c_int ; 
} extern "C" {
 pub fn mkostemp64 ( __template : * mut libc :: c_char , __flags : libc :: c_int , ) -> libc :: c_int ; 
} extern "C" {
 pub fn mkostemps ( __template : * mut libc :: c_char , __suffixlen : libc :: c_int , __flags : libc :: c_int , ) -> libc :: c_int ; 
} extern "C" {
 pub fn mkostemps64 ( __template : * mut libc :: c_char , __suffixlen : libc :: c_int , __flags : libc :: c_int , ) -> libc :: c_int ; 
} extern "C" {
 pub fn system ( __command : * const libc :: c_char , ) -> libc :: c_int ; 
} extern "C" {
 pub fn canonicalize_file_name ( __name : * const libc :: c_char , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn realpath ( __name : * const libc :: c_char , __resolved : * mut libc :: c_char , ) -> * mut libc :: c_char ; 
} pub type __compar_fn_t = :: std :: option :: Option < unsafe extern "C" fn ( arg1 : * const libc :: c_void , arg2 : * const libc :: c_void ) -> libc :: c_int > ; pub type comparison_fn_t = __compar_fn_t ; pub type __compar_d_fn_t = :: std :: option :: Option < unsafe extern "C" fn ( arg1 : * const libc :: c_void , arg2 : * const libc :: c_void , arg3 : * mut libc :: c_void ) -> libc :: c_int > ; extern "C" {
 pub fn bsearch ( __key : * const libc :: c_void , __base : * const libc :: c_void , __nmemb : usize , __size : usize , __compar : __compar_fn_t , ) -> * mut libc :: c_void ; 
} extern "C" {
 pub fn qsort ( __base : * mut libc :: c_void , __nmemb : usize , __size : usize , __compar : __compar_fn_t , ) ; 
} extern "C" {
 pub fn qsort_r ( __base : * mut libc :: c_void , __nmemb : usize , __size : usize , __compar : __compar_d_fn_t , __arg : * mut libc :: c_void , ) ; 
} extern "C" {
 pub fn abs ( __x : libc :: c_int , ) -> libc :: c_int ; 
} extern "C" {
 pub fn labs ( __x : libc :: c_long , ) -> libc :: c_long ; 
} extern "C" {
 pub fn llabs ( __x : libc :: c_longlong , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn div ( __numer : libc :: c_int , __denom : libc :: c_int , ) -> div_t ; 
} extern "C" {
 pub fn ldiv ( __numer : libc :: c_long , __denom : libc :: c_long , ) -> ldiv_t ; 
} extern "C" {
 pub fn lldiv ( __numer : libc :: c_longlong , __denom : libc :: c_longlong , ) -> lldiv_t ; 
} extern "C" {
 pub fn ecvt ( __value : f64 , __ndigit : libc :: c_int , __decpt : * mut libc :: c_int , __sign : * mut libc :: c_int , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn fcvt ( __value : f64 , __ndigit : libc :: c_int , __decpt : * mut libc :: c_int , __sign : * mut libc :: c_int , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn gcvt ( __value : f64 , __ndigit : libc :: c_int , __buf : * mut libc :: c_char , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn qecvt ( __value : f64 , __ndigit : libc :: c_int , __decpt : * mut libc :: c_int , __sign : * mut libc :: c_int , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn qfcvt ( __value : f64 , __ndigit : libc :: c_int , __decpt : * mut libc :: c_int , __sign : * mut libc :: c_int , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn qgcvt ( __value : f64 , __ndigit : libc :: c_int , __buf : * mut libc :: c_char , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn ecvt_r ( __value : f64 , __ndigit : libc :: c_int , __decpt : * mut libc :: c_int , __sign : * mut libc :: c_int , __buf : * mut libc :: c_char , __len : usize , ) -> libc :: c_int ; 
} extern "C" {
 pub fn fcvt_r ( __value : f64 , __ndigit : libc :: c_int , __decpt : * mut libc :: c_int , __sign : * mut libc :: c_int , __buf : * mut libc :: c_char , __len : usize , ) -> libc :: c_int ; 
} extern "C" {
 pub fn qecvt_r ( __value : f64 , __ndigit : libc :: c_int , __decpt : * mut libc :: c_int , __sign : * mut libc :: c_int , __buf : * mut libc :: c_char , __len : usize , ) -> libc :: c_int ; 
} extern "C" {
 pub fn qfcvt_r ( __value : f64 , __ndigit : libc :: c_int , __decpt : * mut libc :: c_int , __sign : * mut libc :: c_int , __buf : * mut libc :: c_char , __len : usize , ) -> libc :: c_int ; 
} extern "C" {
 pub fn mblen ( __s : * const libc :: c_char , __n : usize , ) -> libc :: c_int ; 
} extern "C" {
 pub fn mbtowc ( __pwc : * mut wchar_t , __s : * const libc :: c_char , __n : usize , ) -> libc :: c_int ; 
} extern "C" {
 pub fn wctomb ( __s : * mut libc :: c_char , __wchar : wchar_t , ) -> libc :: c_int ; 
} extern "C" {
 pub fn mbstowcs ( __pwcs : * mut wchar_t , __s : * const libc :: c_char , __n : usize , ) -> usize ; 
} extern "C" {
 pub fn wcstombs ( __s : * mut libc :: c_char , __pwcs : * const wchar_t , __n : usize , ) -> usize ; 
} extern "C" {
 pub fn rpmatch ( __response : * const libc :: c_char , ) -> libc :: c_int ; 
} extern "C" {
 pub fn getsubopt ( __optionp : * mut * mut libc :: c_char , __tokens : * const * const libc :: c_char , __valuep : * mut * mut libc :: c_char , ) -> libc :: c_int ; 
} extern "C" {
 pub fn posix_openpt ( __oflag : libc :: c_int , ) -> libc :: c_int ; 
} extern "C" {
 pub fn grantpt ( __fd : libc :: c_int , ) -> libc :: c_int ; 
} extern "C" {
 pub fn unlockpt ( __fd : libc :: c_int , ) -> libc :: c_int ; 
} extern "C" {
 pub fn ptsname ( __fd : libc :: c_int , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn ptsname_r ( __fd : libc :: c_int , __buf : * mut libc :: c_char , __buflen : usize , ) -> libc :: c_int ; 
} extern "C" {
 pub fn getpt ( ) -> libc :: c_int ; 
} extern "C" {
 pub fn getloadavg ( __loadavg : * mut f64 , __nelem : libc :: c_int , ) -> libc :: c_int ; 
} pub type int_least8_t = __int_least8_t ; pub type int_least16_t = __int_least16_t ; pub type int_least32_t = __int_least32_t ; pub type int_least64_t = __int_least64_t ; pub type uint_least8_t = __uint_least8_t ; pub type uint_least16_t = __uint_least16_t ; pub type uint_least32_t = __uint_least32_t ; pub type uint_least64_t = __uint_least64_t ; pub type int_fast8_t = libc :: c_schar ; pub type int_fast16_t = libc :: c_long ; pub type int_fast32_t = libc :: c_long ; pub type int_fast64_t = libc :: c_long ; pub type uint_fast8_t = libc :: c_uchar ; pub type uint_fast16_t = libc :: c_ulong ; pub type uint_fast32_t = libc :: c_ulong ; pub type uint_fast64_t = libc :: c_ulong ; pub type intmax_t = __intmax_t ; pub type uintmax_t = __uintmax_t ; pub type float_t = f32 ; pub type double_t = f64 ; pub const FP_INT_UPWARD : _bindgen_ty_1 = 0 ; pub const FP_INT_DOWNWARD : _bindgen_ty_1 = 1 ; pub const FP_INT_TOWARDZERO : _bindgen_ty_1 = 2 ; pub const FP_INT_TONEARESTFROMZERO : _bindgen_ty_1 = 3 ; pub const FP_INT_TONEAREST : _bindgen_ty_1 = 4 ; pub type _bindgen_ty_1 = libc :: c_uint ; extern "C" {
 pub fn __fpclassify ( __value : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __signbit ( __value : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __isinf ( __value : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __finite ( __value : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __isnan ( __value : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __iseqsig ( __x : f64 , __y : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __issignaling ( __value : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn acos ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __acos ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn asin ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __asin ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn atan ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __atan ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn atan2 ( __y : f64 , __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __atan2 ( __y : f64 , __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn cos ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __cos ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn sin ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __sin ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn tan ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __tan ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn cosh ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __cosh ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn sinh ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __sinh ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn tanh ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __tanh ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn sincos ( __x : f64 , __sinx : * mut f64 , __cosx : * mut f64 , ) ; 
} extern "C" {
 pub fn __sincos ( __x : f64 , __sinx : * mut f64 , __cosx : * mut f64 , ) ; 
} extern "C" {
 pub fn acosh ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __acosh ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn asinh ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __asinh ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn atanh ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __atanh ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn exp ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __exp ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn frexp ( __x : f64 , __exponent : * mut libc :: c_int , ) -> f64 ; 
} extern "C" {
 pub fn __frexp ( __x : f64 , __exponent : * mut libc :: c_int , ) -> f64 ; 
} extern "C" {
 pub fn ldexp ( __x : f64 , __exponent : libc :: c_int , ) -> f64 ; 
} extern "C" {
 pub fn __ldexp ( __x : f64 , __exponent : libc :: c_int , ) -> f64 ; 
} extern "C" {
 pub fn log ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __log ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn log10 ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __log10 ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn modf ( __x : f64 , __iptr : * mut f64 , ) -> f64 ; 
} extern "C" {
 pub fn __modf ( __x : f64 , __iptr : * mut f64 , ) -> f64 ; 
} extern "C" {
 pub fn exp10 ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __exp10 ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn expm1 ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __expm1 ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn log1p ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __log1p ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn logb ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __logb ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn exp2 ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __exp2 ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn log2 ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __log2 ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn pow ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __pow ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn sqrt ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __sqrt ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn hypot ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __hypot ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn cbrt ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __cbrt ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn ceil ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __ceil ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn fabs ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __fabs ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn floor ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __floor ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn fmod ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __fmod ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn isinf ( __value : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn finite ( __value : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn drem ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __drem ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn significand ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __significand ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn copysign ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __copysign ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn nan ( __tagb : * const libc :: c_char , ) -> f64 ; 
} extern "C" {
 pub fn __nan ( __tagb : * const libc :: c_char , ) -> f64 ; 
} extern "C" {
 pub fn isnan ( __value : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn j0 ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __j0 ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn j1 ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __j1 ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn jn ( arg1 : libc :: c_int , arg2 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __jn ( arg1 : libc :: c_int , arg2 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn y0 ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __y0 ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn y1 ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __y1 ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn yn ( arg1 : libc :: c_int , arg2 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __yn ( arg1 : libc :: c_int , arg2 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn erf ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __erf ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn erfc ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __erfc ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn lgamma ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __lgamma ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn tgamma ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __tgamma ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn gamma ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __gamma ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn lgamma_r ( arg1 : f64 , __signgamp : * mut libc :: c_int , ) -> f64 ; 
} extern "C" {
 pub fn __lgamma_r ( arg1 : f64 , __signgamp : * mut libc :: c_int , ) -> f64 ; 
} extern "C" {
 pub fn rint ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __rint ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn nextafter ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __nextafter ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn nexttoward ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __nexttoward ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn nextdown ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __nextdown ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn nextup ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __nextup ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn remainder ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __remainder ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn scalbn ( __x : f64 , __n : libc :: c_int , ) -> f64 ; 
} extern "C" {
 pub fn __scalbn ( __x : f64 , __n : libc :: c_int , ) -> f64 ; 
} extern "C" {
 pub fn ilogb ( __x : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __ilogb ( __x : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn llogb ( __x : f64 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn __llogb ( __x : f64 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn scalbln ( __x : f64 , __n : libc :: c_long , ) -> f64 ; 
} extern "C" {
 pub fn __scalbln ( __x : f64 , __n : libc :: c_long , ) -> f64 ; 
} extern "C" {
 pub fn nearbyint ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __nearbyint ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn round ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __round ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn trunc ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __trunc ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn remquo ( __x : f64 , __y : f64 , __quo : * mut libc :: c_int , ) -> f64 ; 
} extern "C" {
 pub fn __remquo ( __x : f64 , __y : f64 , __quo : * mut libc :: c_int , ) -> f64 ; 
} extern "C" {
 pub fn lrint ( __x : f64 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn __lrint ( __x : f64 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn llrint ( __x : f64 , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn __llrint ( __x : f64 , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn lround ( __x : f64 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn __lround ( __x : f64 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn llround ( __x : f64 , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn __llround ( __x : f64 , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn fdim ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __fdim ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn fmax ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __fmax ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn fmin ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __fmin ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn fma ( __x : f64 , __y : f64 , __z : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __fma ( __x : f64 , __y : f64 , __z : f64 , ) -> f64 ; 
} extern "C" {
 pub fn roundeven ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __roundeven ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn fromfp ( __x : f64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn __fromfp ( __x : f64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn ufromfp ( __x : f64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn __ufromfp ( __x : f64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn fromfpx ( __x : f64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn __fromfpx ( __x : f64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn ufromfpx ( __x : f64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn __ufromfpx ( __x : f64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn fmaxmag ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __fmaxmag ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn fminmag ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __fminmag ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn totalorder ( __x : f64 , __y : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn totalordermag ( __x : f64 , __y : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn canonicalize ( __cx : * mut f64 , __x : * const f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn getpayload ( __x : * const f64 , ) -> f64 ; 
} extern "C" {
 pub fn __getpayload ( __x : * const f64 , ) -> f64 ; 
} extern "C" {
 pub fn setpayload ( __x : * mut f64 , __payload : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn setpayloadsig ( __x : * mut f64 , __payload : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn scalb ( __x : f64 , __n : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __scalb ( __x : f64 , __n : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __fpclassifyf ( __value : f32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __signbitf ( __value : f32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __isinff ( __value : f32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __finitef ( __value : f32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __isnanf ( __value : f32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __iseqsigf ( __x : f32 , __y : f32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __issignalingf ( __value : f32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn acosf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __acosf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn asinf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __asinf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn atanf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __atanf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn atan2f ( __y : f32 , __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __atan2f ( __y : f32 , __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn cosf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __cosf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn sinf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __sinf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn tanf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __tanf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn coshf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __coshf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn sinhf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __sinhf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn tanhf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __tanhf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn sincosf ( __x : f32 , __sinx : * mut f32 , __cosx : * mut f32 , ) ; 
} extern "C" {
 pub fn __sincosf ( __x : f32 , __sinx : * mut f32 , __cosx : * mut f32 , ) ; 
} extern "C" {
 pub fn acoshf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __acoshf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn asinhf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __asinhf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn atanhf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __atanhf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn expf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __expf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn frexpf ( __x : f32 , __exponent : * mut libc :: c_int , ) -> f32 ; 
} extern "C" {
 pub fn __frexpf ( __x : f32 , __exponent : * mut libc :: c_int , ) -> f32 ; 
} extern "C" {
 pub fn ldexpf ( __x : f32 , __exponent : libc :: c_int , ) -> f32 ; 
} extern "C" {
 pub fn __ldexpf ( __x : f32 , __exponent : libc :: c_int , ) -> f32 ; 
} extern "C" {
 pub fn logf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __logf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn log10f ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __log10f ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn modff ( __x : f32 , __iptr : * mut f32 , ) -> f32 ; 
} extern "C" {
 pub fn __modff ( __x : f32 , __iptr : * mut f32 , ) -> f32 ; 
} extern "C" {
 pub fn exp10f ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __exp10f ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn expm1f ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __expm1f ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn log1pf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __log1pf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn logbf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __logbf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn exp2f ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __exp2f ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn log2f ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __log2f ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn powf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __powf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn sqrtf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __sqrtf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn hypotf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __hypotf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn cbrtf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __cbrtf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn ceilf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __ceilf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn fabsf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __fabsf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn floorf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __floorf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn fmodf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __fmodf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn isinff ( __value : f32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn finitef ( __value : f32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn dremf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __dremf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn significandf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __significandf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn copysignf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __copysignf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn nanf ( __tagb : * const libc :: c_char , ) -> f32 ; 
} extern "C" {
 pub fn __nanf ( __tagb : * const libc :: c_char , ) -> f32 ; 
} extern "C" {
 pub fn isnanf ( __value : f32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn j0f ( arg1 : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __j0f ( arg1 : f32 , ) -> f32 ; 
} extern "C" {
 pub fn j1f ( arg1 : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __j1f ( arg1 : f32 , ) -> f32 ; 
} extern "C" {
 pub fn jnf ( arg1 : libc :: c_int , arg2 : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __jnf ( arg1 : libc :: c_int , arg2 : f32 , ) -> f32 ; 
} extern "C" {
 pub fn y0f ( arg1 : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __y0f ( arg1 : f32 , ) -> f32 ; 
} extern "C" {
 pub fn y1f ( arg1 : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __y1f ( arg1 : f32 , ) -> f32 ; 
} extern "C" {
 pub fn ynf ( arg1 : libc :: c_int , arg2 : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __ynf ( arg1 : libc :: c_int , arg2 : f32 , ) -> f32 ; 
} extern "C" {
 pub fn erff ( arg1 : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __erff ( arg1 : f32 , ) -> f32 ; 
} extern "C" {
 pub fn erfcf ( arg1 : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __erfcf ( arg1 : f32 , ) -> f32 ; 
} extern "C" {
 pub fn lgammaf ( arg1 : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __lgammaf ( arg1 : f32 , ) -> f32 ; 
} extern "C" {
 pub fn tgammaf ( arg1 : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __tgammaf ( arg1 : f32 , ) -> f32 ; 
} extern "C" {
 pub fn gammaf ( arg1 : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __gammaf ( arg1 : f32 , ) -> f32 ; 
} extern "C" {
 pub fn lgammaf_r ( arg1 : f32 , __signgamp : * mut libc :: c_int , ) -> f32 ; 
} extern "C" {
 pub fn __lgammaf_r ( arg1 : f32 , __signgamp : * mut libc :: c_int , ) -> f32 ; 
} extern "C" {
 pub fn rintf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __rintf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn nextafterf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __nextafterf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn nexttowardf ( __x : f32 , __y : f64 , ) -> f32 ; 
} extern "C" {
 pub fn __nexttowardf ( __x : f32 , __y : f64 , ) -> f32 ; 
} extern "C" {
 pub fn nextdownf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __nextdownf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn nextupf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __nextupf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn remainderf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __remainderf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn scalbnf ( __x : f32 , __n : libc :: c_int , ) -> f32 ; 
} extern "C" {
 pub fn __scalbnf ( __x : f32 , __n : libc :: c_int , ) -> f32 ; 
} extern "C" {
 pub fn ilogbf ( __x : f32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __ilogbf ( __x : f32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn llogbf ( __x : f32 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn __llogbf ( __x : f32 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn scalblnf ( __x : f32 , __n : libc :: c_long , ) -> f32 ; 
} extern "C" {
 pub fn __scalblnf ( __x : f32 , __n : libc :: c_long , ) -> f32 ; 
} extern "C" {
 pub fn nearbyintf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __nearbyintf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn roundf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __roundf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn truncf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __truncf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn remquof ( __x : f32 , __y : f32 , __quo : * mut libc :: c_int , ) -> f32 ; 
} extern "C" {
 pub fn __remquof ( __x : f32 , __y : f32 , __quo : * mut libc :: c_int , ) -> f32 ; 
} extern "C" {
 pub fn lrintf ( __x : f32 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn __lrintf ( __x : f32 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn llrintf ( __x : f32 , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn __llrintf ( __x : f32 , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn lroundf ( __x : f32 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn __lroundf ( __x : f32 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn llroundf ( __x : f32 , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn __llroundf ( __x : f32 , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn fdimf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __fdimf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn fmaxf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __fmaxf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn fminf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __fminf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn fmaf ( __x : f32 , __y : f32 , __z : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __fmaf ( __x : f32 , __y : f32 , __z : f32 , ) -> f32 ; 
} extern "C" {
 pub fn roundevenf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __roundevenf ( __x : f32 , ) -> f32 ; 
} extern "C" {
 pub fn fromfpf ( __x : f32 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn __fromfpf ( __x : f32 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn ufromfpf ( __x : f32 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn __ufromfpf ( __x : f32 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn fromfpxf ( __x : f32 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn __fromfpxf ( __x : f32 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn ufromfpxf ( __x : f32 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn __ufromfpxf ( __x : f32 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn fmaxmagf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __fmaxmagf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn fminmagf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __fminmagf ( __x : f32 , __y : f32 , ) -> f32 ; 
} extern "C" {
 pub fn totalorderf ( __x : f32 , __y : f32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn totalordermagf ( __x : f32 , __y : f32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn canonicalizef ( __cx : * mut f32 , __x : * const f32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn getpayloadf ( __x : * const f32 , ) -> f32 ; 
} extern "C" {
 pub fn __getpayloadf ( __x : * const f32 , ) -> f32 ; 
} extern "C" {
 pub fn setpayloadf ( __x : * mut f32 , __payload : f32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn setpayloadsigf ( __x : * mut f32 , __payload : f32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn scalbf ( __x : f32 , __n : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __scalbf ( __x : f32 , __n : f32 , ) -> f32 ; 
} extern "C" {
 pub fn __fpclassifyl ( __value : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __signbitl ( __value : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __isinfl ( __value : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __finitel ( __value : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __isnanl ( __value : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __iseqsigl ( __x : f64 , __y : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __issignalingl ( __value : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn acosl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __acosl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn asinl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __asinl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn atanl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __atanl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn atan2l ( __y : f64 , __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __atan2l ( __y : f64 , __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn cosl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __cosl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn sinl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __sinl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn tanl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __tanl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn coshl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __coshl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn sinhl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __sinhl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn tanhl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __tanhl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn sincosl ( __x : f64 , __sinx : * mut f64 , __cosx : * mut f64 , ) ; 
} extern "C" {
 pub fn __sincosl ( __x : f64 , __sinx : * mut f64 , __cosx : * mut f64 , ) ; 
} extern "C" {
 pub fn acoshl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __acoshl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn asinhl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __asinhl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn atanhl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __atanhl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn expl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __expl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn frexpl ( __x : f64 , __exponent : * mut libc :: c_int , ) -> f64 ; 
} extern "C" {
 pub fn __frexpl ( __x : f64 , __exponent : * mut libc :: c_int , ) -> f64 ; 
} extern "C" {
 pub fn ldexpl ( __x : f64 , __exponent : libc :: c_int , ) -> f64 ; 
} extern "C" {
 pub fn __ldexpl ( __x : f64 , __exponent : libc :: c_int , ) -> f64 ; 
} extern "C" {
 pub fn logl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __logl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn log10l ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __log10l ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn modfl ( __x : f64 , __iptr : * mut f64 , ) -> f64 ; 
} extern "C" {
 pub fn __modfl ( __x : f64 , __iptr : * mut f64 , ) -> f64 ; 
} extern "C" {
 pub fn exp10l ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __exp10l ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn expm1l ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __expm1l ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn log1pl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __log1pl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn logbl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __logbl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn exp2l ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __exp2l ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn log2l ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __log2l ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn powl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __powl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn sqrtl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __sqrtl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn hypotl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __hypotl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn cbrtl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __cbrtl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn ceill ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __ceill ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn fabsl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __fabsl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn floorl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __floorl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn fmodl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __fmodl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn isinfl ( __value : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn finitel ( __value : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn dreml ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __dreml ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn significandl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __significandl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn copysignl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __copysignl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn nanl ( __tagb : * const libc :: c_char , ) -> f64 ; 
} extern "C" {
 pub fn __nanl ( __tagb : * const libc :: c_char , ) -> f64 ; 
} extern "C" {
 pub fn isnanl ( __value : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn j0l ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __j0l ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn j1l ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __j1l ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn jnl ( arg1 : libc :: c_int , arg2 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __jnl ( arg1 : libc :: c_int , arg2 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn y0l ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __y0l ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn y1l ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __y1l ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn ynl ( arg1 : libc :: c_int , arg2 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __ynl ( arg1 : libc :: c_int , arg2 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn erfl ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __erfl ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn erfcl ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __erfcl ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn lgammal ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __lgammal ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn tgammal ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __tgammal ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn gammal ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __gammal ( arg1 : f64 , ) -> f64 ; 
} extern "C" {
 pub fn lgammal_r ( arg1 : f64 , __signgamp : * mut libc :: c_int , ) -> f64 ; 
} extern "C" {
 pub fn __lgammal_r ( arg1 : f64 , __signgamp : * mut libc :: c_int , ) -> f64 ; 
} extern "C" {
 pub fn rintl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __rintl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn nextafterl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __nextafterl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn nexttowardl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __nexttowardl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn nextdownl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __nextdownl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn nextupl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __nextupl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn remainderl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __remainderl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn scalbnl ( __x : f64 , __n : libc :: c_int , ) -> f64 ; 
} extern "C" {
 pub fn __scalbnl ( __x : f64 , __n : libc :: c_int , ) -> f64 ; 
} extern "C" {
 pub fn ilogbl ( __x : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __ilogbl ( __x : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn llogbl ( __x : f64 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn __llogbl ( __x : f64 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn scalblnl ( __x : f64 , __n : libc :: c_long , ) -> f64 ; 
} extern "C" {
 pub fn __scalblnl ( __x : f64 , __n : libc :: c_long , ) -> f64 ; 
} extern "C" {
 pub fn nearbyintl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __nearbyintl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn roundl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __roundl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn truncl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __truncl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn remquol ( __x : f64 , __y : f64 , __quo : * mut libc :: c_int , ) -> f64 ; 
} extern "C" {
 pub fn __remquol ( __x : f64 , __y : f64 , __quo : * mut libc :: c_int , ) -> f64 ; 
} extern "C" {
 pub fn lrintl ( __x : f64 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn __lrintl ( __x : f64 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn llrintl ( __x : f64 , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn __llrintl ( __x : f64 , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn lroundl ( __x : f64 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn __lroundl ( __x : f64 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn llroundl ( __x : f64 , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn __llroundl ( __x : f64 , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn fdiml ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __fdiml ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn fmaxl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __fmaxl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn fminl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __fminl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn fmal ( __x : f64 , __y : f64 , __z : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __fmal ( __x : f64 , __y : f64 , __z : f64 , ) -> f64 ; 
} extern "C" {
 pub fn roundevenl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __roundevenl ( __x : f64 , ) -> f64 ; 
} extern "C" {
 pub fn fromfpl ( __x : f64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn __fromfpl ( __x : f64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn ufromfpl ( __x : f64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn __ufromfpl ( __x : f64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn fromfpxl ( __x : f64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn __fromfpxl ( __x : f64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn ufromfpxl ( __x : f64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn __ufromfpxl ( __x : f64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn fmaxmagl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __fmaxmagl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn fminmagl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __fminmagl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn totalorderl ( __x : f64 , __y : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn totalordermagl ( __x : f64 , __y : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn canonicalizel ( __cx : * mut f64 , __x : * const f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn getpayloadl ( __x : * const f64 , ) -> f64 ; 
} extern "C" {
 pub fn __getpayloadl ( __x : * const f64 , ) -> f64 ; 
} extern "C" {
 pub fn setpayloadl ( __x : * mut f64 , __payload : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn setpayloadsigl ( __x : * mut f64 , __payload : f64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn scalbl ( __x : f64 , __n : f64 , ) -> f64 ; 
} extern "C" {
 pub fn __scalbl ( __x : f64 , __n : f64 , ) -> f64 ; 
} extern "C" {
 pub fn acosf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __acosf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn asinf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __asinf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn atanf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __atanf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn atan2f32 ( __y : _Float32 , __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __atan2f32 ( __y : _Float32 , __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn cosf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __cosf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn sinf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __sinf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn tanf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __tanf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn coshf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __coshf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn sinhf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __sinhf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn tanhf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __tanhf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn sincosf32 ( __x : _Float32 , __sinx : * mut _Float32 , __cosx : * mut _Float32 , ) ; 
} extern "C" {
 pub fn __sincosf32 ( __x : _Float32 , __sinx : * mut _Float32 , __cosx : * mut _Float32 , ) ; 
} extern "C" {
 pub fn acoshf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __acoshf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn asinhf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __asinhf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn atanhf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __atanhf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn expf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __expf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn frexpf32 ( __x : _Float32 , __exponent : * mut libc :: c_int , ) -> _Float32 ; 
} extern "C" {
 pub fn __frexpf32 ( __x : _Float32 , __exponent : * mut libc :: c_int , ) -> _Float32 ; 
} extern "C" {
 pub fn ldexpf32 ( __x : _Float32 , __exponent : libc :: c_int , ) -> _Float32 ; 
} extern "C" {
 pub fn __ldexpf32 ( __x : _Float32 , __exponent : libc :: c_int , ) -> _Float32 ; 
} extern "C" {
 pub fn logf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __logf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn log10f32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __log10f32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn modff32 ( __x : _Float32 , __iptr : * mut _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __modff32 ( __x : _Float32 , __iptr : * mut _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn exp10f32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __exp10f32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn expm1f32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __expm1f32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn log1pf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __log1pf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn logbf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __logbf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn exp2f32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __exp2f32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn log2f32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __log2f32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn powf32 ( __x : _Float32 , __y : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __powf32 ( __x : _Float32 , __y : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn sqrtf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __sqrtf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn hypotf32 ( __x : _Float32 , __y : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __hypotf32 ( __x : _Float32 , __y : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn cbrtf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __cbrtf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn ceilf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __ceilf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn fabsf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __fabsf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn floorf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __floorf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn fmodf32 ( __x : _Float32 , __y : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __fmodf32 ( __x : _Float32 , __y : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn copysignf32 ( __x : _Float32 , __y : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __copysignf32 ( __x : _Float32 , __y : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn nanf32 ( __tagb : * const libc :: c_char , ) -> _Float32 ; 
} extern "C" {
 pub fn __nanf32 ( __tagb : * const libc :: c_char , ) -> _Float32 ; 
} extern "C" {
 pub fn j0f32 ( arg1 : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __j0f32 ( arg1 : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn j1f32 ( arg1 : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __j1f32 ( arg1 : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn jnf32 ( arg1 : libc :: c_int , arg2 : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __jnf32 ( arg1 : libc :: c_int , arg2 : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn y0f32 ( arg1 : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __y0f32 ( arg1 : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn y1f32 ( arg1 : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __y1f32 ( arg1 : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn ynf32 ( arg1 : libc :: c_int , arg2 : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __ynf32 ( arg1 : libc :: c_int , arg2 : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn erff32 ( arg1 : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __erff32 ( arg1 : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn erfcf32 ( arg1 : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __erfcf32 ( arg1 : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn lgammaf32 ( arg1 : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __lgammaf32 ( arg1 : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn tgammaf32 ( arg1 : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __tgammaf32 ( arg1 : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn lgammaf32_r ( arg1 : _Float32 , __signgamp : * mut libc :: c_int , ) -> _Float32 ; 
} extern "C" {
 pub fn __lgammaf32_r ( arg1 : _Float32 , __signgamp : * mut libc :: c_int , ) -> _Float32 ; 
} extern "C" {
 pub fn rintf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __rintf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn nextafterf32 ( __x : _Float32 , __y : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __nextafterf32 ( __x : _Float32 , __y : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn nextdownf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __nextdownf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn nextupf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __nextupf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn remainderf32 ( __x : _Float32 , __y : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __remainderf32 ( __x : _Float32 , __y : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn scalbnf32 ( __x : _Float32 , __n : libc :: c_int , ) -> _Float32 ; 
} extern "C" {
 pub fn __scalbnf32 ( __x : _Float32 , __n : libc :: c_int , ) -> _Float32 ; 
} extern "C" {
 pub fn ilogbf32 ( __x : _Float32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __ilogbf32 ( __x : _Float32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn llogbf32 ( __x : _Float32 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn __llogbf32 ( __x : _Float32 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn scalblnf32 ( __x : _Float32 , __n : libc :: c_long , ) -> _Float32 ; 
} extern "C" {
 pub fn __scalblnf32 ( __x : _Float32 , __n : libc :: c_long , ) -> _Float32 ; 
} extern "C" {
 pub fn nearbyintf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __nearbyintf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn roundf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __roundf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn truncf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __truncf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn remquof32 ( __x : _Float32 , __y : _Float32 , __quo : * mut libc :: c_int , ) -> _Float32 ; 
} extern "C" {
 pub fn __remquof32 ( __x : _Float32 , __y : _Float32 , __quo : * mut libc :: c_int , ) -> _Float32 ; 
} extern "C" {
 pub fn lrintf32 ( __x : _Float32 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn __lrintf32 ( __x : _Float32 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn llrintf32 ( __x : _Float32 , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn __llrintf32 ( __x : _Float32 , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn lroundf32 ( __x : _Float32 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn __lroundf32 ( __x : _Float32 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn llroundf32 ( __x : _Float32 , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn __llroundf32 ( __x : _Float32 , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn fdimf32 ( __x : _Float32 , __y : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __fdimf32 ( __x : _Float32 , __y : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn fmaxf32 ( __x : _Float32 , __y : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __fmaxf32 ( __x : _Float32 , __y : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn fminf32 ( __x : _Float32 , __y : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __fminf32 ( __x : _Float32 , __y : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn fmaf32 ( __x : _Float32 , __y : _Float32 , __z : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __fmaf32 ( __x : _Float32 , __y : _Float32 , __z : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn roundevenf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __roundevenf32 ( __x : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn fromfpf32 ( __x : _Float32 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn __fromfpf32 ( __x : _Float32 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn ufromfpf32 ( __x : _Float32 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn __ufromfpf32 ( __x : _Float32 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn fromfpxf32 ( __x : _Float32 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn __fromfpxf32 ( __x : _Float32 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn ufromfpxf32 ( __x : _Float32 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn __ufromfpxf32 ( __x : _Float32 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn fmaxmagf32 ( __x : _Float32 , __y : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __fmaxmagf32 ( __x : _Float32 , __y : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn fminmagf32 ( __x : _Float32 , __y : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __fminmagf32 ( __x : _Float32 , __y : _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn totalorderf32 ( __x : _Float32 , __y : _Float32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn totalordermagf32 ( __x : _Float32 , __y : _Float32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn canonicalizef32 ( __cx : * mut _Float32 , __x : * const _Float32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn getpayloadf32 ( __x : * const _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn __getpayloadf32 ( __x : * const _Float32 , ) -> _Float32 ; 
} extern "C" {
 pub fn setpayloadf32 ( __x : * mut _Float32 , __payload : _Float32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn setpayloadsigf32 ( __x : * mut _Float32 , __payload : _Float32 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn acosf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __acosf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn asinf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __asinf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn atanf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __atanf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn atan2f64 ( __y : _Float64 , __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __atan2f64 ( __y : _Float64 , __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn cosf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __cosf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn sinf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __sinf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn tanf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __tanf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn coshf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __coshf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn sinhf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __sinhf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn tanhf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __tanhf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn sincosf64 ( __x : _Float64 , __sinx : * mut _Float64 , __cosx : * mut _Float64 , ) ; 
} extern "C" {
 pub fn __sincosf64 ( __x : _Float64 , __sinx : * mut _Float64 , __cosx : * mut _Float64 , ) ; 
} extern "C" {
 pub fn acoshf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __acoshf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn asinhf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __asinhf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn atanhf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __atanhf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn expf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __expf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn frexpf64 ( __x : _Float64 , __exponent : * mut libc :: c_int , ) -> _Float64 ; 
} extern "C" {
 pub fn __frexpf64 ( __x : _Float64 , __exponent : * mut libc :: c_int , ) -> _Float64 ; 
} extern "C" {
 pub fn ldexpf64 ( __x : _Float64 , __exponent : libc :: c_int , ) -> _Float64 ; 
} extern "C" {
 pub fn __ldexpf64 ( __x : _Float64 , __exponent : libc :: c_int , ) -> _Float64 ; 
} extern "C" {
 pub fn logf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __logf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn log10f64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __log10f64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn modff64 ( __x : _Float64 , __iptr : * mut _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __modff64 ( __x : _Float64 , __iptr : * mut _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn exp10f64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __exp10f64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn expm1f64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __expm1f64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn log1pf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __log1pf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn logbf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __logbf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn exp2f64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __exp2f64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn log2f64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __log2f64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn powf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __powf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn sqrtf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __sqrtf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn hypotf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __hypotf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn cbrtf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __cbrtf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn ceilf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __ceilf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn fabsf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __fabsf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn floorf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __floorf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn fmodf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __fmodf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn copysignf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __copysignf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn nanf64 ( __tagb : * const libc :: c_char , ) -> _Float64 ; 
} extern "C" {
 pub fn __nanf64 ( __tagb : * const libc :: c_char , ) -> _Float64 ; 
} extern "C" {
 pub fn j0f64 ( arg1 : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __j0f64 ( arg1 : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn j1f64 ( arg1 : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __j1f64 ( arg1 : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn jnf64 ( arg1 : libc :: c_int , arg2 : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __jnf64 ( arg1 : libc :: c_int , arg2 : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn y0f64 ( arg1 : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __y0f64 ( arg1 : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn y1f64 ( arg1 : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __y1f64 ( arg1 : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn ynf64 ( arg1 : libc :: c_int , arg2 : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __ynf64 ( arg1 : libc :: c_int , arg2 : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn erff64 ( arg1 : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __erff64 ( arg1 : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn erfcf64 ( arg1 : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __erfcf64 ( arg1 : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn lgammaf64 ( arg1 : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __lgammaf64 ( arg1 : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn tgammaf64 ( arg1 : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __tgammaf64 ( arg1 : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn lgammaf64_r ( arg1 : _Float64 , __signgamp : * mut libc :: c_int , ) -> _Float64 ; 
} extern "C" {
 pub fn __lgammaf64_r ( arg1 : _Float64 , __signgamp : * mut libc :: c_int , ) -> _Float64 ; 
} extern "C" {
 pub fn rintf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __rintf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn nextafterf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __nextafterf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn nextdownf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __nextdownf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn nextupf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __nextupf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn remainderf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __remainderf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn scalbnf64 ( __x : _Float64 , __n : libc :: c_int , ) -> _Float64 ; 
} extern "C" {
 pub fn __scalbnf64 ( __x : _Float64 , __n : libc :: c_int , ) -> _Float64 ; 
} extern "C" {
 pub fn ilogbf64 ( __x : _Float64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __ilogbf64 ( __x : _Float64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn llogbf64 ( __x : _Float64 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn __llogbf64 ( __x : _Float64 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn scalblnf64 ( __x : _Float64 , __n : libc :: c_long , ) -> _Float64 ; 
} extern "C" {
 pub fn __scalblnf64 ( __x : _Float64 , __n : libc :: c_long , ) -> _Float64 ; 
} extern "C" {
 pub fn nearbyintf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __nearbyintf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn roundf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __roundf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn truncf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __truncf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn remquof64 ( __x : _Float64 , __y : _Float64 , __quo : * mut libc :: c_int , ) -> _Float64 ; 
} extern "C" {
 pub fn __remquof64 ( __x : _Float64 , __y : _Float64 , __quo : * mut libc :: c_int , ) -> _Float64 ; 
} extern "C" {
 pub fn lrintf64 ( __x : _Float64 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn __lrintf64 ( __x : _Float64 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn llrintf64 ( __x : _Float64 , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn __llrintf64 ( __x : _Float64 , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn lroundf64 ( __x : _Float64 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn __lroundf64 ( __x : _Float64 , ) -> libc :: c_long ; 
} extern "C" {
 pub fn llroundf64 ( __x : _Float64 , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn __llroundf64 ( __x : _Float64 , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn fdimf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __fdimf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn fmaxf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __fmaxf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn fminf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __fminf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn fmaf64 ( __x : _Float64 , __y : _Float64 , __z : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __fmaf64 ( __x : _Float64 , __y : _Float64 , __z : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn roundevenf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __roundevenf64 ( __x : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn fromfpf64 ( __x : _Float64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn __fromfpf64 ( __x : _Float64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn ufromfpf64 ( __x : _Float64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn __ufromfpf64 ( __x : _Float64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn fromfpxf64 ( __x : _Float64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn __fromfpxf64 ( __x : _Float64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn ufromfpxf64 ( __x : _Float64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn __ufromfpxf64 ( __x : _Float64 , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn fmaxmagf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __fmaxmagf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn fminmagf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __fminmagf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn totalorderf64 ( __x : _Float64 , __y : _Float64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn totalordermagf64 ( __x : _Float64 , __y : _Float64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn canonicalizef64 ( __cx : * mut _Float64 , __x : * const _Float64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn getpayloadf64 ( __x : * const _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn __getpayloadf64 ( __x : * const _Float64 , ) -> _Float64 ; 
} extern "C" {
 pub fn setpayloadf64 ( __x : * mut _Float64 , __payload : _Float64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn setpayloadsigf64 ( __x : * mut _Float64 , __payload : _Float64 , ) -> libc :: c_int ; 
} extern "C" {
 pub fn acosf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __acosf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn asinf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __asinf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn atanf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __atanf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn atan2f32x ( __y : _Float32x , __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __atan2f32x ( __y : _Float32x , __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn cosf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __cosf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn sinf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __sinf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn tanf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __tanf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn coshf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __coshf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn sinhf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __sinhf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn tanhf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __tanhf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn sincosf32x ( __x : _Float32x , __sinx : * mut _Float32x , __cosx : * mut _Float32x , ) ; 
} extern "C" {
 pub fn __sincosf32x ( __x : _Float32x , __sinx : * mut _Float32x , __cosx : * mut _Float32x , ) ; 
} extern "C" {
 pub fn acoshf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __acoshf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn asinhf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __asinhf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn atanhf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __atanhf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn expf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __expf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn frexpf32x ( __x : _Float32x , __exponent : * mut libc :: c_int , ) -> _Float32x ; 
} extern "C" {
 pub fn __frexpf32x ( __x : _Float32x , __exponent : * mut libc :: c_int , ) -> _Float32x ; 
} extern "C" {
 pub fn ldexpf32x ( __x : _Float32x , __exponent : libc :: c_int , ) -> _Float32x ; 
} extern "C" {
 pub fn __ldexpf32x ( __x : _Float32x , __exponent : libc :: c_int , ) -> _Float32x ; 
} extern "C" {
 pub fn logf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __logf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn log10f32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __log10f32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn modff32x ( __x : _Float32x , __iptr : * mut _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __modff32x ( __x : _Float32x , __iptr : * mut _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn exp10f32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __exp10f32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn expm1f32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __expm1f32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn log1pf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __log1pf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn logbf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __logbf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn exp2f32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __exp2f32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn log2f32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __log2f32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn powf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __powf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn sqrtf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __sqrtf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn hypotf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __hypotf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn cbrtf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __cbrtf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn ceilf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __ceilf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn fabsf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __fabsf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn floorf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __floorf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn fmodf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __fmodf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn copysignf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __copysignf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn nanf32x ( __tagb : * const libc :: c_char , ) -> _Float32x ; 
} extern "C" {
 pub fn __nanf32x ( __tagb : * const libc :: c_char , ) -> _Float32x ; 
} extern "C" {
 pub fn j0f32x ( arg1 : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __j0f32x ( arg1 : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn j1f32x ( arg1 : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __j1f32x ( arg1 : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn jnf32x ( arg1 : libc :: c_int , arg2 : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __jnf32x ( arg1 : libc :: c_int , arg2 : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn y0f32x ( arg1 : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __y0f32x ( arg1 : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn y1f32x ( arg1 : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __y1f32x ( arg1 : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn ynf32x ( arg1 : libc :: c_int , arg2 : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __ynf32x ( arg1 : libc :: c_int , arg2 : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn erff32x ( arg1 : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __erff32x ( arg1 : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn erfcf32x ( arg1 : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __erfcf32x ( arg1 : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn lgammaf32x ( arg1 : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __lgammaf32x ( arg1 : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn tgammaf32x ( arg1 : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __tgammaf32x ( arg1 : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn lgammaf32x_r ( arg1 : _Float32x , __signgamp : * mut libc :: c_int , ) -> _Float32x ; 
} extern "C" {
 pub fn __lgammaf32x_r ( arg1 : _Float32x , __signgamp : * mut libc :: c_int , ) -> _Float32x ; 
} extern "C" {
 pub fn rintf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __rintf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn nextafterf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __nextafterf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn nextdownf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __nextdownf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn nextupf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __nextupf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn remainderf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __remainderf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn scalbnf32x ( __x : _Float32x , __n : libc :: c_int , ) -> _Float32x ; 
} extern "C" {
 pub fn __scalbnf32x ( __x : _Float32x , __n : libc :: c_int , ) -> _Float32x ; 
} extern "C" {
 pub fn ilogbf32x ( __x : _Float32x , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __ilogbf32x ( __x : _Float32x , ) -> libc :: c_int ; 
} extern "C" {
 pub fn llogbf32x ( __x : _Float32x , ) -> libc :: c_long ; 
} extern "C" {
 pub fn __llogbf32x ( __x : _Float32x , ) -> libc :: c_long ; 
} extern "C" {
 pub fn scalblnf32x ( __x : _Float32x , __n : libc :: c_long , ) -> _Float32x ; 
} extern "C" {
 pub fn __scalblnf32x ( __x : _Float32x , __n : libc :: c_long , ) -> _Float32x ; 
} extern "C" {
 pub fn nearbyintf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __nearbyintf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn roundf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __roundf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn truncf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __truncf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn remquof32x ( __x : _Float32x , __y : _Float32x , __quo : * mut libc :: c_int , ) -> _Float32x ; 
} extern "C" {
 pub fn __remquof32x ( __x : _Float32x , __y : _Float32x , __quo : * mut libc :: c_int , ) -> _Float32x ; 
} extern "C" {
 pub fn lrintf32x ( __x : _Float32x , ) -> libc :: c_long ; 
} extern "C" {
 pub fn __lrintf32x ( __x : _Float32x , ) -> libc :: c_long ; 
} extern "C" {
 pub fn llrintf32x ( __x : _Float32x , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn __llrintf32x ( __x : _Float32x , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn lroundf32x ( __x : _Float32x , ) -> libc :: c_long ; 
} extern "C" {
 pub fn __lroundf32x ( __x : _Float32x , ) -> libc :: c_long ; 
} extern "C" {
 pub fn llroundf32x ( __x : _Float32x , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn __llroundf32x ( __x : _Float32x , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn fdimf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __fdimf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn fmaxf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __fmaxf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn fminf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __fminf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn fmaf32x ( __x : _Float32x , __y : _Float32x , __z : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __fmaf32x ( __x : _Float32x , __y : _Float32x , __z : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn roundevenf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __roundevenf32x ( __x : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn fromfpf32x ( __x : _Float32x , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn __fromfpf32x ( __x : _Float32x , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn ufromfpf32x ( __x : _Float32x , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn __ufromfpf32x ( __x : _Float32x , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn fromfpxf32x ( __x : _Float32x , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn __fromfpxf32x ( __x : _Float32x , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn ufromfpxf32x ( __x : _Float32x , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn __ufromfpxf32x ( __x : _Float32x , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn fmaxmagf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __fmaxmagf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn fminmagf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __fminmagf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn totalorderf32x ( __x : _Float32x , __y : _Float32x , ) -> libc :: c_int ; 
} extern "C" {
 pub fn totalordermagf32x ( __x : _Float32x , __y : _Float32x , ) -> libc :: c_int ; 
} extern "C" {
 pub fn canonicalizef32x ( __cx : * mut _Float32x , __x : * const _Float32x , ) -> libc :: c_int ; 
} extern "C" {
 pub fn getpayloadf32x ( __x : * const _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn __getpayloadf32x ( __x : * const _Float32x , ) -> _Float32x ; 
} extern "C" {
 pub fn setpayloadf32x ( __x : * mut _Float32x , __payload : _Float32x , ) -> libc :: c_int ; 
} extern "C" {
 pub fn setpayloadsigf32x ( __x : * mut _Float32x , __payload : _Float32x , ) -> libc :: c_int ; 
} extern "C" {
 pub fn acosf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __acosf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn asinf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __asinf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn atanf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __atanf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn atan2f64x ( __y : _Float64x , __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __atan2f64x ( __y : _Float64x , __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn cosf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __cosf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn sinf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __sinf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn tanf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __tanf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn coshf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __coshf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn sinhf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __sinhf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn tanhf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __tanhf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn sincosf64x ( __x : _Float64x , __sinx : * mut _Float64x , __cosx : * mut _Float64x , ) ; 
} extern "C" {
 pub fn __sincosf64x ( __x : _Float64x , __sinx : * mut _Float64x , __cosx : * mut _Float64x , ) ; 
} extern "C" {
 pub fn acoshf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __acoshf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn asinhf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __asinhf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn atanhf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __atanhf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn expf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __expf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn frexpf64x ( __x : _Float64x , __exponent : * mut libc :: c_int , ) -> _Float64x ; 
} extern "C" {
 pub fn __frexpf64x ( __x : _Float64x , __exponent : * mut libc :: c_int , ) -> _Float64x ; 
} extern "C" {
 pub fn ldexpf64x ( __x : _Float64x , __exponent : libc :: c_int , ) -> _Float64x ; 
} extern "C" {
 pub fn __ldexpf64x ( __x : _Float64x , __exponent : libc :: c_int , ) -> _Float64x ; 
} extern "C" {
 pub fn logf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __logf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn log10f64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __log10f64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn modff64x ( __x : _Float64x , __iptr : * mut _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __modff64x ( __x : _Float64x , __iptr : * mut _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn exp10f64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __exp10f64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn expm1f64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __expm1f64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn log1pf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __log1pf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn logbf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __logbf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn exp2f64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __exp2f64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn log2f64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __log2f64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn powf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __powf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn sqrtf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __sqrtf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn hypotf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __hypotf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn cbrtf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __cbrtf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn ceilf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __ceilf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn fabsf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __fabsf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn floorf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __floorf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn fmodf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __fmodf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn copysignf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __copysignf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn nanf64x ( __tagb : * const libc :: c_char , ) -> _Float64x ; 
} extern "C" {
 pub fn __nanf64x ( __tagb : * const libc :: c_char , ) -> _Float64x ; 
} extern "C" {
 pub fn j0f64x ( arg1 : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __j0f64x ( arg1 : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn j1f64x ( arg1 : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __j1f64x ( arg1 : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn jnf64x ( arg1 : libc :: c_int , arg2 : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __jnf64x ( arg1 : libc :: c_int , arg2 : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn y0f64x ( arg1 : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __y0f64x ( arg1 : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn y1f64x ( arg1 : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __y1f64x ( arg1 : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn ynf64x ( arg1 : libc :: c_int , arg2 : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __ynf64x ( arg1 : libc :: c_int , arg2 : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn erff64x ( arg1 : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __erff64x ( arg1 : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn erfcf64x ( arg1 : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __erfcf64x ( arg1 : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn lgammaf64x ( arg1 : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __lgammaf64x ( arg1 : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn tgammaf64x ( arg1 : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __tgammaf64x ( arg1 : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn lgammaf64x_r ( arg1 : _Float64x , __signgamp : * mut libc :: c_int , ) -> _Float64x ; 
} extern "C" {
 pub fn __lgammaf64x_r ( arg1 : _Float64x , __signgamp : * mut libc :: c_int , ) -> _Float64x ; 
} extern "C" {
 pub fn rintf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __rintf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn nextafterf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __nextafterf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn nextdownf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __nextdownf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn nextupf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __nextupf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn remainderf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __remainderf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn scalbnf64x ( __x : _Float64x , __n : libc :: c_int , ) -> _Float64x ; 
} extern "C" {
 pub fn __scalbnf64x ( __x : _Float64x , __n : libc :: c_int , ) -> _Float64x ; 
} extern "C" {
 pub fn ilogbf64x ( __x : _Float64x , ) -> libc :: c_int ; 
} extern "C" {
 pub fn __ilogbf64x ( __x : _Float64x , ) -> libc :: c_int ; 
} extern "C" {
 pub fn llogbf64x ( __x : _Float64x , ) -> libc :: c_long ; 
} extern "C" {
 pub fn __llogbf64x ( __x : _Float64x , ) -> libc :: c_long ; 
} extern "C" {
 pub fn scalblnf64x ( __x : _Float64x , __n : libc :: c_long , ) -> _Float64x ; 
} extern "C" {
 pub fn __scalblnf64x ( __x : _Float64x , __n : libc :: c_long , ) -> _Float64x ; 
} extern "C" {
 pub fn nearbyintf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __nearbyintf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn roundf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __roundf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn truncf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __truncf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn remquof64x ( __x : _Float64x , __y : _Float64x , __quo : * mut libc :: c_int , ) -> _Float64x ; 
} extern "C" {
 pub fn __remquof64x ( __x : _Float64x , __y : _Float64x , __quo : * mut libc :: c_int , ) -> _Float64x ; 
} extern "C" {
 pub fn lrintf64x ( __x : _Float64x , ) -> libc :: c_long ; 
} extern "C" {
 pub fn __lrintf64x ( __x : _Float64x , ) -> libc :: c_long ; 
} extern "C" {
 pub fn llrintf64x ( __x : _Float64x , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn __llrintf64x ( __x : _Float64x , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn lroundf64x ( __x : _Float64x , ) -> libc :: c_long ; 
} extern "C" {
 pub fn __lroundf64x ( __x : _Float64x , ) -> libc :: c_long ; 
} extern "C" {
 pub fn llroundf64x ( __x : _Float64x , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn __llroundf64x ( __x : _Float64x , ) -> libc :: c_longlong ; 
} extern "C" {
 pub fn fdimf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __fdimf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn fmaxf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __fmaxf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn fminf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __fminf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn fmaf64x ( __x : _Float64x , __y : _Float64x , __z : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __fmaf64x ( __x : _Float64x , __y : _Float64x , __z : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn roundevenf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __roundevenf64x ( __x : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn fromfpf64x ( __x : _Float64x , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn __fromfpf64x ( __x : _Float64x , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn ufromfpf64x ( __x : _Float64x , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn __ufromfpf64x ( __x : _Float64x , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn fromfpxf64x ( __x : _Float64x , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn __fromfpxf64x ( __x : _Float64x , __round : libc :: c_int , __width : libc :: c_uint , ) -> __intmax_t ; 
} extern "C" {
 pub fn ufromfpxf64x ( __x : _Float64x , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn __ufromfpxf64x ( __x : _Float64x , __round : libc :: c_int , __width : libc :: c_uint , ) -> __uintmax_t ; 
} extern "C" {
 pub fn fmaxmagf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __fmaxmagf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn fminmagf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __fminmagf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn totalorderf64x ( __x : _Float64x , __y : _Float64x , ) -> libc :: c_int ; 
} extern "C" {
 pub fn totalordermagf64x ( __x : _Float64x , __y : _Float64x , ) -> libc :: c_int ; 
} extern "C" {
 pub fn canonicalizef64x ( __cx : * mut _Float64x , __x : * const _Float64x , ) -> libc :: c_int ; 
} extern "C" {
 pub fn getpayloadf64x ( __x : * const _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn __getpayloadf64x ( __x : * const _Float64x , ) -> _Float64x ; 
} extern "C" {
 pub fn setpayloadf64x ( __x : * mut _Float64x , __payload : _Float64x , ) -> libc :: c_int ; 
} extern "C" {
 pub fn setpayloadsigf64x ( __x : * mut _Float64x , __payload : _Float64x , ) -> libc :: c_int ; 
} extern "C" {
 pub fn fadd ( __x : f64 , __y : f64 , ) -> f32 ; 
} extern "C" {
 pub fn fdiv ( __x : f64 , __y : f64 , ) -> f32 ; 
} extern "C" {
 pub fn fmul ( __x : f64 , __y : f64 , ) -> f32 ; 
} extern "C" {
 pub fn fsub ( __x : f64 , __y : f64 , ) -> f32 ; 
} extern "C" {
 pub fn faddl ( __x : f64 , __y : f64 , ) -> f32 ; 
} extern "C" {
 pub fn fdivl ( __x : f64 , __y : f64 , ) -> f32 ; 
} extern "C" {
 pub fn fmull ( __x : f64 , __y : f64 , ) -> f32 ; 
} extern "C" {
 pub fn fsubl ( __x : f64 , __y : f64 , ) -> f32 ; 
} extern "C" {
 pub fn daddl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn ddivl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn dmull ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn dsubl ( __x : f64 , __y : f64 , ) -> f64 ; 
} extern "C" {
 pub fn f32addf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32 ; 
} extern "C" {
 pub fn f32divf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32 ; 
} extern "C" {
 pub fn f32mulf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32 ; 
} extern "C" {
 pub fn f32subf32x ( __x : _Float32x , __y : _Float32x , ) -> _Float32 ; 
} extern "C" {
 pub fn f32addf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float32 ; 
} extern "C" {
 pub fn f32divf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float32 ; 
} extern "C" {
 pub fn f32mulf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float32 ; 
} extern "C" {
 pub fn f32subf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float32 ; 
} extern "C" {
 pub fn f32addf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float32 ; 
} extern "C" {
 pub fn f32divf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float32 ; 
} extern "C" {
 pub fn f32mulf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float32 ; 
} extern "C" {
 pub fn f32subf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float32 ; 
} extern "C" {
 pub fn f32xaddf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float32x ; 
} extern "C" {
 pub fn f32xdivf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float32x ; 
} extern "C" {
 pub fn f32xmulf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float32x ; 
} extern "C" {
 pub fn f32xsubf64 ( __x : _Float64 , __y : _Float64 , ) -> _Float32x ; 
} extern "C" {
 pub fn f32xaddf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float32x ; 
} extern "C" {
 pub fn f32xdivf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float32x ; 
} extern "C" {
 pub fn f32xmulf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float32x ; 
} extern "C" {
 pub fn f32xsubf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float32x ; 
} extern "C" {
 pub fn f64addf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64 ; 
} extern "C" {
 pub fn f64divf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64 ; 
} extern "C" {
 pub fn f64mulf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64 ; 
} extern "C" {
 pub fn f64subf64x ( __x : _Float64x , __y : _Float64x , ) -> _Float64 ; 
} extern "C" {
 # [ link_name = "\u{1}signgam" ] 
 pub static mut  signgam  :  libc :: c_int ;
} pub const FP_NAN : _bindgen_ty_2 = 0 ; pub const FP_INFINITE : _bindgen_ty_2 = 1 ; pub const FP_ZERO : _bindgen_ty_2 = 2 ; pub const FP_SUBNORMAL : _bindgen_ty_2 = 3 ; pub const FP_NORMAL : _bindgen_ty_2 = 4 ; pub type _bindgen_ty_2 = libc :: c_uint ; extern "C" {
 pub fn __iscanonicall ( __x : f64 , ) -> libc :: c_int ; 
} # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct timex { pub modes : libc :: c_uint , pub offset : __syscall_slong_t , pub freq : __syscall_slong_t , pub maxerror : __syscall_slong_t , pub esterror : __syscall_slong_t , pub status : libc :: c_int , pub constant : __syscall_slong_t , pub precision : __syscall_slong_t , pub tolerance : __syscall_slong_t , pub time : timeval , pub tick : __syscall_slong_t , pub ppsfreq : __syscall_slong_t , pub jitter : __syscall_slong_t , pub shift : libc :: c_int , pub stabil : __syscall_slong_t , pub jitcnt : __syscall_slong_t , pub calcnt : __syscall_slong_t , pub errcnt : __syscall_slong_t , pub stbcnt : __syscall_slong_t , pub tai : libc :: c_int , pub _bitfield_1 : [ u32 ; 11usize ] , } # [ test ] fn bindgen_test_layout_timex ( ) { assert_eq ! ( :: std :: mem :: size_of :: < timex > ( ) , 208usize , concat ! ( "Size of: " , stringify ! ( timex ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < timex > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( timex ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timex ) ) . modes as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( timex ) , "::" , stringify ! ( modes ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timex ) ) . offset as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( timex ) , "::" , stringify ! ( offset ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timex ) ) . freq as * const _ as usize } , 16usize , concat ! ( "Alignment of field: " , stringify ! ( timex ) , "::" , stringify ! ( freq ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timex ) ) . maxerror as * const _ as usize } , 24usize , concat ! ( "Alignment of field: " , stringify ! ( timex ) , "::" , stringify ! ( maxerror ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timex ) ) . esterror as * const _ as usize } , 32usize , concat ! ( "Alignment of field: " , stringify ! ( timex ) , "::" , stringify ! ( esterror ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timex ) ) . status as * const _ as usize } , 40usize , concat ! ( "Alignment of field: " , stringify ! ( timex ) , "::" , stringify ! ( status ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timex ) ) . constant as * const _ as usize } , 48usize , concat ! ( "Alignment of field: " , stringify ! ( timex ) , "::" , stringify ! ( constant ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timex ) ) . precision as * const _ as usize } , 56usize , concat ! ( "Alignment of field: " , stringify ! ( timex ) , "::" , stringify ! ( precision ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timex ) ) . tolerance as * const _ as usize } , 64usize , concat ! ( "Alignment of field: " , stringify ! ( timex ) , "::" , stringify ! ( tolerance ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timex ) ) . time as * const _ as usize } , 72usize , concat ! ( "Alignment of field: " , stringify ! ( timex ) , "::" , stringify ! ( time ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timex ) ) . tick as * const _ as usize } , 88usize , concat ! ( "Alignment of field: " , stringify ! ( timex ) , "::" , stringify ! ( tick ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timex ) ) . ppsfreq as * const _ as usize } , 96usize , concat ! ( "Alignment of field: " , stringify ! ( timex ) , "::" , stringify ! ( ppsfreq ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timex ) ) . jitter as * const _ as usize } , 104usize , concat ! ( "Alignment of field: " , stringify ! ( timex ) , "::" , stringify ! ( jitter ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timex ) ) . shift as * const _ as usize } , 112usize , concat ! ( "Alignment of field: " , stringify ! ( timex ) , "::" , stringify ! ( shift ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timex ) ) . stabil as * const _ as usize } , 120usize , concat ! ( "Alignment of field: " , stringify ! ( timex ) , "::" , stringify ! ( stabil ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timex ) ) . jitcnt as * const _ as usize } , 128usize , concat ! ( "Alignment of field: " , stringify ! ( timex ) , "::" , stringify ! ( jitcnt ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timex ) ) . calcnt as * const _ as usize } , 136usize , concat ! ( "Alignment of field: " , stringify ! ( timex ) , "::" , stringify ! ( calcnt ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timex ) ) . errcnt as * const _ as usize } , 144usize , concat ! ( "Alignment of field: " , stringify ! ( timex ) , "::" , stringify ! ( errcnt ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timex ) ) . stbcnt as * const _ as usize } , 152usize , concat ! ( "Alignment of field: " , stringify ! ( timex ) , "::" , stringify ! ( stbcnt ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const timex ) ) . tai as * const _ as usize } , 160usize , concat ! ( "Alignment of field: " , stringify ! ( timex ) , "::" , stringify ! ( tai ) ) ) ; } extern "C" {
 pub fn clock_adjtime ( __clock_id : __clockid_t , __utx : * mut timex , ) -> libc :: c_int ; 
} # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct tm { pub tm_sec : libc :: c_int , pub tm_min : libc :: c_int , pub tm_hour : libc :: c_int , pub tm_mday : libc :: c_int , pub tm_mon : libc :: c_int , pub tm_year : libc :: c_int , pub tm_wday : libc :: c_int , pub tm_yday : libc :: c_int , pub tm_isdst : libc :: c_int , pub tm_gmtoff : libc :: c_long , pub tm_zone : * const libc :: c_char , } # [ test ] fn bindgen_test_layout_tm ( ) { assert_eq ! ( :: std :: mem :: size_of :: < tm > ( ) , 56usize , concat ! ( "Size of: " , stringify ! ( tm ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < tm > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( tm ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const tm ) ) . tm_sec as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( tm ) , "::" , stringify ! ( tm_sec ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const tm ) ) . tm_min as * const _ as usize } , 4usize , concat ! ( "Alignment of field: " , stringify ! ( tm ) , "::" , stringify ! ( tm_min ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const tm ) ) . tm_hour as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( tm ) , "::" , stringify ! ( tm_hour ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const tm ) ) . tm_mday as * const _ as usize } , 12usize , concat ! ( "Alignment of field: " , stringify ! ( tm ) , "::" , stringify ! ( tm_mday ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const tm ) ) . tm_mon as * const _ as usize } , 16usize , concat ! ( "Alignment of field: " , stringify ! ( tm ) , "::" , stringify ! ( tm_mon ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const tm ) ) . tm_year as * const _ as usize } , 20usize , concat ! ( "Alignment of field: " , stringify ! ( tm ) , "::" , stringify ! ( tm_year ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const tm ) ) . tm_wday as * const _ as usize } , 24usize , concat ! ( "Alignment of field: " , stringify ! ( tm ) , "::" , stringify ! ( tm_wday ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const tm ) ) . tm_yday as * const _ as usize } , 28usize , concat ! ( "Alignment of field: " , stringify ! ( tm ) , "::" , stringify ! ( tm_yday ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const tm ) ) . tm_isdst as * const _ as usize } , 32usize , concat ! ( "Alignment of field: " , stringify ! ( tm ) , "::" , stringify ! ( tm_isdst ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const tm ) ) . tm_gmtoff as * const _ as usize } , 40usize , concat ! ( "Alignment of field: " , stringify ! ( tm ) , "::" , stringify ! ( tm_gmtoff ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const tm ) ) . tm_zone as * const _ as usize } , 48usize , concat ! ( "Alignment of field: " , stringify ! ( tm ) , "::" , stringify ! ( tm_zone ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct itimerspec { pub it_interval : timespec , pub it_value : timespec , } # [ test ] fn bindgen_test_layout_itimerspec ( ) { assert_eq ! ( :: std :: mem :: size_of :: < itimerspec > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( itimerspec ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < itimerspec > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( itimerspec ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const itimerspec ) ) . it_interval as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( itimerspec ) , "::" , stringify ! ( it_interval ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const itimerspec ) ) . it_value as * const _ as usize } , 16usize , concat ! ( "Alignment of field: " , stringify ! ( itimerspec ) , "::" , stringify ! ( it_value ) ) ) ; } # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct sigevent { _unused : [ u8 ; 0 ] } extern "C" {
 pub fn clock ( ) -> clock_t ; 
} extern "C" {
 pub fn time ( __timer : * mut time_t , ) -> time_t ; 
} extern "C" {
 pub fn difftime ( __time1 : time_t , __time0 : time_t , ) -> f64 ; 
} extern "C" {
 pub fn mktime ( __tp : * mut tm , ) -> time_t ; 
} extern "C" {
 pub fn strftime ( __s : * mut libc :: c_char , __maxsize : usize , __format : * const libc :: c_char , __tp : * const tm , ) -> usize ; 
} extern "C" {
 pub fn strptime ( __s : * const libc :: c_char , __fmt : * const libc :: c_char , __tp : * mut tm , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn strftime_l ( __s : * mut libc :: c_char , __maxsize : usize , __format : * const libc :: c_char , __tp : * const tm , __loc : locale_t , ) -> usize ; 
} extern "C" {
 pub fn strptime_l ( __s : * const libc :: c_char , __fmt : * const libc :: c_char , __tp : * mut tm , __loc : locale_t , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn gmtime ( __timer : * const time_t , ) -> * mut tm ; 
} extern "C" {
 pub fn localtime ( __timer : * const time_t , ) -> * mut tm ; 
} extern "C" {
 pub fn gmtime_r ( __timer : * const time_t , __tp : * mut tm , ) -> * mut tm ; 
} extern "C" {
 pub fn localtime_r ( __timer : * const time_t , __tp : * mut tm , ) -> * mut tm ; 
} extern "C" {
 pub fn asctime ( __tp : * const tm , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn ctime ( __timer : * const time_t , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn asctime_r ( __tp : * const tm , __buf : * mut libc :: c_char , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn ctime_r ( __timer : * const time_t , __buf : * mut libc :: c_char , ) -> * mut libc :: c_char ; 
} extern "C" {
 # [ link_name = "\u{1}__tzname" ] 
 pub static mut  __tzname  :  [ * mut libc :: c_char ; 2usize ] ;
} extern "C" {
 # [ link_name = "\u{1}__daylight" ] 
 pub static mut  __daylight  :  libc :: c_int ;
} extern "C" {
 # [ link_name = "\u{1}__timezone" ] 
 pub static mut  __timezone  :  libc :: c_long ;
} extern "C" {
 # [ link_name = "\u{1}tzname" ] 
 pub static mut  tzname  :  [ * mut libc :: c_char ; 2usize ] ;
} extern "C" {
 pub fn tzset ( ) ; 
} extern "C" {
 # [ link_name = "\u{1}daylight" ] 
 pub static mut  daylight  :  libc :: c_int ;
} extern "C" {
 # [ link_name = "\u{1}timezone" ] 
 pub static mut  timezone  :  libc :: c_long ;
} extern "C" {
 pub fn stime ( __when : * const time_t , ) -> libc :: c_int ; 
} extern "C" {
 pub fn timegm ( __tp : * mut tm , ) -> time_t ; 
} extern "C" {
 pub fn timelocal ( __tp : * mut tm , ) -> time_t ; 
} extern "C" {
 pub fn dysize ( __year : libc :: c_int , ) -> libc :: c_int ; 
} extern "C" {
 pub fn nanosleep ( __requested_time : * const timespec , __remaining : * mut timespec , ) -> libc :: c_int ; 
} extern "C" {
 pub fn clock_getres ( __clock_id : clockid_t , __res : * mut timespec , ) -> libc :: c_int ; 
} extern "C" {
 pub fn clock_gettime ( __clock_id : clockid_t , __tp : * mut timespec , ) -> libc :: c_int ; 
} extern "C" {
 pub fn clock_settime ( __clock_id : clockid_t , __tp : * const timespec , ) -> libc :: c_int ; 
} extern "C" {
 pub fn clock_nanosleep ( __clock_id : clockid_t , __flags : libc :: c_int , __req : * const timespec , __rem : * mut timespec , ) -> libc :: c_int ; 
} extern "C" {
 pub fn clock_getcpuclockid ( __pid : pid_t , __clock_id : * mut clockid_t , ) -> libc :: c_int ; 
} extern "C" {
 pub fn timer_create ( __clock_id : clockid_t , __evp : * mut sigevent , __timerid : * mut timer_t , ) -> libc :: c_int ; 
} extern "C" {
 pub fn timer_delete ( __timerid : timer_t , ) -> libc :: c_int ; 
} extern "C" {
 pub fn timer_settime ( __timerid : timer_t , __flags : libc :: c_int , __value : * const itimerspec , __ovalue : * mut itimerspec , ) -> libc :: c_int ; 
} extern "C" {
 pub fn timer_gettime ( __timerid : timer_t , __value : * mut itimerspec , ) -> libc :: c_int ; 
} extern "C" {
 pub fn timer_getoverrun ( __timerid : timer_t , ) -> libc :: c_int ; 
} extern "C" {
 pub fn timespec_get ( __ts : * mut timespec , __base : libc :: c_int , ) -> libc :: c_int ; 
} extern "C" {
 # [ link_name = "\u{1}getdate_err" ] 
 pub static mut  getdate_err  :  libc :: c_int ;
} extern "C" {
 pub fn getdate ( __string : * const libc :: c_char , ) -> * mut tm ; 
} extern "C" {
 pub fn getdate_r ( __string : * const libc :: c_char , __resbufp : * mut tm , ) -> libc :: c_int ; 
} # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _MagickWand { _unused : [ u8 ; 0 ] } pub type MagickWand = _MagickWand ; pub type MagickFloatType = f32 ; pub type MagickDoubleType = f64 ; pub type Quantum = MagickFloatType ; pub type MagickRealType = MagickDoubleType ; pub type MagickStatusType = libc :: c_uint ; pub type MagickOffsetType = libc :: c_longlong ; pub type MagickSizeType = libc :: c_ulonglong ; pub type MagickAddressType = usize ; pub type QuantumAny = MagickSizeType ; pub const ClassType_UndefinedClass : ClassType = 0 ; pub const ClassType_DirectClass : ClassType = 1 ; pub const ClassType_PseudoClass : ClassType = 2 ; pub type ClassType = libc :: c_uint ; pub const MagickBooleanType_MagickFalse : MagickBooleanType = 0 ; pub const MagickBooleanType_MagickTrue : MagickBooleanType = 1 ; pub type MagickBooleanType = libc :: c_uint ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _BlobInfo { _unused : [ u8 ; 0 ] } pub type BlobInfo = _BlobInfo ; pub type ExceptionInfo = _ExceptionInfo ; pub type Image = _Image ; pub type ImageInfo = _ImageInfo ; extern "C" {
 pub fn AnimateImages ( arg1 : * const ImageInfo , arg2 : * mut Image , arg3 : * mut ExceptionInfo , ) -> MagickBooleanType ; 
} pub const GeometryFlags_NoValue : GeometryFlags = 0 ; pub const GeometryFlags_XValue : GeometryFlags = 1 ; pub const GeometryFlags_XiValue : GeometryFlags = 1 ; pub const GeometryFlags_YValue : GeometryFlags = 2 ; pub const GeometryFlags_PsiValue : GeometryFlags = 2 ; pub const GeometryFlags_WidthValue : GeometryFlags = 4 ; pub const GeometryFlags_RhoValue : GeometryFlags = 4 ; pub const GeometryFlags_HeightValue : GeometryFlags = 8 ; pub const GeometryFlags_SigmaValue : GeometryFlags = 8 ; pub const GeometryFlags_ChiValue : GeometryFlags = 16 ; pub const GeometryFlags_XiNegative : GeometryFlags = 32 ; pub const GeometryFlags_XNegative : GeometryFlags = 32 ; pub const GeometryFlags_PsiNegative : GeometryFlags = 64 ; pub const GeometryFlags_YNegative : GeometryFlags = 64 ; pub const GeometryFlags_ChiNegative : GeometryFlags = 128 ; pub const GeometryFlags_PercentValue : GeometryFlags = 4096 ; pub const GeometryFlags_AspectValue : GeometryFlags = 8192 ; pub const GeometryFlags_NormalizeValue : GeometryFlags = 8192 ; pub const GeometryFlags_LessValue : GeometryFlags = 16384 ; pub const GeometryFlags_GreaterValue : GeometryFlags = 32768 ; pub const GeometryFlags_MinimumValue : GeometryFlags = 65536 ; pub const GeometryFlags_CorrelateNormalizeValue : GeometryFlags = 65536 ; pub const GeometryFlags_AreaValue : GeometryFlags = 131072 ; pub const GeometryFlags_DecimalValue : GeometryFlags = 262144 ; pub const GeometryFlags_SeparatorValue : GeometryFlags = 524288 ; pub const GeometryFlags_AspectRatioValue : GeometryFlags = 1048576 ; pub const GeometryFlags_AllValues : GeometryFlags = 2147483647 ; pub type GeometryFlags = libc :: c_uint ; pub const GravityType_UndefinedGravity : GravityType = 0 ; pub const GravityType_ForgetGravity : GravityType = 0 ; pub const GravityType_NorthWestGravity : GravityType = 1 ; pub const GravityType_NorthGravity : GravityType = 2 ; pub const GravityType_NorthEastGravity : GravityType = 3 ; pub const GravityType_WestGravity : GravityType = 4 ; pub const GravityType_CenterGravity : GravityType = 5 ; pub const GravityType_EastGravity : GravityType = 6 ; pub const GravityType_SouthWestGravity : GravityType = 7 ; pub const GravityType_SouthGravity : GravityType = 8 ; pub const GravityType_SouthEastGravity : GravityType = 9 ; pub type GravityType = libc :: c_uint ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _AffineMatrix { pub sx : f64 , pub rx : f64 , pub ry : f64 , pub sy : f64 , pub tx : f64 , pub ty : f64 , } # [ test ] fn bindgen_test_layout__AffineMatrix ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _AffineMatrix > ( ) , 48usize , concat ! ( "Size of: " , stringify ! ( _AffineMatrix ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _AffineMatrix > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _AffineMatrix ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _AffineMatrix ) ) . sx as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( _AffineMatrix ) , "::" , stringify ! ( sx ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _AffineMatrix ) ) . rx as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( _AffineMatrix ) , "::" , stringify ! ( rx ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _AffineMatrix ) ) . ry as * const _ as usize } , 16usize , concat ! ( "Alignment of field: " , stringify ! ( _AffineMatrix ) , "::" , stringify ! ( ry ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _AffineMatrix ) ) . sy as * const _ as usize } , 24usize , concat ! ( "Alignment of field: " , stringify ! ( _AffineMatrix ) , "::" , stringify ! ( sy ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _AffineMatrix ) ) . tx as * const _ as usize } , 32usize , concat ! ( "Alignment of field: " , stringify ! ( _AffineMatrix ) , "::" , stringify ! ( tx ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _AffineMatrix ) ) . ty as * const _ as usize } , 40usize , concat ! ( "Alignment of field: " , stringify ! ( _AffineMatrix ) , "::" , stringify ! ( ty ) ) ) ; } pub type AffineMatrix = _AffineMatrix ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _GeometryInfo { pub rho : f64 , pub sigma : f64 , pub xi : f64 , pub psi : f64 , pub chi : f64 , } # [ test ] fn bindgen_test_layout__GeometryInfo ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _GeometryInfo > ( ) , 40usize , concat ! ( "Size of: " , stringify ! ( _GeometryInfo ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _GeometryInfo > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _GeometryInfo ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _GeometryInfo ) ) . rho as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( _GeometryInfo ) , "::" , stringify ! ( rho ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _GeometryInfo ) ) . sigma as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( _GeometryInfo ) , "::" , stringify ! ( sigma ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _GeometryInfo ) ) . xi as * const _ as usize } , 16usize , concat ! ( "Alignment of field: " , stringify ! ( _GeometryInfo ) , "::" , stringify ! ( xi ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _GeometryInfo ) ) . psi as * const _ as usize } , 24usize , concat ! ( "Alignment of field: " , stringify ! ( _GeometryInfo ) , "::" , stringify ! ( psi ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _GeometryInfo ) ) . chi as * const _ as usize } , 32usize , concat ! ( "Alignment of field: " , stringify ! ( _GeometryInfo ) , "::" , stringify ! ( chi ) ) ) ; } pub type GeometryInfo = _GeometryInfo ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _OffsetInfo { pub x : isize , pub y : isize , } # [ test ] fn bindgen_test_layout__OffsetInfo ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _OffsetInfo > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( _OffsetInfo ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _OffsetInfo > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _OffsetInfo ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _OffsetInfo ) ) . x as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( _OffsetInfo ) , "::" , stringify ! ( x ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _OffsetInfo ) ) . y as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( _OffsetInfo ) , "::" , stringify ! ( y ) ) ) ; } pub type OffsetInfo = _OffsetInfo ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _PointInfo { pub x : f64 , pub y : f64 , } # [ test ] fn bindgen_test_layout__PointInfo ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _PointInfo > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( _PointInfo ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _PointInfo > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _PointInfo ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PointInfo ) ) . x as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( _PointInfo ) , "::" , stringify ! ( x ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PointInfo ) ) . y as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( _PointInfo ) , "::" , stringify ! ( y ) ) ) ; } pub type PointInfo = _PointInfo ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _RectangleInfo { pub width : usize , pub height : usize , pub x : isize , pub y : isize , } # [ test ] fn bindgen_test_layout__RectangleInfo ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _RectangleInfo > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( _RectangleInfo ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _RectangleInfo > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _RectangleInfo ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _RectangleInfo ) ) . width as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( _RectangleInfo ) , "::" , stringify ! ( width ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _RectangleInfo ) ) . height as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( _RectangleInfo ) , "::" , stringify ! ( height ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _RectangleInfo ) ) . x as * const _ as usize } , 16usize , concat ! ( "Alignment of field: " , stringify ! ( _RectangleInfo ) , "::" , stringify ! ( x ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _RectangleInfo ) ) . y as * const _ as usize } , 24usize , concat ! ( "Alignment of field: " , stringify ! ( _RectangleInfo ) , "::" , stringify ! ( y ) ) ) ; } pub type RectangleInfo = _RectangleInfo ; extern "C" {
 pub fn GetPageGeometry ( arg1 : * const libc :: c_char , ) -> * mut libc :: c_char ; 
} extern "C" {
 pub fn IsGeometry ( arg1 : * const libc :: c_char , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn IsSceneGeometry ( arg1 : * const libc :: c_char , arg2 : MagickBooleanType , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn GetGeometry ( arg1 : * const libc :: c_char , arg2 : * mut isize , arg3 : * mut isize , arg4 : * mut usize , arg5 : * mut usize , ) -> MagickStatusType ; 
} extern "C" {
 pub fn ParseAbsoluteGeometry ( arg1 : * const libc :: c_char , arg2 : * mut RectangleInfo , ) -> MagickStatusType ; 
} extern "C" {
 pub fn ParseAffineGeometry ( arg1 : * const libc :: c_char , arg2 : * mut AffineMatrix , arg3 : * mut ExceptionInfo , ) -> MagickStatusType ; 
} extern "C" {
 pub fn ParseGeometry ( arg1 : * const libc :: c_char , arg2 : * mut GeometryInfo , ) -> MagickStatusType ; 
} extern "C" {
 pub fn ParseGravityGeometry ( arg1 : * const Image , arg2 : * const libc :: c_char , arg3 : * mut RectangleInfo , arg4 : * mut ExceptionInfo , ) -> MagickStatusType ; 
} extern "C" {
 pub fn ParseMetaGeometry ( arg1 : * const libc :: c_char , arg2 : * mut isize , arg3 : * mut isize , arg4 : * mut usize , arg5 : * mut usize , ) -> MagickStatusType ; 
} extern "C" {
 pub fn ParsePageGeometry ( arg1 : * const Image , arg2 : * const libc :: c_char , arg3 : * mut RectangleInfo , arg4 : * mut ExceptionInfo , ) -> MagickStatusType ; 
} extern "C" {
 pub fn ParseRegionGeometry ( arg1 : * const Image , arg2 : * const libc :: c_char , arg3 : * mut RectangleInfo , arg4 : * mut ExceptionInfo , ) -> MagickStatusType ; 
} extern "C" {
 pub fn GravityAdjustGeometry ( arg1 : usize , arg2 : usize , arg3 : GravityType , arg4 : * mut RectangleInfo , ) ; 
} extern "C" {
 pub fn SetGeometry ( arg1 : * const Image , arg2 : * mut RectangleInfo , ) ; 
} extern "C" {
 pub fn SetGeometryInfo ( arg1 : * mut GeometryInfo , ) ; 
} pub const AlphaChannelOption_UndefinedAlphaChannel : AlphaChannelOption = 0 ; pub const AlphaChannelOption_ActivateAlphaChannel : AlphaChannelOption = 1 ; pub const AlphaChannelOption_AssociateAlphaChannel : AlphaChannelOption = 2 ; pub const AlphaChannelOption_BackgroundAlphaChannel : AlphaChannelOption = 3 ; pub const AlphaChannelOption_CopyAlphaChannel : AlphaChannelOption = 4 ; pub const AlphaChannelOption_DeactivateAlphaChannel : AlphaChannelOption = 5 ; pub const AlphaChannelOption_DiscreteAlphaChannel : AlphaChannelOption = 6 ; pub const AlphaChannelOption_DisassociateAlphaChannel : AlphaChannelOption = 7 ; pub const AlphaChannelOption_ExtractAlphaChannel : AlphaChannelOption = 8 ; pub const AlphaChannelOption_OffAlphaChannel : AlphaChannelOption = 9 ; pub const AlphaChannelOption_OnAlphaChannel : AlphaChannelOption = 10 ; pub const AlphaChannelOption_OpaqueAlphaChannel : AlphaChannelOption = 11 ; pub const AlphaChannelOption_RemoveAlphaChannel : AlphaChannelOption = 12 ; pub const AlphaChannelOption_SetAlphaChannel : AlphaChannelOption = 13 ; pub const AlphaChannelOption_ShapeAlphaChannel : AlphaChannelOption = 14 ; pub const AlphaChannelOption_TransparentAlphaChannel : AlphaChannelOption = 15 ; pub type AlphaChannelOption = libc :: c_uint ; pub const ImageType_UndefinedType : ImageType = 0 ; pub const ImageType_BilevelType : ImageType = 1 ; pub const ImageType_GrayscaleType : ImageType = 2 ; pub const ImageType_GrayscaleAlphaType : ImageType = 3 ; pub const ImageType_PaletteType : ImageType = 4 ; pub const ImageType_PaletteAlphaType : ImageType = 5 ; pub const ImageType_TrueColorType : ImageType = 6 ; pub const ImageType_TrueColorAlphaType : ImageType = 7 ; pub const ImageType_ColorSeparationType : ImageType = 8 ; pub const ImageType_ColorSeparationAlphaType : ImageType = 9 ; pub const ImageType_OptimizeType : ImageType = 10 ; pub const ImageType_PaletteBilevelAlphaType : ImageType = 11 ; pub type ImageType = libc :: c_uint ; pub const InterlaceType_UndefinedInterlace : InterlaceType = 0 ; pub const InterlaceType_NoInterlace : InterlaceType = 1 ; pub const InterlaceType_LineInterlace : InterlaceType = 2 ; pub const InterlaceType_PlaneInterlace : InterlaceType = 3 ; pub const InterlaceType_PartitionInterlace : InterlaceType = 4 ; pub const InterlaceType_GIFInterlace : InterlaceType = 5 ; pub const InterlaceType_JPEGInterlace : InterlaceType = 6 ; pub const InterlaceType_PNGInterlace : InterlaceType = 7 ; pub type InterlaceType = libc :: c_uint ; pub const OrientationType_UndefinedOrientation : OrientationType = 0 ; pub const OrientationType_TopLeftOrientation : OrientationType = 1 ; pub const OrientationType_TopRightOrientation : OrientationType = 2 ; pub const OrientationType_BottomRightOrientation : OrientationType = 3 ; pub const OrientationType_BottomLeftOrientation : OrientationType = 4 ; pub const OrientationType_LeftTopOrientation : OrientationType = 5 ; pub const OrientationType_RightTopOrientation : OrientationType = 6 ; pub const OrientationType_RightBottomOrientation : OrientationType = 7 ; pub const OrientationType_LeftBottomOrientation : OrientationType = 8 ; pub type OrientationType = libc :: c_uint ; pub const ResolutionType_UndefinedResolution : ResolutionType = 0 ; pub const ResolutionType_PixelsPerInchResolution : ResolutionType = 1 ; pub const ResolutionType_PixelsPerCentimeterResolution : ResolutionType = 2 ; pub type ResolutionType = libc :: c_uint ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _PrimaryInfo { pub x : f64 , pub y : f64 , pub z : f64 , } # [ test ] fn bindgen_test_layout__PrimaryInfo ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _PrimaryInfo > ( ) , 24usize , concat ! ( "Size of: " , stringify ! ( _PrimaryInfo ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _PrimaryInfo > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _PrimaryInfo ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PrimaryInfo ) ) . x as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( _PrimaryInfo ) , "::" , stringify ! ( x ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PrimaryInfo ) ) . y as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( _PrimaryInfo ) , "::" , stringify ! ( y ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PrimaryInfo ) ) . z as * const _ as usize } , 16usize , concat ! ( "Alignment of field: " , stringify ! ( _PrimaryInfo ) , "::" , stringify ! ( z ) ) ) ; } pub type PrimaryInfo = _PrimaryInfo ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _SegmentInfo { pub x1 : f64 , pub y1 : f64 , pub x2 : f64 , pub y2 : f64 , } # [ test ] fn bindgen_test_layout__SegmentInfo ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _SegmentInfo > ( ) , 32usize , concat ! ( "Size of: " , stringify ! ( _SegmentInfo ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _SegmentInfo > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _SegmentInfo ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _SegmentInfo ) ) . x1 as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( _SegmentInfo ) , "::" , stringify ! ( x1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _SegmentInfo ) ) . y1 as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( _SegmentInfo ) , "::" , stringify ! ( y1 ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _SegmentInfo ) ) . x2 as * const _ as usize } , 16usize , concat ! ( "Alignment of field: " , stringify ! ( _SegmentInfo ) , "::" , stringify ! ( x2 ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _SegmentInfo ) ) . y2 as * const _ as usize } , 24usize , concat ! ( "Alignment of field: " , stringify ! ( _SegmentInfo ) , "::" , stringify ! ( y2 ) ) ) ; } pub type SegmentInfo = _SegmentInfo ; pub const TransmitType_UndefinedTransmitType : TransmitType = 0 ; pub const TransmitType_FileTransmitType : TransmitType = 1 ; pub const TransmitType_BlobTransmitType : TransmitType = 2 ; pub const TransmitType_StreamTransmitType : TransmitType = 3 ; pub const TransmitType_ImageTransmitType : TransmitType = 4 ; pub type TransmitType = libc :: c_uint ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _ChromaticityInfo { pub red_primary : PrimaryInfo , pub green_primary : PrimaryInfo , pub blue_primary : PrimaryInfo , pub white_point : PrimaryInfo , } # [ test ] fn bindgen_test_layout__ChromaticityInfo ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _ChromaticityInfo > ( ) , 96usize , concat ! ( "Size of: " , stringify ! ( _ChromaticityInfo ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _ChromaticityInfo > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _ChromaticityInfo ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _ChromaticityInfo ) ) . red_primary as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( _ChromaticityInfo ) , "::" , stringify ! ( red_primary ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _ChromaticityInfo ) ) . green_primary as * const _ as usize } , 24usize , concat ! ( "Alignment of field: " , stringify ! ( _ChromaticityInfo ) , "::" , stringify ! ( green_primary ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _ChromaticityInfo ) ) . blue_primary as * const _ as usize } , 48usize , concat ! ( "Alignment of field: " , stringify ! ( _ChromaticityInfo ) , "::" , stringify ! ( blue_primary ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _ChromaticityInfo ) ) . white_point as * const _ as usize } , 72usize , concat ! ( "Alignment of field: " , stringify ! ( _ChromaticityInfo ) , "::" , stringify ! ( white_point ) ) ) ; } pub type ChromaticityInfo = _ChromaticityInfo ; pub const MapMode_ReadMode : MapMode = 0 ; pub const MapMode_WriteMode : MapMode = 1 ; pub const MapMode_IOMode : MapMode = 2 ; pub const MapMode_PersistMode : MapMode = 3 ; pub type MapMode = libc :: c_uint ; pub type CustomStreamHandler = :: std :: option :: Option < unsafe extern "C" fn ( arg1 : * mut libc :: c_uchar , arg2 : usize , arg3 : * mut libc :: c_void ) -> isize > ; pub type CustomStreamSeeker = :: std :: option :: Option < unsafe extern "C" fn ( arg1 : MagickOffsetType , arg2 : libc :: c_int , arg3 : * mut libc :: c_void ) -> MagickOffsetType > ; pub type CustomStreamTeller = :: std :: option :: Option < unsafe extern "C" fn ( arg1 : * mut libc :: c_void ) -> MagickOffsetType > ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _CustomStreamInfo { _unused : [ u8 ; 0 ] } pub type CustomStreamInfo = _CustomStreamInfo ; pub const ColorspaceType_UndefinedColorspace : ColorspaceType = 0 ; pub const ColorspaceType_CMYColorspace : ColorspaceType = 1 ; pub const ColorspaceType_CMYKColorspace : ColorspaceType = 2 ; pub const ColorspaceType_GRAYColorspace : ColorspaceType = 3 ; pub const ColorspaceType_HCLColorspace : ColorspaceType = 4 ; pub const ColorspaceType_HCLpColorspace : ColorspaceType = 5 ; pub const ColorspaceType_HSBColorspace : ColorspaceType = 6 ; pub const ColorspaceType_HSIColorspace : ColorspaceType = 7 ; pub const ColorspaceType_HSLColorspace : ColorspaceType = 8 ; pub const ColorspaceType_HSVColorspace : ColorspaceType = 9 ; pub const ColorspaceType_HWBColorspace : ColorspaceType = 10 ; pub const ColorspaceType_LabColorspace : ColorspaceType = 11 ; pub const ColorspaceType_LCHColorspace : ColorspaceType = 12 ; pub const ColorspaceType_LCHabColorspace : ColorspaceType = 13 ; pub const ColorspaceType_LCHuvColorspace : ColorspaceType = 14 ; pub const ColorspaceType_LogColorspace : ColorspaceType = 15 ; pub const ColorspaceType_LMSColorspace : ColorspaceType = 16 ; pub const ColorspaceType_LuvColorspace : ColorspaceType = 17 ; pub const ColorspaceType_OHTAColorspace : ColorspaceType = 18 ; pub const ColorspaceType_Rec601YCbCrColorspace : ColorspaceType = 19 ; pub const ColorspaceType_Rec709YCbCrColorspace : ColorspaceType = 20 ; pub const ColorspaceType_RGBColorspace : ColorspaceType = 21 ; pub const ColorspaceType_scRGBColorspace : ColorspaceType = 22 ; pub const ColorspaceType_sRGBColorspace : ColorspaceType = 23 ; pub const ColorspaceType_TransparentColorspace : ColorspaceType = 24 ; pub const ColorspaceType_xyYColorspace : ColorspaceType = 25 ; pub const ColorspaceType_XYZColorspace : ColorspaceType = 26 ; pub const ColorspaceType_YCbCrColorspace : ColorspaceType = 27 ; pub const ColorspaceType_YCCColorspace : ColorspaceType = 28 ; pub const ColorspaceType_YDbDrColorspace : ColorspaceType = 29 ; pub const ColorspaceType_YIQColorspace : ColorspaceType = 30 ; pub const ColorspaceType_YPbPrColorspace : ColorspaceType = 31 ; pub const ColorspaceType_YUVColorspace : ColorspaceType = 32 ; pub const ColorspaceType_LinearGRAYColorspace : ColorspaceType = 33 ; pub const ColorspaceType_JzazbzColorspace : ColorspaceType = 34 ; pub type ColorspaceType = libc :: c_uint ; extern "C" {
 pub fn GetImageColorspaceType ( arg1 : * const Image , arg2 : * mut ExceptionInfo , ) -> ColorspaceType ; 
} extern "C" {
 pub fn SetImageColorspace ( arg1 : * mut Image , arg2 : ColorspaceType , arg3 : * mut ExceptionInfo , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn SetImageGray ( arg1 : * mut Image , arg2 : * mut ExceptionInfo , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn SetImageMonochrome ( arg1 : * mut Image , arg2 : * mut ExceptionInfo , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn TransformImageColorspace ( arg1 : * mut Image , arg2 : ColorspaceType , arg3 : * mut ExceptionInfo , ) -> MagickBooleanType ; 
} pub const ChannelType_UndefinedChannel : ChannelType = 0 ; pub const ChannelType_RedChannel : ChannelType = 1 ; pub const ChannelType_GrayChannel : ChannelType = 1 ; pub const ChannelType_CyanChannel : ChannelType = 1 ; pub const ChannelType_GreenChannel : ChannelType = 2 ; pub const ChannelType_MagentaChannel : ChannelType = 2 ; pub const ChannelType_BlueChannel : ChannelType = 4 ; pub const ChannelType_YellowChannel : ChannelType = 4 ; pub const ChannelType_BlackChannel : ChannelType = 8 ; pub const ChannelType_AlphaChannel : ChannelType = 16 ; pub const ChannelType_OpacityChannel : ChannelType = 16 ; pub const ChannelType_IndexChannel : ChannelType = 32 ; pub const ChannelType_ReadMaskChannel : ChannelType = 64 ; pub const ChannelType_WriteMaskChannel : ChannelType = 128 ; pub const ChannelType_MetaChannel : ChannelType = 256 ; pub const ChannelType_CompositeMaskChannel : ChannelType = 512 ; pub const ChannelType_CompositeChannels : ChannelType = 31 ; pub const ChannelType_AllChannels : ChannelType = 134217727 ; pub const ChannelType_TrueAlphaChannel : ChannelType = 256 ; pub const ChannelType_RGBChannels : ChannelType = 512 ; pub const ChannelType_GrayChannels : ChannelType = 1024 ; pub const ChannelType_SyncChannels : ChannelType = 131072 ; pub const ChannelType_DefaultChannels : ChannelType = 134217727 ; pub type ChannelType = libc :: c_uint ; pub const PixelChannel_UndefinedPixelChannel : PixelChannel = 0 ; pub const PixelChannel_RedPixelChannel : PixelChannel = 0 ; pub const PixelChannel_CyanPixelChannel : PixelChannel = 0 ; pub const PixelChannel_GrayPixelChannel : PixelChannel = 0 ; pub const PixelChannel_LPixelChannel : PixelChannel = 0 ; pub const PixelChannel_LabelPixelChannel : PixelChannel = 0 ; pub const PixelChannel_YPixelChannel : PixelChannel = 0 ; pub const PixelChannel_aPixelChannel : PixelChannel = 1 ; pub const PixelChannel_GreenPixelChannel : PixelChannel = 1 ; pub const PixelChannel_MagentaPixelChannel : PixelChannel = 1 ; pub const PixelChannel_CbPixelChannel : PixelChannel = 1 ; pub const PixelChannel_bPixelChannel : PixelChannel = 2 ; pub const PixelChannel_BluePixelChannel : PixelChannel = 2 ; pub const PixelChannel_YellowPixelChannel : PixelChannel = 2 ; pub const PixelChannel_CrPixelChannel : PixelChannel = 2 ; pub const PixelChannel_BlackPixelChannel : PixelChannel = 3 ; pub const PixelChannel_AlphaPixelChannel : PixelChannel = 4 ; pub const PixelChannel_IndexPixelChannel : PixelChannel = 5 ; pub const PixelChannel_ReadMaskPixelChannel : PixelChannel = 6 ; pub const PixelChannel_WriteMaskPixelChannel : PixelChannel = 7 ; pub const PixelChannel_MetaPixelChannel : PixelChannel = 8 ; pub const PixelChannel_CompositeMaskPixelChannel : PixelChannel = 9 ; pub const PixelChannel_IntensityPixelChannel : PixelChannel = 32 ; pub const PixelChannel_CompositePixelChannel : PixelChannel = 32 ; pub const PixelChannel_SyncPixelChannel : PixelChannel = 33 ; pub type PixelChannel = libc :: c_uint ; pub const PixelIntensityMethod_UndefinedPixelIntensityMethod : PixelIntensityMethod = 0 ; pub const PixelIntensityMethod_AveragePixelIntensityMethod : PixelIntensityMethod = 1 ; pub const PixelIntensityMethod_BrightnessPixelIntensityMethod : PixelIntensityMethod = 2 ; pub const PixelIntensityMethod_LightnessPixelIntensityMethod : PixelIntensityMethod = 3 ; pub const PixelIntensityMethod_MSPixelIntensityMethod : PixelIntensityMethod = 4 ; pub const PixelIntensityMethod_Rec601LumaPixelIntensityMethod : PixelIntensityMethod = 5 ; pub const PixelIntensityMethod_Rec601LuminancePixelIntensityMethod : PixelIntensityMethod = 6 ; pub const PixelIntensityMethod_Rec709LumaPixelIntensityMethod : PixelIntensityMethod = 7 ; pub const PixelIntensityMethod_Rec709LuminancePixelIntensityMethod : PixelIntensityMethod = 8 ; pub const PixelIntensityMethod_RMSPixelIntensityMethod : PixelIntensityMethod = 9 ; pub type PixelIntensityMethod = libc :: c_uint ; pub const PixelInterpolateMethod_UndefinedInterpolatePixel : PixelInterpolateMethod = 0 ; pub const PixelInterpolateMethod_AverageInterpolatePixel : PixelInterpolateMethod = 1 ; pub const PixelInterpolateMethod_Average9InterpolatePixel : PixelInterpolateMethod = 2 ; pub const PixelInterpolateMethod_Average16InterpolatePixel : PixelInterpolateMethod = 3 ; pub const PixelInterpolateMethod_BackgroundInterpolatePixel : PixelInterpolateMethod = 4 ; pub const PixelInterpolateMethod_BilinearInterpolatePixel : PixelInterpolateMethod = 5 ; pub const PixelInterpolateMethod_BlendInterpolatePixel : PixelInterpolateMethod = 6 ; pub const PixelInterpolateMethod_CatromInterpolatePixel : PixelInterpolateMethod = 7 ; pub const PixelInterpolateMethod_IntegerInterpolatePixel : PixelInterpolateMethod = 8 ; pub const PixelInterpolateMethod_MeshInterpolatePixel : PixelInterpolateMethod = 9 ; pub const PixelInterpolateMethod_NearestInterpolatePixel : PixelInterpolateMethod = 10 ; pub const PixelInterpolateMethod_SplineInterpolatePixel : PixelInterpolateMethod = 11 ; pub type PixelInterpolateMethod = libc :: c_uint ; pub const PixelMask_UndefinedPixelMask : PixelMask = 0 ; pub const PixelMask_ReadPixelMask : PixelMask = 1 ; pub const PixelMask_WritePixelMask : PixelMask = 2 ; pub const PixelMask_CompositePixelMask : PixelMask = 4 ; pub type PixelMask = libc :: c_uint ; pub const PixelTrait_UndefinedPixelTrait : PixelTrait = 0 ; pub const PixelTrait_CopyPixelTrait : PixelTrait = 1 ; pub const PixelTrait_UpdatePixelTrait : PixelTrait = 2 ; pub const PixelTrait_BlendPixelTrait : PixelTrait = 4 ; pub type PixelTrait = libc :: c_uint ; pub const StorageType_UndefinedPixel : StorageType = 0 ; pub const StorageType_CharPixel : StorageType = 1 ; pub const StorageType_DoublePixel : StorageType = 2 ; pub const StorageType_FloatPixel : StorageType = 3 ; pub const StorageType_LongPixel : StorageType = 4 ; pub const StorageType_LongLongPixel : StorageType = 5 ; pub const StorageType_QuantumPixel : StorageType = 6 ; pub const StorageType_ShortPixel : StorageType = 7 ; pub type StorageType = libc :: c_uint ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _PixelChannelMap { pub channel : PixelChannel , pub traits : PixelTrait , pub offset : isize , } # [ test ] fn bindgen_test_layout__PixelChannelMap ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _PixelChannelMap > ( ) , 16usize , concat ! ( "Size of: " , stringify ! ( _PixelChannelMap ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _PixelChannelMap > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _PixelChannelMap ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PixelChannelMap ) ) . channel as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( _PixelChannelMap ) , "::" , stringify ! ( channel ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PixelChannelMap ) ) . traits as * const _ as usize } , 4usize , concat ! ( "Alignment of field: " , stringify ! ( _PixelChannelMap ) , "::" , stringify ! ( traits ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PixelChannelMap ) ) . offset as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( _PixelChannelMap ) , "::" , stringify ! ( offset ) ) ) ; } pub type PixelChannelMap = _PixelChannelMap ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _PixelInfo { pub storage_class : ClassType , pub colorspace : ColorspaceType , pub alpha_trait : PixelTrait , pub fuzz : f64 , pub depth : usize , pub count : MagickSizeType , pub red : MagickRealType , pub green : MagickRealType , pub blue : MagickRealType , pub black : MagickRealType , pub alpha : MagickRealType , pub index : MagickRealType , } # [ test ] fn bindgen_test_layout__PixelInfo ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _PixelInfo > ( ) , 88usize , concat ! ( "Size of: " , stringify ! ( _PixelInfo ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _PixelInfo > ( ) , 8usize , concat ! ( "Alignment of " , stringify ! ( _PixelInfo ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PixelInfo ) ) . storage_class as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( _PixelInfo ) , "::" , stringify ! ( storage_class ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PixelInfo ) ) . colorspace as * const _ as usize } , 4usize , concat ! ( "Alignment of field: " , stringify ! ( _PixelInfo ) , "::" , stringify ! ( colorspace ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PixelInfo ) ) . alpha_trait as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( _PixelInfo ) , "::" , stringify ! ( alpha_trait ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PixelInfo ) ) . fuzz as * const _ as usize } , 16usize , concat ! ( "Alignment of field: " , stringify ! ( _PixelInfo ) , "::" , stringify ! ( fuzz ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PixelInfo ) ) . depth as * const _ as usize } , 24usize , concat ! ( "Alignment of field: " , stringify ! ( _PixelInfo ) , "::" , stringify ! ( depth ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PixelInfo ) ) . count as * const _ as usize } , 32usize , concat ! ( "Alignment of field: " , stringify ! ( _PixelInfo ) , "::" , stringify ! ( count ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PixelInfo ) ) . red as * const _ as usize } , 40usize , concat ! ( "Alignment of field: " , stringify ! ( _PixelInfo ) , "::" , stringify ! ( red ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PixelInfo ) ) . green as * const _ as usize } , 48usize , concat ! ( "Alignment of field: " , stringify ! ( _PixelInfo ) , "::" , stringify ! ( green ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PixelInfo ) ) . blue as * const _ as usize } , 56usize , concat ! ( "Alignment of field: " , stringify ! ( _PixelInfo ) , "::" , stringify ! ( blue ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PixelInfo ) ) . black as * const _ as usize } , 64usize , concat ! ( "Alignment of field: " , stringify ! ( _PixelInfo ) , "::" , stringify ! ( black ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PixelInfo ) ) . alpha as * const _ as usize } , 72usize , concat ! ( "Alignment of field: " , stringify ! ( _PixelInfo ) , "::" , stringify ! ( alpha ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PixelInfo ) ) . index as * const _ as usize } , 80usize , concat ! ( "Alignment of field: " , stringify ! ( _PixelInfo ) , "::" , stringify ! ( index ) ) ) ; } pub type PixelInfo = _PixelInfo ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _PixelPacket { pub red : libc :: c_uint , pub green : libc :: c_uint , pub blue : libc :: c_uint , pub alpha : libc :: c_uint , pub black : libc :: c_uint , } # [ test ] fn bindgen_test_layout__PixelPacket ( ) { assert_eq ! ( :: std :: mem :: size_of :: < _PixelPacket > ( ) , 20usize , concat ! ( "Size of: " , stringify ! ( _PixelPacket ) ) ) ; assert_eq ! ( :: std :: mem :: align_of :: < _PixelPacket > ( ) , 4usize , concat ! ( "Alignment of " , stringify ! ( _PixelPacket ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PixelPacket ) ) . red as * const _ as usize } , 0usize , concat ! ( "Alignment of field: " , stringify ! ( _PixelPacket ) , "::" , stringify ! ( red ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PixelPacket ) ) . green as * const _ as usize } , 4usize , concat ! ( "Alignment of field: " , stringify ! ( _PixelPacket ) , "::" , stringify ! ( green ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PixelPacket ) ) . blue as * const _ as usize } , 8usize , concat ! ( "Alignment of field: " , stringify ! ( _PixelPacket ) , "::" , stringify ! ( blue ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PixelPacket ) ) . alpha as * const _ as usize } , 12usize , concat ! ( "Alignment of field: " , stringify ! ( _PixelPacket ) , "::" , stringify ! ( alpha ) ) ) ; assert_eq ! ( unsafe { & ( * ( 0 as * const _PixelPacket ) ) . black as * const _ as usize } , 16usize , concat ! ( "Alignment of field: " , stringify ! ( _PixelPacket ) , "::" , stringify ! ( black ) ) ) ; } pub type PixelPacket = _PixelPacket ; # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _CacheView { _unused : [ u8 ; 0 ] } pub type CacheView_ = _CacheView ; extern "C" {
 pub fn SetPixelChannelMask ( arg1 : * mut Image , arg2 : ChannelType , ) -> ChannelType ; 
} extern "C" {
 pub fn ExportImagePixels ( arg1 : * const Image , arg2 : isize , arg3 : isize , arg4 : usize , arg5 : usize , arg6 : * const libc :: c_char , arg7 : StorageType , arg8 : * mut libc :: c_void , arg9 : * mut ExceptionInfo , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn ImportImagePixels ( arg1 : * mut Image , arg2 : isize , arg3 : isize , arg4 : usize , arg5 : usize , arg6 : * const libc :: c_char , arg7 : StorageType , arg8 : * const libc :: c_void , arg9 : * mut ExceptionInfo , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn InterpolatePixelChannel ( arg1 : * const Image , arg2 : * const CacheView_ , arg3 : PixelChannel , arg4 : PixelInterpolateMethod , arg5 : f64 , arg6 : f64 , arg7 : * mut f64 , arg8 : * mut ExceptionInfo , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn InterpolatePixelChannels ( arg1 : * const Image , arg2 : * const CacheView_ , arg3 : * const Image , arg4 : PixelInterpolateMethod , arg5 : f64 , arg6 : f64 , arg7 : * mut Quantum , arg8 : * mut ExceptionInfo , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn InterpolatePixelInfo ( arg1 : * const Image , arg2 : * const CacheView_ , arg3 : PixelInterpolateMethod , arg4 : f64 , arg5 : f64 , arg6 : * mut PixelInfo , arg7 : * mut ExceptionInfo , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn IsFuzzyEquivalencePixel ( arg1 : * const Image , arg2 : * const Quantum , arg3 : * const Image , arg4 : * const Quantum , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn IsFuzzyEquivalencePixelInfo ( arg1 : * const PixelInfo , arg2 : * const PixelInfo , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn SetPixelMetaChannels ( arg1 : * mut Image , arg2 : usize , arg3 : * mut ExceptionInfo , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn GetPixelInfoIntensity ( arg1 : * const Image , arg2 : * const PixelInfo , ) -> MagickRealType ; 
} extern "C" {
 pub fn GetPixelIntensity ( arg1 : * const Image , arg2 : * const Quantum , ) -> MagickRealType ; 
} extern "C" {
 pub fn AcquirePixelChannelMap ( ) -> * mut PixelChannelMap ; 
} extern "C" {
 pub fn ClonePixelChannelMap ( arg1 : * mut PixelChannelMap , ) -> * mut PixelChannelMap ; 
} extern "C" {
 pub fn DestroyPixelChannelMap ( arg1 : * mut PixelChannelMap , ) -> * mut PixelChannelMap ; 
} extern "C" {
 pub fn ClonePixelInfo ( arg1 : * const PixelInfo , ) -> * mut PixelInfo ; 
} extern "C" {
 pub fn DecodePixelGamma ( arg1 : MagickRealType , ) -> MagickRealType ; 
} extern "C" {
 pub fn EncodePixelGamma ( arg1 : MagickRealType , ) -> MagickRealType ; 
} extern "C" {
 pub fn ConformPixelInfo ( arg1 : * mut Image , arg2 : * const PixelInfo , arg3 : * mut PixelInfo , arg4 : * mut ExceptionInfo , ) ; 
} extern "C" {
 pub fn GetPixelInfo ( arg1 : * const Image , arg2 : * mut PixelInfo , ) ; 
} extern "C" {
 pub fn InitializePixelChannelMap ( arg1 : * mut Image , ) ; 
} # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct _StreamInfo { _unused : [ u8 ; 0 ] } pub type StreamInfo = _StreamInfo ; pub type StreamHandler = :: std :: option :: Option < unsafe extern "C" fn ( arg1 : * const Image , arg2 : * const libc :: c_void , arg3 : usize ) -> usize > ; extern "C" {
 pub fn ReadStream ( arg1 : * const ImageInfo , arg2 : StreamHandler , arg3 : * mut ExceptionInfo , ) -> * mut Image ; 
} extern "C" {
 pub fn StreamImage ( arg1 : * const ImageInfo , arg2 : * mut StreamInfo , arg3 : * mut ExceptionInfo , ) -> * mut Image ; 
} extern "C" {
 pub fn OpenStream ( arg1 : * const ImageInfo , arg2 : * mut StreamInfo , arg3 : * const libc :: c_char , arg4 : * mut ExceptionInfo , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn WriteStream ( arg1 : * const ImageInfo , arg2 : * mut Image , arg3 : StreamHandler , arg4 : * mut ExceptionInfo , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn AcquireStreamInfo ( arg1 : * const ImageInfo , arg2 : * mut ExceptionInfo , ) -> * mut StreamInfo ; 
} extern "C" {
 pub fn DestroyStreamInfo ( arg1 : * mut StreamInfo , ) -> * mut StreamInfo ; 
} extern "C" {
 pub fn SetStreamInfoMap ( arg1 : * mut StreamInfo , arg2 : * const libc :: c_char , ) ; 
} extern "C" {
 pub fn SetStreamInfoStorageType ( arg1 : * mut StreamInfo , arg2 : StorageType , ) ; 
} extern "C" {
 pub fn AcquireCustomStreamInfo ( arg1 : * mut ExceptionInfo , ) -> * mut CustomStreamInfo ; 
} extern "C" {
 pub fn DestroyCustomStreamInfo ( arg1 : * mut CustomStreamInfo , ) -> * mut CustomStreamInfo ; 
} extern "C" {
 pub fn GetBlobFileHandle ( arg1 : * const Image , ) -> * mut FILE ; 
} extern "C" {
 pub fn BlobToImage ( arg1 : * const ImageInfo , arg2 : * const libc :: c_void , arg3 : usize , arg4 : * mut ExceptionInfo , ) -> * mut Image ; 
} extern "C" {
 pub fn PingBlob ( arg1 : * const ImageInfo , arg2 : * const libc :: c_void , arg3 : usize , arg4 : * mut ExceptionInfo , ) -> * mut Image ; 
} extern "C" {
 pub fn CustomStreamToImage ( arg1 : * const ImageInfo , arg2 : * mut ExceptionInfo , ) -> * mut Image ; 
} extern "C" {
 pub fn BlobToFile ( arg1 : * mut libc :: c_char , arg2 : * const libc :: c_void , arg3 : usize , arg4 : * mut ExceptionInfo , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn FileToImage ( arg1 : * mut Image , arg2 : * const libc :: c_char , arg3 : * mut ExceptionInfo , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn GetBlobError ( arg1 : * const Image , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn ImageToFile ( arg1 : * mut Image , arg2 : * mut libc :: c_char , arg3 : * mut ExceptionInfo , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn InjectImageBlob ( arg1 : * const ImageInfo , arg2 : * mut Image , arg3 : * mut Image , arg4 : * const libc :: c_char , arg5 : * mut ExceptionInfo , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn IsBlobExempt ( arg1 : * const Image , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn IsBlobSeekable ( arg1 : * const Image , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn IsBlobTemporary ( arg1 : * const Image , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn GetBlobSize ( arg1 : * const Image , ) -> MagickSizeType ; 
} extern "C" {
 pub fn GetBlobStreamHandler ( arg1 : * const Image , ) -> StreamHandler ; 
} extern "C" {
 pub fn GetBlobStreamData ( arg1 : * const Image , ) -> * mut libc :: c_void ; 
} extern "C" {
 pub fn DestroyBlob ( arg1 : * mut Image , ) ; 
} extern "C" {
 pub fn DuplicateBlob ( arg1 : * mut Image , arg2 : * const Image , ) ; 
} extern "C" {
 pub fn FileToBlob ( arg1 : * const libc :: c_char , arg2 : usize , arg3 : * mut usize , arg4 : * mut ExceptionInfo , ) -> * mut libc :: c_void ; 
} extern "C" {
 pub fn ImageToBlob ( arg1 : * const ImageInfo , arg2 : * mut Image , arg3 : * mut usize , arg4 : * mut ExceptionInfo , ) -> * mut libc :: c_void ; 
} extern "C" {
 pub fn ImageToCustomStream ( arg1 : * const ImageInfo , arg2 : * mut Image , arg3 : * mut ExceptionInfo , ) ; 
} extern "C" {
 pub fn ImagesToBlob ( arg1 : * const ImageInfo , arg2 : * mut Image , arg3 : * mut usize , arg4 : * mut ExceptionInfo , ) -> * mut libc :: c_void ; 
} extern "C" {
 pub fn ImagesToCustomStream ( arg1 : * const ImageInfo , arg2 : * mut Image , arg3 : * mut ExceptionInfo , ) ; 
} extern "C" {
 pub fn SetBlobExempt ( arg1 : * mut Image , arg2 : MagickBooleanType , ) ; 
} extern "C" {
 pub fn SetCustomStreamData ( arg1 : * mut CustomStreamInfo , arg2 : * mut libc :: c_void , ) ; 
} extern "C" {
 pub fn SetCustomStreamReader ( arg1 : * mut CustomStreamInfo , arg2 : CustomStreamHandler , ) ; 
} extern "C" {
 pub fn SetCustomStreamSeeker ( arg1 : * mut CustomStreamInfo , arg2 : CustomStreamSeeker , ) ; 
} extern "C" {
 pub fn SetCustomStreamTeller ( arg1 : * mut CustomStreamInfo , arg2 : CustomStreamTeller , ) ; 
} extern "C" {
 pub fn SetCustomStreamWriter ( arg1 : * mut CustomStreamInfo , arg2 : CustomStreamHandler , ) ; 
} pub const VirtualPixelMethod_UndefinedVirtualPixelMethod : VirtualPixelMethod = 0 ; pub const VirtualPixelMethod_BackgroundVirtualPixelMethod : VirtualPixelMethod = 1 ; pub const VirtualPixelMethod_DitherVirtualPixelMethod : VirtualPixelMethod = 2 ; pub const VirtualPixelMethod_EdgeVirtualPixelMethod : VirtualPixelMethod = 3 ; pub const VirtualPixelMethod_MirrorVirtualPixelMethod : VirtualPixelMethod = 4 ; pub const VirtualPixelMethod_RandomVirtualPixelMethod : VirtualPixelMethod = 5 ; pub const VirtualPixelMethod_TileVirtualPixelMethod : VirtualPixelMethod = 6 ; pub const VirtualPixelMethod_TransparentVirtualPixelMethod : VirtualPixelMethod = 7 ; pub const VirtualPixelMethod_MaskVirtualPixelMethod : VirtualPixelMethod = 8 ; pub const VirtualPixelMethod_BlackVirtualPixelMethod : VirtualPixelMethod = 9 ; pub const VirtualPixelMethod_GrayVirtualPixelMethod : VirtualPixelMethod = 10 ; pub const VirtualPixelMethod_WhiteVirtualPixelMethod : VirtualPixelMethod = 11 ; pub const VirtualPixelMethod_HorizontalTileVirtualPixelMethod : VirtualPixelMethod = 12 ; pub const VirtualPixelMethod_VerticalTileVirtualPixelMethod : VirtualPixelMethod = 13 ; pub const VirtualPixelMethod_HorizontalTileEdgeVirtualPixelMethod : VirtualPixelMethod = 14 ; pub const VirtualPixelMethod_VerticalTileEdgeVirtualPixelMethod : VirtualPixelMethod = 15 ; pub const VirtualPixelMethod_CheckerTileVirtualPixelMethod : VirtualPixelMethod = 16 ; pub type VirtualPixelMethod = libc :: c_uint ; pub type CacheView = _CacheView ; extern "C" {
 pub fn AcquireAuthenticCacheView ( arg1 : * const Image , arg2 : * mut ExceptionInfo , ) -> * mut CacheView ; 
} extern "C" {
 pub fn AcquireVirtualCacheView ( arg1 : * const Image , arg2 : * mut ExceptionInfo , ) -> * mut CacheView ; 
} extern "C" {
 pub fn CloneCacheView ( arg1 : * const CacheView , ) -> * mut CacheView ; 
} extern "C" {
 pub fn DestroyCacheView ( arg1 : * mut CacheView , ) -> * mut CacheView ; 
} extern "C" {
 pub fn GetCacheViewStorageClass ( arg1 : * const CacheView , ) -> ClassType ; 
} extern "C" {
 pub fn GetCacheViewColorspace ( arg1 : * const CacheView , ) -> ColorspaceType ; 
} extern "C" {
 pub fn GetCacheViewImage ( arg1 : * const CacheView , ) -> * const Image ; 
} extern "C" {
 pub fn GetCacheViewVirtualPixels ( arg1 : * const CacheView , arg2 : isize , arg3 : isize , arg4 : usize , arg5 : usize , arg6 : * mut ExceptionInfo , ) -> * const Quantum ; 
} extern "C" {
 pub fn GetCacheViewVirtualPixelQueue ( arg1 : * const CacheView , ) -> * const Quantum ; 
} extern "C" {
 pub fn GetCacheViewVirtualMetacontent ( arg1 : * const CacheView , ) -> * const libc :: c_void ; 
} extern "C" {
 pub fn GetOneCacheViewAuthenticPixel ( arg1 : * const CacheView , arg2 : isize , arg3 : isize , arg4 : * mut Quantum , arg5 : * mut ExceptionInfo , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn GetOneCacheViewVirtualMethodPixel ( arg1 : * const CacheView , arg2 : VirtualPixelMethod , arg3 : isize , arg4 : isize , arg5 : * mut Quantum , arg6 : * mut ExceptionInfo , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn GetOneCacheViewVirtualPixel ( arg1 : * const CacheView , arg2 : isize , arg3 : isize , arg4 : * mut Quantum , arg5 : * mut ExceptionInfo , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn GetOneCacheViewVirtualPixelInfo ( arg1 : * const CacheView , arg2 : isize , arg3 : isize , arg4 : * mut PixelInfo , arg5 : * mut ExceptionInfo , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn SetCacheViewStorageClass ( arg1 : * mut CacheView , arg2 : ClassType , arg3 : * mut ExceptionInfo , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn SetCacheViewVirtualPixelMethod ( arg1 : * mut CacheView , arg2 : VirtualPixelMethod , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn SyncCacheViewAuthenticPixels ( arg1 : * mut CacheView , arg2 : * mut ExceptionInfo , ) -> MagickBooleanType ; 
} extern "C" {
 pub fn GetCacheViewExtent ( arg1 : * const CacheView , ) -> MagickSizeType ; 
} extern "C" {
 pub fn GetCacheViewAuthenticPixelQueue ( arg1 : * mut CacheView , ) -> * mut Quantum ; 
} extern "C" {
 pub fn GetCacheViewAuthenticPixels ( arg1 : * mut CacheView , arg2 : isize , arg3 : isize , arg4 : usize , arg5 : usize , arg6 : * mut ExceptionInfo , ) -> * mut Quantum ; 
} extern "C" {
 pub fn QueueCacheViewAuthenticPixels ( arg1 : * mut CacheView , arg2 : isize , arg3 : isize , arg4 : usize , arg5 : usize , arg6 : * mut ExceptionInfo , ) -> * mut Quantum ; 
} extern "C" {
 pub fn GetCacheViewAuthenticMetacontent ( arg1 : * mut CacheView , ) -> * mut libc :: c_void ; 
} # [ repr ( C ) ] # [ derive ( Debug , Copy , Clone ) ] pub struct SemaphoreInfo { _unused : [ u8 ; 0 ] } extern "C" {
 pub fn AcquireSemaphoreInfo ( ) -> * mut SemaphoreInfo ; 
} extern "C" {
 pub fn ActivateSemaphoreInfo ( arg1 : * mut * mut SemaphoreInfo , ) ; 
} extern "C" {
 pub fn LockSemaphoreInfo ( arg1 : * mut SemaphoreInfo , ) ; 
} extern "C" {
 pub fn RelinquishSemaphoreInfo ( arg1 : * mut * mut SemaphoreInfo , ) ; 
} extern "C" {
 pub fn UnlockSemaphoreInfo ( arg1 : * mut SemaphoreInfo , ) ; 
